[
    {
        "reviews": [
            {
                "review_header": "Powerful and fast smart phone and we like ours!", 
                "review_text": "I just traded in my iPhone 7 Plus for a new iPhone 8 Plus and I love it. The new glass case is beautiful. I also like the display as it is crisper and the color is perfect on the screen. I purchased a gold phone for my wife and a silver phone for myself. This phone is fast. Don’t believe other comments you might see because I officially rate and run speed tests on my phones. The gold phone, we purchased, is rated the fastest phone smart phone in the world at this time. It’s Antutu rating is 219575 and the second silver phone is rated at 216318. This phone just blows away my iPhone 7 Plus with speed and downloading apps and animation quality. My old iPhone 7 Plus was rated at 178438. This speed is due to the new A11 Bionic chip with 64 bit architecture. This phone has the new bluetooth 5 which succeeds bluetooth 4.2. Bluetooth 5 is backward compatible to the previous versions. The new bluetooth has twice the speed of the 4.2 version and about 4 times the range. That is amazing since it uses less power and its message capacity is 255 bytes versus 31 bytes which makes the data payload of the 4.2 version rated at 20 bytes max. This is a major distance and data transmission increase in performance. I notice it when I lay down my phone and walk away and my Apple Watch 3 is still connected when before I would lose connection with my older iPhone. The phone is designed to be IP67 for splash, water and dust resistant. The camera is still 12 MP but it has excellent performance with optical zoom and digital zoom up to 10 times. It also still has the portrait camera mode with the blurred background Bokeh effect by using both of the rear cameras. It even uses the new portrait lighting mode to make your photos look more professional. In the video recording mode I really like the 4K video recording with 30 or 60 fps. Of course you still have the front facing camera with 7MP quality for face time or selfie photography. The slow motion mode is nice when shooting sports events or shooting wildlife videos. The phone is slightly larger but is still fits into most of your iPhone 7 Plus cases. The new iPhone 8 Plus weighs just a bit more at 7.12 ounces versus 6.63 ounces. The battery life is the same in the specs but for me it seems to be a bit longer at 22.4 hours. The rating is 21 hours. The new phone is only available in 64 GIG or 256 GIG storage capacity. Overall this is a great phone. I am happy with our new phones and it is a good upgrade in power and performance.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I’ve never had something this beautiful", 
                "review_text": "TechnoMaster sent me a great iPhone 8plus, new and crossed many thousands of international roads but got me the product unlike that dung pile KWIRELESS, heathens. Wow, update. I’ve never owned anything this nice in my life like the iPhone 8 Plus. You can play for days on end with the camera and have the same photo technology as professionals. The camera in the phone working along with an app for tilt and shift produces like 😵. Everything on the case is glass. I can’t dream of a drop and looking for a good case.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Best I’ve Had!", 
                "review_text": "I love this phone! I upgraded from an iPhone 7. I would have to say this is one of the best iPhones I have ever had, and I upgrade every year. The camera is bomb.com. The portrait mode is pretty cool, and even the front facing camera seems to be more clear, (less grainy). The screen is brighter, the true tone display really makes a difference on the screen. This phone is way faster than my 7. The speakers are louder also. This phone has a lot of the same specs as the upcoming iPhone x, but still feels like an iPhone. I was going to get the x, but decided that I would wait until the next generation of that phone. If you can get most of the same specs as iPhone x for less, combined with the familiarity and reliability of the iPhone we are used to, why not do that?", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Where's the thing to open the sim compartment?", 
                "review_text": "The phone works perfectly, it did come unlocked, the only thing I was not satisfied with is that it didnt come with that thingy to open the sim compartment, I had to use one from other iphone. But, the phone worked perfecty and it just beautiful.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Works everywhere", 
                "review_text": "Very good phone, came on perfect conditions and arrived fast. Perfect for those looking for a fast, good looking and with a good camera phone. Unlocked, works everywhere.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "This is the BEST.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I love my new phone it came fully unlocked as advertised", 
                "review_text": "I love my new phone it came fully unlocked as advertised, the box a little damaged but its ok.In general great service i will update if i have any troubles further on.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Its WORTH IT!!!", 
                "review_text": "It came before the time it was supposed to come and im grateful for that 😉", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "The camera with its ability to take sharper pics.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I really like that I got just what I was expecting", 
                "review_text": "I really like that I got just what I was expecting. Although I thought it was a little overprized.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "25%", 
            "4 star": "8%", 
            "3 star": "1%", 
            "5 star": "63%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QNGHS8/pageNumber=1/ref=cm_cr_othr_d_paging_btm_1?pageNumber=1", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Not a I phone", 
                "review_text": "Received wrong item", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "My daughter loved it !", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "It is LOCKED. I bought a UNLOCKED one and received a LOCKED one. Absolutely irresponsible.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "I get a broken phone", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Dont buy phone from this company!!!", 
                "review_text": "This phone said its unlocked and its not! When you call to have someone help you half the time your on hold.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Great gift for wife", 
                "review_text": "Wife jump for joy when she opened it on Christmas", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "It says it’s fully unlocked, but mine came locked ...", 
                "review_text": "It says it’s fully unlocked, but mine came locked. The only carriers that work are T-Mobile, Sprint, AT&T, and Verizon", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "excelente.. new", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Was stoken!", 
                "review_text": "Was perfect but was stolen", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Very pleased with the I phone 8 plus. Meets all my expectations.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "25%", 
            "4 star": "8%", 
            "3 star": "1%", 
            "5 star": "63%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QNGHS8/pageNumber=2/ref=cm_cr_othr_d_paging_btm_2?pageNumber=2", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "One Star", 
                "review_text": "The phone was not a unlocked", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "I love the phone", 
                "review_text": "I love the phone it’s nice", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Works perfect!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "good product", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "I am in love with this phone", 
                "review_text": "I received this phone in a matter of days. Brand new. Unlocked. Functioning very well. I am in love with this phone!!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Excelent!", 
                "review_text": "I still could not prove it because they give it to me in December but apparently everything Ok 😁 the shipment arrived before the agreement, very good. Recommended!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "BLOCKED IME", 
                "review_text": "I bought this phone ,thought it was new but after couple of days IME number was blocked and couldn't use it anymore... decided to send back but again i paid extra amount for shipment.. totally disappointed... :( :( :(", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Easy to use", 
                "review_text": "Easy to use. The speed is quick to open and search things. Still have to figure some things out.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Fantastic phone", 
                "review_text": "I love this IPhone. It's just a very powerful compact computer.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Excelent!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "25%", 
            "4 star": "8%", 
            "3 star": "1%", 
            "5 star": "63%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QNGHS8/pageNumber=3/ref=cm_cr_othr_d_paging_btm_3?pageNumber=3", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Bought and receive it as specified. However, this ...", 
                "review_text": "Bought and receive it as specified. However, this guys do not take their job seriously. Therefore, \"IT SAYS UNLOCKED\" plus \"FULLY\", but it seems that is just a joke. Phone came with a SPRINT Sim card, and my carrier, which is T-Mobile, did not work on it, it said \"Not compatible\". Advise, DO NOT PLAY WITH PEOPLE'S TIME and MONEY. Specially, in Christmas.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great product", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Bought this for my daughter and she won't put it down. She LOVES it!!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Top quality", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "did you said fully unlocked。and when i open the iphone the SIM is lock！", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "nice and awesome product. I fall in love with it.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Was happy", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Scratched phone", 
                "review_text": "It is assumed that the phone screen should not be scratched and a week passed and both sides of the phone were completely scratched. I need to know how can I claim a warranty. The phone is now in Quito Ecuador", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "So far so good!! I’m was surprised at how this actually ...", 
                "review_text": "So far so good!! I’m was surprised at how this actually worked out. I was surprised it was taking long to get to point A total B, but the product did show up perfectly fine! Thanks for keeping your word. More likely to buy from this seller", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Good product", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "25%", 
            "4 star": "8%", 
            "3 star": "1%", 
            "5 star": "63%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QNGHS8/pageNumber=4/ref=cm_cr_othr_d_paging_btm_4?pageNumber=4", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "NEED MY 3.5mm back!!!", 
                "review_text": "Much faster than my 6Plus however the lack of a built in 3.5mm cable is very annoying. If you misplace your adapter like I did you may end up stuck on a 15 hour plane ride with no tunes or videos!!! It's disappointing that they have moved all of their phones but the cheapest model to no 3.5. I'm a long time Apple fan boy but may have to switch when this one dies as I NEED the 3.5 jack!!!!!!!!!!! BTW I tried several of the Bluetooth headphones to include the AirPods and they all are horrible in my opinion and is just another item I have to charge. My wired earbuds/headphones always work as long as the phone has power.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "good", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "My identity was stolen and I did not order this!!", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Former Android User", 
                "review_text": "As a society we rely on our phones today more than ever to perform work related tasks and to expand our social network. For over 4 years I alternated between Android phones, and I believed they were high quality devices. My friends have always declared that iPhones were better, but I tended to discount them. I mean sure, iPhones have better cameras and allow group chats, but could they be drastically better than my Android? Soon enough, I bought the iPhone 8 Plus and realized just how right my friends were. The features that matter to me most when it comes to a phone are accessibility, ease of use regarding the interface, camera, screen size, resolution, and battery life. When I first got my iPhone the first thing that stood out to me was the thumb scanner. Even though it’s a simple concept, I’m a huge fan and prefer this over typing in a code or drawing a pattern. Overall it preserves time, albeit milliseconds it’s time, nonetheless, and I find the thumb scanner to be tremendously useful. Another enticing feature of the iPhone 8 Plus is that it’s waterproof in up to 1 meter of water for up to 30 minutes. In my 5 android phones leading up to the iPhone purchase none of them were waterproof so this was a huge upgrade for me. Now I’d like to talk about the overall smoothness of the iPhone interface. Whether you are connecting to a device via Bluetooth or just surfing the web the iPhone makes things incredibly easy. For example, my last android phone always had trouble connecting to my car’s Bluetooth, but the iPhone connected within 5 seconds. Overall it was effortless for me to figure out the settings, and anything I needed to find I achieved quickly with relative ease. Now I’d like to talk about the camera on the iPhone when compared to Android. Every Android I’ve ever bought didn’t have the best camera. They were always taking blurry pictures and had a painfully hard time focusing in on things. The iPhone takes those issues away by taking extremely clear pictures with noticeably higher resolution. I’m extremely satisfied with the iPhone camera and have no complaints about it. But while we’re on the topic of resolution, the screen itself on the iPhone is very clear, large, and material is painless to read. One isolated issue I have with my iPhone is its battery life, I feel as if my iPhone loses it’s charge rather quickly and this could be improved upon. Other than the battery life, I believe the iPhone 8 Plus to be a top-notch phone that demands respect. I would consider it my favorite phone to date and I would rate it 4.5/5 stars.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Worth the upgrade from my 6Plus, but what were they thinking by taking away the headphone jack?", 
                "review_text": "Worth the upgrade from my 6Plus, but what were they thinking by taking away the headphone jack? You can't charge the phone and use your headphones at the same time, unless you use a wireless charging pad, which you can't use if you use those magnetic car phone holders (if you cover the spot). The camera is better than my 6Plus, so is the battery. Love the extra Ram and processing power. Just don't understand the lunacy of getting rid of the headphone jack. I'm also not a fan of iOS11. The update added extra wording that eats into Messages, and other screen areas. You can't click on an address and have it map it like it did in the 6 and 6S. You can't have your phone plugged in the car to charge and use for directions and use headphones. You get to have everyone hear all the map updates or Waze announcements. There is no way I'd upgrade from 7 to an 8 unless you just wanted the extra GB of RAM and faster processor. Buyer beware....", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Fast performer with excellent dual speaker stereo sound", 
                "review_text": "Significantly faster than the 6 Plus I used to have. But the biggest improvement compared to the 6 Plus are the dual stereo speakers. Both the quality and volume of sounds (e.g. music and youtube videos) is now about as good as the latest iPad Pro or Macbook Pro. The retina screen initially seemed worse (had an orange tint to it) than the 6 Plus from a white balance standpoint, but fortunately I learned the orange tint could be eliminated by going to Settings > Display & Brightness > adjust True Tone to the Off position. Then go back to Settings > General > Accessibilty > Display Accomodations > Cool Filters set to ON > click on Color Tint until a check symbol appears and then adjust Intensity and Hue sliders to the level of screen whiteness desired.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "I did not order this iPhone.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "If you don't want iPhone X but still want best iPhone then this is it.", 
                "review_text": "Purchased this directly from Apple store. Upgraded from iPhone 5s 64gb. If you're Apple person, almost no learning curb. Price though is stratospheric though cheaper than iPhone X. Unit is blazing fast compared to my old iPhone. Screen is not OLED but still look wonderful with True Tone feature. Lost use of some software because developers did not upgrade their software from 32-bit to 64-bit. Speaker sound is much improved and really it is pleasure to listen while watching movie. Even though optical zoom is only 2x, it is nice to have. Digital zoom will go up to 10x but you pay in term of graininess. Guts are virtually same as iPhone X. Probably the last of \"old-style\" iPhone and most perfect in term of integration of software and hardware. Will do wireless charging but you'll have to pony up xtra money for charger and stand. Unfortunately, it will not fast charge like some Samsung android smart phone. Best to invest in good case and screen protector as unit has glass back (to facilitate wireless charging).", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Some things were better and some were not", 
                "review_text": "I \"upgraded\" from an LG G5 Android phone to an iPhone 8 Plus running iOS 11.0.3. Some things were better and some were not. While my family has had many Android and iOS devices, the iOS devices cost more but generally get (much) more use, plus they hold their value better. My favorite Android device (which has gotten a lot of use) has been my phone (an LG G2, then G4, then G5). UPDATE: I ended up returning the iPhone 8 Plus and getting a Pixel 2. There was just too much missing from iOS and the iPhone that Android had plus I was disappointed with the camera. I think the iPhone 8 is a decent phone but it's not for me (even though I use iPads). Read below for more. TIP: Don't buy mobile phones from Best Buy as they charge restocking fees. Hardware comparisons: * The G5 was much cheaper than the iPhone. * The G5 has a user replaceable battery and microSD slot. * The G5 is not waterproof but the iPhone is. * The G5 has dual cameras and one is a wide angle lens... I will miss the wide angle lens. * The G5 has fast charging and includes the needed cable and power adapter to do so. The iPhone 8 supposedly also has fast charging, but it will cost you $$$ to buy the needed cable and power adapter. * The G5 has a small color charge/notification LED which is nice. The iPhone can use the flash for alerts (General->Accessibility->LED Flash for Alerts). * The G5 photo aspect ratio is 16:9 and the iPhone's is 4:3. I *MUCH* prefer 16:9. Disappointed. * My G5 developed a focusing problem with the main camera where photos would often be blurry, which is what prompted me to start researching new phones. * The iPhone 8 Plus also has dual cameras, but no wide-angle camera... however, you get a 2X optical zoom camera and portrait mode photos which I am looking forward to. * The iPhone 8 has (slow) wireless charging but the G5 does not. * The iPhone 8 has 3D Touch but the G5 does not. * The iPhone feels like high end hardware, has a great IPS screen, and has great build quality but it's a little on the heavy side. The G5 is good too but doesn't seem quite up to the iPhone. * The glass back worries me but Consumer Reports says it is a rugged phone and survived their \"tough 100 drops in the tumbler with just some minor scratches\". iOS/iPhone negatives: * Speech recognition is not as advanced but it's not terrible either. * Speech recognition does not give you options to choose from a list of phrases of what you might have said. * I found it virtually impossible to place the cursor in the middle of a word when editing text. Very annoying. * Sometimes when I tap something it doesn't respond and I have to tap it again. This seems to happen mostly on small buttons. I didn't have this issue on the G5. * No always on display feature to show time and notifications. Many Android phones have had this for awhile, including the G5. Hopefully Apple will add this in an update as it's a very useful and convenient feature. * Can't configure bottom row of touch buttons. On Android, I had a button to quickly show and hide notifications. I found it better and faster than having to swipe down. * It seems Apple does not allow custom keyboards to access voice dictation... which means you have to switch keyboards to the standard one in order to access voice dictation. I use voice dictation a lot on my Android. * Home screen is not as configurable. Cannot control icon layout as much. * Some of my favorite apps (frequently used) are not available on iOS, like NOAA Weather and ColorNote. * You can turn on 'Reduce Motion' to limit animations that slow things down, but there are still some fades and other effects that you can't turn off. Android lets you turn off all (or almost all) \"eye candy\" animations for a faster phone. * Sharing photos to Google Drive made me always select the same folder (it didn't remember the selected folder). iOS/iPhone positives: * Frequent iOS updates. This is a big deal compared to most Android phones. * Easier to communicate with other people who also have iPhones (and there are a lot of them). * Can say \"Hey Siri\" to access Siri even when phone is laying down idle and without touching it. * Better security (so I've read). * Good integration across iPhones and iPads. * I like the way that news is integrated. So I returned the iPhone and bought a Pixel 2 because I like Android better when it comes to phones (although for tablets I use iPads). I really like the Pixel 2 but the LG G5 was great too although it did have some significant disadvantages (like updates). Pixel 2 notes: * It was very easy to connect my LG G5 to the Pixel 2 using the included cable to transfer data from my old phone to the new phone. There's also an included adapter in case you need it. Unfortunately I was disappointed that my alarms did not transfer and I had to re-enter them manually. I also had to re-arrange the icons the way I wanted. * The Pixel 2 screen and phone itself are a little smaller than my G5. I'd like a little larger screen like the G5 has but then the phone would be larger and weigh more so it's a trade-off. * No bloatware or crapware (especially the type you can't uninstall)!!! YEAH! And guaranteed 3 years of updates! These are BIG advantages of having Google phones. * So far the camera is impressing me. It's definitely better than the iPhone 8 Plus camera. I will still miss the wide angle camera on the G5 and the native 16:9 aspect ratio but portrait mode and the overall photo quality makes it much easier to forget. UPDATE: I noticed a quirk in portrait mode processing that didn't apply the blur properly around someone's hair... hopefully that will be improved/fixed. * Can turn off animations - I like to do this to make the phone feel even faster: https://lifehacker.com/disable-animations-on-android-to-improve-performance-1583554900 * The phone seems very fast, even when it was installing a bunch of apps in the background. It's the fastest and smoothest phone I've ever used. * The sound form the front-firing stereo speakers is best I've heard from a mobile phone. * I wasn't too happy there was no headphone jack, but I was pleasantly surprised that the headphone adapter seemed to be less intrusive than I anticipated and I am pretty certain that the sound quality through the adapter (which has a DAC in it) sounds better than my LG G5. I'll probably pick up an extra adapter or 2 (they are only $9 each) but are out of stock right now in the Google Store. Good audio video: https://www.youtube.com/watch?v=9Pi_SykMCsI * The always on display looks great with OLED, and this is a really nice feature that you don't get on iPhone. * I like that you can change icon shapes (square, circle, \"squircle\", etc.). * I found out my mobile data wasn't working. After a few hours researching and messing with stuff, I ended up having to use a new Tracfone SIM and getting my service transferred to the new SIM. * The Pixel 2 has a 'Now Playing' feature that listens to any music that's playing nearby and tells you the name and artist (even on the always-on display), but I'm not sure how practical it is. By the way, it works without mobile data and WiFi and without sending audio to Google. UPDATE: I went to Target and my phone was identifying the background music Target was playing. Pretty cool, especially if you've ever wondered what a song is that was playing. * Fast charging is great (especially when you need it), and the Pixel 2 includes a beefy fast charger. * I really like that Google increased the warranty to 2 years. With the extra 24 months I get with my credit card, that gives me a 4 year warranty. Too bad it doesn't cover accidental damage though. * The Google Assistant is tops when it comes to brains (smarts), and can be activated with a squeeze or by saying 'hey Google' or 'OK Google'. Pixel 2 Android disappointments (could be rectified with Android updates): * No battery life indicator on the 'always on' display (my G5 had this and it was useful). * My LG lets you customize the navigation bar but the Pixel 2 doesn't without a little \"hacking\" it seems. I really liked that I could add an extra button to pull down the notifications. Maybe they will add this in Oreo 8.1. * There is a double-tap feature to check your phone but unfortunately you can't double tap it to turn the screen back off (my G5 had this too)... this one is kind of nitpicky though.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "I hate mine... After one day calls would studder and no one could hear me.", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "25%", 
            "4 star": "8%", 
            "3 star": "1%", 
            "5 star": "63%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QNGHS8/pageNumber=5/ref=cm_cr_othr_d_paging_btm_5?pageNumber=5", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Every year become worse.", 
                "review_text": "I like apple devices, but every year they become worse. I have this iphone and it lug sometime. Else why apple declare waterproof iphone, but don’t give warranty if water will be revealed inside phone. No good, Tim.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "Not satisfied..", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "iPhone is not worth paying a fortune", 
                "review_text": "I used to be a hardcore iPhone user and used the models 3 gs, 4, 4s, 5, 5s and finally SE. I was pretty upset that the 6s plus I bought to sister had touchscreen issues within the first 3 months. Then the data cable of my SE worked only for 1 month and stopped charging without a reason. My older 5s’ touchscreen home button died after 2 years.I decided to give a chance to android phone and bought an unlocked ASUS Zenfone 4 Max Pro for mother .. only for $200. It was spectacular, looked and felt very solid and works like a champion with it’s stunning 5000 mAh battery. Then I bought myself a second phone to use for reading news at night as my SE is pretty small. I bought an unlocked Hiuawei Nova 2i (5.9 inch), it was only $230 .. I truly loved this phone for surfing the net and read news etc. It has an elegant look, thin, light, great pictures and all the futures an iPhone 8 has and only for $230 .. so my last iPhone was SE, I am an android user from this point on.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Great for multitasking", 
                "review_text": "The iPhone 8 Plus has been a total game changer and enhanced my life in ways that my previous phone could not. For example, the large, high resolution screen make it impossible to look away from while driving and the blazing fast A11 bionic processor allows me to scroll through Instagram feeds and watch fail clips in high def as I weave through traffic completely unaware of my surroundings. The speakers are just amazing on this darn thing too. They are surprisingly bass heavy for being so small and are able to hit the mids and highs at high volume with exceptional fidelity. This became evident on the subway when the guy from the next car over came over and broke my nose after because I couldn't hear him telling me to turn the volume down. All in all a rockstar product. 10/10 would buy again.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "the pictures on here definitely make this look a lot ...", 
                "review_text": "the pictures on here definitely make this look a lot sketchier than it is. Mine came perfectly shipped, no cracks in the glass. Even included a sim card tool. in new packaging and the whole 9 yards.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Iphone 8 plus", 
                "review_text": "I will be buying the iphone 8 plus rose gold from Apple directly and the phone retails for 799.00 just a little FYI so all of you who are buying this phone are paying way to Much for it", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Noticable improvement over 6 plus", 
                "review_text": "Went from 6 plus to 8 plus. New phone is slightly more responsive and battery life went from great to phenominal. The wireless charging alone was reason for an upgrade. Got the Choetech T1513 wireless charger and it works perfectly with this phone even with the case on.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Just Amazing", 
                "review_text": "You are truly amazing for making my little brother sooooo happy. You deserve this 5 star review", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Can i get an iphone 8 plus for an example ...", 
                "review_text": "Can i get an iphone 8 plus for an example for my youtube channel i will appreciated so much", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "5 the phone is great..", 
                "review_text": "Follow me on IG @ lul_0.5 the phone is great.....", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "25%", 
            "4 star": "8%", 
            "3 star": "1%", 
            "5 star": "63%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QNGHS8/pageNumber=6/ref=cm_cr_othr_d_paging_btm_6?pageNumber=6", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "Hey, i do Youtube and i was wondering if i could do a review on your product ... RSVP.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "and a boring one at that a apple", 
                "review_text": "900 bucks and no headphone jack save your money for 200 bucks you can get a phone with more features bigger display and oled screen, i dont get how people pay this much for a brand, and a boring one at that a apple? are you kidding me", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "very good indeed", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Review on YouTube", 
                "review_text": "I would love a free sample to rate it on my YouTube channel.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I would like a free sample", 
                "review_text": "I would like a free sample", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "25%", 
            "4 star": "8%", 
            "3 star": "1%", 
            "5 star": "63%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QNGHS8/pageNumber=7/ref=cm_cr_othr_d_paging_btm_7?pageNumber=7", 
        "name": ""
    }
]