[
    {
        "reviews": [
            {
                "review_header": "Awesome seller! Thank you Euluck! :)", 
                "review_text": "Arrived in perfect condition, box in perfect condition. No scratches, dents, nothing. Fully unlocked, worked in Palestine. 256GB, check. Brand new, check. All original parts, even the sim ejection tool, check. So happy! :)", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "very satisfied I would buy again, all excellent", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Don’t like when people are not truthful", 
                "review_text": "These guys lied!! It’s not fully unlocked. It’s only GSM unlocked which means it won’t work on sprint or Verizon. Very unsatisfied with this!! Don’t like when people are not truthful.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "From a 6S to an X - A wonderful, luxury, phone.", 
                "review_text": "I received my X on launch day and I absolutely love this phone. If you would like a list of just my thoughts on the phone, scroll down pass the introduction. The transition: NO home button! The staple of the iPhone is gone; well, moved to a little notch at the top. I was expecting this transition to a home-button-less iPhone to be difficult, but all of the gestures feel so natural. I find myself annoyed trying to utilized an older iPhone as the interface now feels clunky. Switching through apps, opening the phone, accessing everything, it's all so easy. Now, this isn't to say there isn't a transition and while everything feels natural, there is a period of time where you have to get used to the new interface and some aspects that initially seemed difficult become second nature. For example, reachability was a favorite feature of mine and while it was initially hard to activate, I have now learned how to activate it without an issue (reachability brings the iPhone screen down halfway to reach top parts of the screen without moving your hand). Face ID: I was skeptical to say the least, but Face ID works (almost) perfect. It does however learn from its missteps and if it fails to identify you, it will add that data to its cache. I personally scanned my face normally the first time and on the second scan did it at roughly a 45 degree angle so I could lean over my phone to view notifications. As I've adjusted to Face ID, it has gotten faster and faster at scanning my face and it's not something you need to wait on to open your phone. By the time you swipe up on your phone, it's unlocked and ready to go (I seriously forget I have a password). I also really enjoy the ability to utilize Face ID for my password for other logins and the ability to open up an app directly from the lock screen without having to then enter my fingerprint/passcode. It's important to note here that your privacy is well, yours. No one has access to the data Face ID gather's and it is truly yours. Apple has a good track record on keeping your data private as they are not in the data business (hello Google & Facebook). The price: There seems to be this running idea that a $1,000 phone is a crazy purchase, but I would have to disagree. Why? My logic is as followed: Phone's are one of the most used devices (easily mine) so for starters, I would like a nice one. If I didn't buy the device in full, I would have been paying roughly $2/ a day on a contract with Verizon. The base model is a 64GB iPhone loaded with the best Apple has to offer. A 128GB 6S at launch was $850. Yes, there's a price difference, but my point is that it's not as gigantic as it may seem. I personally would advocate a 64GB version and utilizing cloud storage if you need more space, but do note, this is Apple's flagship and there are cheaper iPhone's out there. What I love: - The screen looks amazing. The colors are vibrant, the blacks are deep with black wallpapers flowing aimlessly into the phone (to the point you cannot see the notch in the screen if the wallpaper is black). - The Notch! Yes, the notch. Some people seem to hate it, I think it's iconic and makes the iPhone X stand alone in oled sphere. It fades into the user experience and I have not had any issues with it. - The screen size. I have always wanted a plus, but I always felt like it was too big for my hands. That I would drop the phone and there it goes. The X remedies this for me and I get to use a larger screen in nearly the same form factor as my 6S. The screen truly looks amazing and if you haven't seen one, check one out at a local store. - I'm not sure how much of this is just because my 6S was a few years old, but the taptic engine in the X is amazing. As in, when the phone vibrates, I can easily identify what it is through the vibration and the vibration itself feels smooth. - Force touch is also fantastic and the haptic feedback on everything from a like on twitter to moving apps around is wonderful. Makes the screen feel more three-dimensional in a way. - The camera takes wonderful pictures. I have taken a few pictures in portrait mode and some pictures genuinely look like they were taken with a DSLR camera. - The speakers are louder than I expected and sound very clear. Great for impromptu music listening. - The phone is a little heavy, but it is definitely comfortable to hold. It feels like a luxury device and has a certain weight to it. What I don't: Honestly, I do not have a genuine complaint at this point. The only complaint that comes to mind revolves around the lack of optimization I have faced in some apps, but that is a developer problem and even then, developers have optimized a majority of their apps and my issues have been few and far between.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Verizon SIM card Damage LCD!", 
                "review_text": "Why did mine came with a verizon SIM card I pray to god this is unlocked since I’m stationed in Korea serving the military so I can’t test it yet. My receipt said that it’s silver and $980 The LCD is also damage on the bottom!", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Dummy phone !!!", 
                "review_text": "I recieved a display dummy phone this was a major fraud. It was nicely taped in an original iPhone box. When I opened it i saw it was light and thought the sticker (as shown in pictures) was a screen protector. Sadly it wasn’t it was a dummy phone. $1300 for a dummy phone. When I called amazon the customer service staff was stunned I’m so upset !!!!! No stars !!!", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Arrived in perfect condition, box in perfect condition", 
                "review_text": "Arrived in perfect condition, box in perfect condition, 100% original and New. No scratches, dents, nothing. Fully unlocked, worked in Colombia/South America. Excellent seller.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Genuine product", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Working Fine!", 
                "review_text": "Perfectly working well at this time. Although it is pricey!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Amazing! It arrived brand new and everything is perfect.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "24%", 
            "4 star": "7%", 
            "3 star": "3%", 
            "5 star": "65%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QN8NDH/pageNumber=1/ref=cm_cr_othr_d_paging_btm_1?pageNumber=1", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "nice Iphone x", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Amazing phone and great features and long lasting battery", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "nice and awesome product. I fall in love with it.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "The best of the best!, excellent screen, easy to use...", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "My order was new iphone x but no i phone in the box !! Just empty box !", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "great device", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Great and quality device!", 
                "review_text": "Great build quality, great screen, great battery life and the best feature is the Face ID, quick and realible, much better and fast than a fingerprint scanner. The bad side it’s too expensive for what it is.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Love it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Got exactly what I was expecting, a brand new iPhone X. No issues with it whatsoever.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "FRAUD - Its not Fully Unlocked - Its locked", 
                "review_text": "This Description says its a FULLY unlocked I-phone X, when we bought 3 months ago. it works fine in the USA but when we brought it to Indonesian it is LOCKED! We couldn't test till we left the country and the Seller will not respond. THIS IS FRAUD! We cant use it for its stated purpose and it couldn't be tested till you left the USA. we just need the code to unlock it. My friend just won $3000 in a court case in Cleveland suing Apple over the same issue. I guess thats our next step if no reply.", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "24%", 
            "4 star": "7%", 
            "3 star": "3%", 
            "5 star": "65%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QN8NDH/pageNumber=2/ref=cm_cr_othr_d_paging_btm_2?pageNumber=2", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "Exelent phone, works just how it’s shown.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great product. Would highly recommend.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "So amazing!", 
                "review_text": "Love love!! Getting another one for my mom as her Christmas present!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "works great. Awesome Phone", 
                "review_text": "Arrived early, works great. Awesome Phone!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "Looks Goods...Thanks !", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Great Product from Apple!!", 
                "review_text": "Great! Bought it for my son and he is very happy with it. He says is awesome and that he fully recommends the item.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "It's an excelent smartphone, more that I expected!!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Black screen/ won’t turn back on", 
                "review_text": "I just got mine today and a few hours ago it won’t turn on, was working fine when I opened the box but after I stoped using it just went black and won’t turn on..", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Iphone x", 
                "review_text": "excellent product and great and fast services and fast response", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great phone.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "24%", 
            "4 star": "7%", 
            "3 star": "3%", 
            "5 star": "65%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QN8NDH/pageNumber=3/ref=cm_cr_othr_d_paging_btm_3?pageNumber=3", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "My husband loves it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Excellent!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I love it It is number one in the world And ...", 
                "review_text": "I love it It is number one in the world And it work with 4G network", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "... X that we all know the truth of how amazing it is", 
                "review_text": "So many things are said about the iPhone X that we all know the truth of how amazing it is! Follow the tradition of growing with the brand is something that only Apple could achieve. This change from my iPhone 7plus to X is amazing! The most dramatic change is the absence of the button of the footprint, so I must always try to be with a good smile. You will love it! :-D", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Everything ok", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great phone. Super fast and a really good camera", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "5 minutes with the iPhone X", 
                "review_text": "This phone is all about that display, and I couldn’t stop looking at it. It’s really amazing. It’s bright, it’s vivid, and it’s enormous. The iPhone X is the future, and I can’t wait to learn more about the capabilities and various gestures possible. My sons already love it so much that I have to get 2 more for them tomorrow. Maybe even today. Lol That’s how excellent and superb the X is.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Iphone X: A complete re-design and leap forward for Apple.", 
                "review_text": "Everyone reading this is probably familiar with the Apple phone line up so I am going to focus on the differences between the iPhone X and iPhone 7 plus specifically. First off, the set-up process has been significantly streamlined. When setting up your new iPhone X setup will ask you if your old iPhone is nearby, select yes, and you can wireless transfer all your apps, settings, backgrounds, passwords, etc. to your new phone in a few clicks. I really appreciated this streamlined process and it was incredibly quick and easy to transfer all my settings to my new iPhone X. The other main features that have been upgraded are as follows: New screen (5.8” OLED is the most vibrant and clear screen ever produced by Apple) - Apple has removed the touch ID sensor and bezel around the old iPhone screen which means the iPhone X has a noticeably smaller footprint while maintaining a larger screen size than the iPhone 7/8 Plus. (See comparison images attached of the iPhone X versus iPhone 7 Plus). - OLED Screen offers deeper blacks and brighter whites resulting in greater color reproduction. - Similar to the iPhone 8 and 8 Plus the iPhone X uses true tone technology to mimic the lighting conditions around it and adjust the white balance accordingly. - The notch cut out of the top of the screen is where Apple has included the face recognition sensors, front camera, and a host of other sensors. I thought this would be annoying but Apple has cleverly used the screen real estate on both sides to include the time, date, battery indicators, etc. Farewell Touch-ID, Hello Face-ID - Face-ID is Apples new facial recognition technology which has replaced the finger printer reader and home button in order to free up additional screen real-estate. This is new and only available on the iPhone X. - Apples facial recognition is light years ahead of Samsung or any other carrier. I have tested this flawlessly with glasses, a hat, and even in the dark. It is as simple as looking at your phone and swiping up from the bottom. - I was worried this feature would be inconsistent or frustrating but it has worked really well. The only time it is a bit more inconvenient is if the phone is sitting on your desk or a flat surface you kind of have to lean over a bit or angle the phone towards you to unlock it. - This super powerful new camera also enables the animoji features which maps your facial expressions to create a talking emoji. This is a fun feature but more a novelty than anything. - This same true-depth camera makes the iPhone X the ultimate phone for taking selfies. The new portrait mode allows the user blur the background, or even cut yourself out entirely and place yourself on a black background. Additional noteworthy features and changes: - The rear camera boasts a dual 12MP sensor array with improved aperture and wide angle lens with image stabilization. The increased aperture from 2.8 to 2.4 allows for better images in low light conditions. - Video capabilities have also approved as well to include 60p 4k video recording delivering clear, fluid images. - Increased audio quality and volume - Increased RAM size to 3GB and new Bionic Chip makes the iPhone X one of the most powerful smartphones are the market. - Updated design features glass back and sides which make the phone beautiful looking. A very welcome change in the normal design. - Battery life: The iPhone X boasts the largest battery in Apple history with a 2716 mAh battery which is a bit larger than the new iPhone 8 Plus. A full charge from 0-100% takes about 2 hours and 10 minutes in my testing. - In addition, wireless charging has finally been added to the new iPhone X, and 8 series phones. I have not tested this out but am excited to give it a try (Wireless charging pad is not included with the phone). Bottom line, the iPhone X is another smash hit from Apple. Every feature people were concerned about turned out to work flawlessly as usual. I have only had the iPhone for about 24 hours so it is early to leave a long-term focused review but so far the new iPhone X has lived up to the hype. The iPhone X may not revolutionize the smart phone industry but it is a welcome upgrade to the iPhone which designs were getting a bit dated. I am excited about Apples new strategy to release a flagship model and allow the new features to trickle down to next generation’s phones. If you have the money to spare you won’t likely be disappointed. My only complaint is the phone only comes in 64GB or 256GB basically forcing users to pay an extra $150 to get decent storage. Further, the beautiful glass back on the screen feels fantastic and has a great weight to it. However, a replacement screen will cost you $275+ and the back glass replacement is rumored to cost around $400. Essentially a single drop could result in a $700 repair bill. Unfortunately this means most phones will be shielded in a case and will not be enjoyed.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Worth every penny.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great!!!!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "24%", 
            "4 star": "7%", 
            "3 star": "3%", 
            "5 star": "65%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QN8NDH/pageNumber=4/ref=cm_cr_othr_d_paging_btm_4?pageNumber=4", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "Everything is great", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Nifty piece of technology", 
                "review_text": "Beautiful piece of electronics. Now if I can just learn to use it. A lot of good features that I want to use.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Everything was fine!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Very good phone!Very good seller!Very fast shipping!Thank you!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "It came perfectly not a scratch the display was amazing", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great product and service! The phone is working with my carrier in Chile.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Really great phone", 
                "review_text": "Works in South Africa on all networks", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Came on time and it was perfect ( box , cellphone) everything was perfect .", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "IPhone X love it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Best iPhone ever. Thumbs up for the store I bought it from.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "24%", 
            "4 star": "7%", 
            "3 star": "3%", 
            "5 star": "65%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QN8NDH/pageNumber=5/ref=cm_cr_othr_d_paging_btm_5?pageNumber=5", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "excelent phone great condition", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Excellent phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One month of regular use / covered in scratches", 
                "review_text": "I want to start out by saying that I’m a binge Apple “fanboy” and own more Apple products then an average consumer. My first impressions with the iPhone X are great despite to some annoying OS bugs and I would highly recommend the phone. The full screen OLED display is killer and it’s a must experience. My main compliant is that my screen has a ton of scratches on it after a month of a regular use. I work in the office and I keep my phone in my pocket like most of us do. To be homesbe, my iPhkne 6s has resisted scratches for over 2 years and the X started showin scratches within the first few weeks. This is a huge disappointment and it takes away from the beautiful experience of the display. #disapointed", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Amazing, Stupendous Phone", 
                "review_text": "Full disclosure, I bought my iPhone X yesterday at ATT. It is not the unlocked one, but as someone who was hesitant to make the switch, I wanted to write a review. I never get the latest and greatest technology. I always waited and go the \"s\" version of the new iPhone. But the pull of longer battery life and a larger screen in a normal size phone overcame my concern of price, a few negative reviews, and to be honest, the stigma of having the most expensive iPhone ever. I am so glad I did. This phone is amazing. Highlights: Great battery life. On my old iPhone, a 6s, I could get about 4 hours of moderate use before I had to charge, maybe 2 hours of heavy use. I went all day with moderate to heavy use and used less than 50% of my battery. The screen is as beautiful as all the people say. I have found many of my apps have already been updated to take advantage of the screen. The new gestures are very intuitive and in less than 12 hours I was completely used to them. Facial recognition is fast and I haven't had a single issue. I am terrible at taking pictures and this phone makes me look like I know what I am doing. Though there are a lot of setting options, they are really easy to navigate through. They say this is the best smartphone ever, and I have to agree. Negatives: Because this is so expensive, you might be a little overprotective. And you should be. But on my wireless plan, it only increased my payment about $8 month. I don't find that to really be a negative. I haven't found anything I don't like about this phone yet. This is a truly awesome phone.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Totally satisfied! The best phone great pics", 
                "review_text": "Totally satisfied ! The best phone great pics, fast and easy to use. An upgrade from the iphone 7", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "No bad", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "DO NOT BUY IT! There is manufacture defect & ...", 
                "review_text": "DO NOT BUY IT! There is manufacture defect & the seller advise you to deal with the Apple. Apple released SIM FREE so no reason to buy this at all.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "really spiffy.", 
                "review_text": "nice phone.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "PHONE COMPLETELY GUTTED", 
                "review_text": "Received this phone with the screen lifted and it wouldn't power on or charge. I checked and there are no charging contacts in the phone.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Amazing", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "24%", 
            "4 star": "7%", 
            "3 star": "3%", 
            "5 star": "65%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QN8NDH/pageNumber=6/ref=cm_cr_othr_d_paging_btm_6?pageNumber=6", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "Love it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Perfect except the price", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Beautiful phone with one annoying flaw", 
                "review_text": "I came from the 7+ which I absolutely loved but died on me after 1.5 years making the conspiracy of Apple devices intentionally slowing down and becoming hard to use plausible. Given that, I took the plunge and since needing a phone, went with the “future proof” X. It was between the 8+ or X but given the display on the X I made the move. Do I regret it? Pros: Amazing display Exceptionally fast Beautiful design and form factor (bigger display but smaller form is very helpful) Videos are outstanding Camera is world class and photos amazing Wireless charging very helpful Cons: Face ID works but is much slower than fingerprint sensor and a little annoying Battery life is ok, not great, but not on par with 8+ Heats up due to glass back when doing any processes that require it Design is beautiful but glass back makes it incredibly slippery requiring a case to hide that design Let me just say that despite it’s amazing display, I should have gone with the 8+. The Face ID is just not on par with fingerprint sensor. It works, but requires the extra step of swiping up after looking at it. Maybe I’m just being way too picky but when you are used to just placing your thumb and opening instantly every time, it’s the one thing they just drives me crazy. You get used to the other gestures but again, just not as simple as using the 7 or 8. Would I buy it again? Probably not especially at the cost and extra $250 vs the 8+ which doesn’t have the screen of the X but pretty much everything else. While maybe not a big deal to some, I just can’t get past the Face ID being more of a gimmick then a necessity and I fear that’s the future of all iPhones like removal of the headphone jack.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Great Phone", 
                "review_text": "I bought this phone from apple so that's why it says not verified review but let me get some things out of my chest. Apple has a superior operating system. Period. Samsung, HTC, Pixel can all have better quality cameras or displays or better battery life but apple IOS is light years ahead of android. Android haters like to bash on apple for removing the headphone jack adding the notch (which is barely noticeable) but if you look now there are a lot of phones copying the notch from apple? You tell me. I don't like android because it's buggy. Sure it might run well on super expensive phones like pixel 2 or samsung but it still crashes more often than IOS does. I buy apple phones because of the simplicity of the IOS (not that I'm dumb or can't handle android, I build my own gaming computers). Hardware is nice but operating system is more important in my opinion.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Dont do it....", 
                "review_text": "I returned my iphone x, I'm upset that the screen size wasn't offered in the same frame as the iphone 8 plus. That's ridiculous for the price of this phone, apple of course will release the larger screen size next to around. FACE ID is terrible and there is no finger print sensor either this could have easily been added somewhere on the back of the phone or under the screen. My iphone 7 plus was more advanced than this garbage phone. At this price point I expected much more, I will end up buying the Galaxy s9 plus for now or keep my iphone 7 plus. This phone is a huge disappointment i canf believe they didn't offer a plus size version, this is just Apple's way to grab more money from consumers when they release their next model. I cant recommend this phone to anyone with this price tag, its maybe worth $600 max. My advice would be wait for the next model or buy another phone brand if you really need to upgrade", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Perfect", 
                "review_text": "Closed box", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Three Stars", 
                "review_text": "It was good", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "Now arrived", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Some Apple x screens are shipping with defects.", 
                "review_text": "Have had phone 10 days and OLED screen is experiencing green line on edge of screen. CNET and Apple’s own user community forum are indicating this is hardware manufacturing defect. Screen has green hue overall, so I now have to schedule appointment at Apple Genius to return for replacement.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "I was much better off with an 8 and so will be returning ...", 
                "review_text": "There is no fingerprint reader. The face recognitions I have reset several times and doesnt seem to work well for my face. I was much better off with an 8 and so will be returning mine. If you have sweaty fingers the screen seems to be even more sensitive to than previous editions and doesn't work well with that. It's especially hard to get it into the open app menu to clear them when fingers were not clean and dry.", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "24%", 
            "4 star": "7%", 
            "3 star": "3%", 
            "5 star": "65%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QN8NDH/pageNumber=7/ref=cm_cr_othr_d_paging_btm_7?pageNumber=7", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Great Phone but NOT evolutionary! A bit overpriced for the value.", 
                "review_text": "Late last year Apple released their iPhone X, the 10th generation iPhone and the flagship of their line-up. When it was first announced in September 2017, there was a lot of media coverage and many people were excited for it to go on sale. It was possibly the largest change to an iPhone the world had seen, and I had to get it. Sadly, I missed the online pre-order date, therefore I ended up on the second floor of the Galleria Mall parking garage at 10:30 pm wrapped in a sleeping bag on a lawn chair. After an 11hr and 33-minute wait, I finally was able to hand Apple $1400 for the phone. But was it worth it? I love the software and user interface apple generally produces. However, for the price I paid for this phone I expected it to have a bit more of a ‘Wow-factor’, in terms of the ‘evolutionary’ technology that the device was advertised to possess. I do think that this device is a platform for them to build a lot of new and innovative technology off of, however, despite my excitement for that, the reality is that I spent a lot of money on an iPhone that doesn’t do that much more than the previous generation. The features I enjoy include: the new Face ID biometric security feature, the beautiful OLED edge-to-edge display, the incredible camera quality, wireless charging and water-proof feature. That being said I don’t think this phone was worth the price, much more the iPhone 8 and not significantly better. Don’t get me wrong, I do love the device, just as much as a love most products apple produces. When it comes to value however, value defined as the worth of something compared to the price paid or asked for it, I am not sure if I consider this item to be of good value. Initially, when I saw the launch event followed by the numerous exhilarating, colorful, dynamic ads I was under the impression that this phone would provide new user experiences using the augmented reality (AR) technology built in to the device. The camera is just as good, if not better than I expected it to be and I often find myself in a dilemma due to the incredible quality, I no longer need to carry around my professional DSLR camera. Face ID: the new facial biometric scanner in the iPhone X is astonishing. It projects 30,000 invisible dots on your face, mapping the 3D dimensions which creates a high security level, despite some negative criticism the system has gotten. The phones new edge-to-edge OLED display is the most beautiful display I’ve seen on an iPhone, with high ranges of crisp colors and incomparable resolution. I am a sailor so I am at sea a lot, and near bodies of water. Having the iPhone X be waterproof has been a long-awaited feature for me and I really feel more comfortable having that feature. Wireless charging is an emerging technology that is interesting to me, although it isn’t any more convenient than plugging in a cord, or even less convenient in some ways I had to buy the wireless charging pad just due to my interest in new technology. However, I do often find myself plugging in the cord so that I can use the phone while it’s charging. I am a huge fan of apple and an avid iPhone user, however when it comes to value I just don’t think this phone was worth the $1400 I paid for it and the 12 hours wait in line. There are some features I love such as the great Camera, Face ID, the display and the waterproofing but I expected much more off of the AR capabilities and ‘evolutionary technology’ that this phone was advertised to have. Who knows, maybe this really is a platform for them to build something really great off of, time will tell but in about 8 months the next iPhone will come out and mine will become outdated yet again. Currently, I don’t feel I have gotten the value out of the device that I expected upon buying it.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "iPhone X Defect", 
                "review_text": "My iPhone X expierence so far. Preordered on Oct. 27th and managed to get a Gray/Black 256GB Iphone X. Finally arrives on the 6th and I don’t get a chance to open it up and attempt to hook up my new phone until the 11th. So here I go beaming with excitement to check out my new device that just cost me the equivalent of a house payment. Open it up and everything looks good at first and then I use my iPhone 6S light to look at the screen for any dust as I’ve already gotten a screen protector in hand to put on my new device before I even get started. Then I see it. A very very small scratch or crack under the screen coming from the notch area at the top of the phone coming down maybe 1/2 a cm long. So I schedule an appointment to talk to an Apple rep. for 8:45am and he finally calls me at 8:48am. I explain to him what I observed on my phone and he doesn’t seem to thrilled to help me out today. Maybe because it’s a Saturday and he’s at work. During our conversation he makes a statement that I didn’t really care for. Such as... Maybe the delivery man dropped your package and maybe that’s what happened. Obviously this is a manufacturing defect since it’s under the screen. So I get two options. Option A) Send my phone in to be repaired and who knows how long that will take and why would I want a brand new item I just paid a lot of money for to be repaired due to a defect. Option B) Go to the Apple Store and have them look at it and I can try and request a new phone. Oh and the next available time I can get an appointment is 4 days away and I’ll have to take off work early to resolve an Apple manufacturing defect. So I guess we will see how my Apple Store experience goes. I’ve had an Apple phone going back to the 3GS days and I’ve dealt with Apple Customer Service in the past with no issues but so far I’d have to say I’m extremely disappointed in the quality control of the IPhone X and the customer service expierence with Apple. Hopefully all is redeemed on the 14th. To be continued...", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Irreplaceable fragile glass back unacceptable", 
                "review_text": "Not a fan of the fragile glass back which costs 550 dollars and a complete disassembly/chassis replacement to fix. That is a massive design failure by making something that should be user replaceable such as the iPhone 4s back. Now I’m left with a shattered phone which can’t be fixed. It’s a good thing I have a phone case to stop me from cutting my hands, otherwise it would be a safety hazard. FYI, this happened with my case on. If you choose to have Apple fix this issue they will be replacing the entire phone which is environmentally irresponsible and greedy by pocketing 160 of that 550 you paid. Besides that this is a solid phone comparatively, I do like the stainless steel frame over their aluminum from the past but wish that I could omit wireless charging and have the stainless steel material throughout.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "iPhone X - A Phone From the Future", 
                "review_text": "iPhone X – A phone from the future Making the jump from the iPhone 7 plus to the iPhone X was a big decision to begin with, how much could change in just one year? Well to the surprise of many (or maybe not) Apple once again crushed this phone. All of the enticing new tricks and treats tucked inside this amazing looking phone was everything Apple users hoped for and more. To review this product all of the following will be taken into account, innovation, battery-life, design, durability, cost, and operating system. To begin, the ideal user that would buy this phone would be someone with an interest in technological innovation, an overdue upgrade for their current phone, or someone with the desire to just experience what Apple truly stands for, “to design the best personal computers in the world.” One of the only downsides that you may experience with this phone is the price tag. Ringing up at $1,132.00 for the 64 GB and $1,296.96 for the 256 GB may leave a dent in your wallet. Excluding the price tag on this sleek and attractive phone, it is perfect for a user who is constantly checking, or on their device. With the new adaptions to the iPhone X you will now be able to implement the seamless opening and surfing of apps with face recognition as well as fluid finger swipes. Even while boasting these streamlined new tools, the iPhone X also holds a 19.5-hour battery life. Almost double the battery life of the previous iPhone 7. So, if you’re a business man or woman, student, or avid technology guru, you will be pleased with the care and effort put forth into making this phone one of a kind. Moving on to the design and innovations of the phone. You will now be able to unlock your phone with the most unique thumbprint of all, your face. This allows for easy unlocking, as well, it can be used to make purchases and log onto various apps or websites while surfing the internet. Along with this is the removal of the home button. Though it took a while to get use to this change, overall it was a positive step forward. To get home on your phone now you simply swipe up from the bottom of the screen, quick and easy. Following the patterns of innovation stated above, the new iPhone X carries a dual 12MP sensor array as well as improved aperture and wide angle lens that is supported by image stabilization. This makes for perfect pictures, all the time. Not to mention the video capabilities have improved to include 60p 4k video recording, allowing for some of the best phone recorded videos ever. For the interiors of the phone, Apple has increased the RAM on the phone up to 3GB, allowing the iPhone X to be one of the fastest phones on the market. When it comes to durability and cost, you may be a touch disappointed, though it must be pointed out. With the front and back of the iPhone X being glass, one drop will lead to a pricy fix (upwards of $700). Though the glass is now better quality and more durable, a drop can lead to serious costs. Some would argue that the price tag on this phone should alleviate some accidental drop costs but with quality comes price. With the potential for a costly drop, you are able to buy a case along with newly designed durable screen cover that can save you from the $700 down the road. In conclusion, this is the best phone you would be able to purchase at this time when considering reliability, innovation, and usability. Apple once again did a fantastic job designing this phone and if you’re on the fence about the purchase there are many options to upgrade or a 2-year payment plan with built in AppleCare. Overall this could be the phone that changes your perception of what a phone is and what a phone can do.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "iphone X - Too many cons for me", 
                "review_text": "I have had the x for sometime now. I can say that of all the iphones, the x is my biggest disappointment. I do not always get text messages, my reminders may or may not notify me, I can no longer send a text with the special effects, etc. This morning my alarm sounded for maybe two seconds and then just shut off. I have been told to bring it back due to it being a hardware issue. Now, I get that these things may happen on occasion but the fact that close to 50% of people that I know that did splurge for the x are having issues. Some, including my husband, are opting not to make a swap because they don't really care about the special effects??? It's more than that. I feel this product was prematurely released and I not happy. The not having a home button is an adjustment, can't say I'm a fan. The face recognition is awful. I feel that it is a HUGE safety concern. If someone grabs your phone, be it your child in school and whether it be horsing around or not, they grab the phone and unlock it with your face and run off. A young mom, walking with a stroller and small toddler in tow, gets mugged, a shopper distracted on their phone and a thug steels it. These are all legit concerns. Yes, you can opt to not use it, which my family has done. I am truly disappointed. I called Apple customer care and was told that they have received many calls like mine. The x by far being the most complaints with hardware issues. Save your money and get the 8 or maybe try another brand but do not waste your money on the x.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Could not play VOICEMAIL. Seller took 30% restocking fee ...", 
                "review_text": "Could not play VOICEMAIL. Seller took 30% restocking fee.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Sometimes, my iPhone X can not be unlocked with ...", 
                "review_text": "Sometimes, my iPhone X can not be unlocked with the face ID, persistently, i.e. no matter how I look at the phone. When this happens, it can not be shutdown either. I must enter the pass-code to unlock. Once it is unlocked with the pass-code, the face ID will work for awhile to unlock the phone.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "worst product i ever saw when i got the phone", 
                "review_text": "This is the worst iPhone I’ve had the miss fortune of having. worst product i ever saw when i got the phone it was damage badly and i paid for shipping and handly", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Good phone i love it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Ripoff", 
                "review_text": "easily broke I want another one, didn't work at all", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "24%", 
            "4 star": "7%", 
            "3 star": "3%", 
            "5 star": "65%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QN8NDH/pageNumber=8/ref=cm_cr_othr_d_paging_btm_8?pageNumber=8", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "it is my favorite phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "The size is good for reading e-books and for playing Bridge Baron. Slice of Life Stories", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Quality Problems with the iPhone X", 
                "review_text": "just bought an iPhone X for my son in college to replace his iPhone 7+. He called us tonight but the speakerphone quality was horrible. He could hear us fine but it sounded like he was underwater (it was too difficult to understand him so we hung up early). I am quite sure it was not a signal issue as we speak with him every Sunday from his apartment with good signal (AT&T). My advice is to take your time ordering in case it is a hardware defect that cannot be solved by a software update. Hopefully it is the latter given what I paid for it.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Don’t upgrade, it’s a downgrade", 
                "review_text": "This is the worst iPhone I’ve had the miss fortune of having. It malfunctions all the time and doesn’t work all the time when you press simple radio buttons for the flash light, very frustrating.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Own the future of smartphones NOW", 
                "review_text": "Upgraded from an iPhone 8 Plus. Must say it took some time getting used to the X but I love it. FaceID has worked well over 80 % of the time for me. The OLED screen is beautiful. The notch is not noticeable after you get used to it and distinguishes the iPhone.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Compared to my iphone 6s oled screen sucks..", 
                "review_text": "Compared to my iphone 6s oled screen sucks... Terrible angle view... you can see 50 shades of each colour depends the angle...white turns to blue or red or green... Its heavy and you can feel it Maybe thats the reasson that the x is the moat fragile iphone ever Not happy at all", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "... wait to be apart of history by owning this GREAT phone!", 
                "review_text": "I cant wait to be apart of history by owning this GREAT phone!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "One of the best photo", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "the best phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "I would like to test the product to see how well it works.", 
                "review_rating": "4.0 "
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "24%", 
            "4 star": "7%", 
            "3 star": "3%", 
            "5 star": "65%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QN8NDH/pageNumber=9/ref=cm_cr_othr_d_paging_btm_9?pageNumber=9", 
        "name": ""
    }
]