[
    {
        "reviews": [
            {
                "review_header": "Phone junkie loves the Note 8", 
                "review_text": "I have had 30+ smart phones over the past 9 years from HTC, Motorola, Nexus (all except the 4), Blackberry Key One and all of the Galaxy S models plus the Note 2, 4, 5 and now the 8. My favorite phone was the Note 5, but one day I walked into T-Mobile prepared to buy the Note 7 and something steered me away from it. I ended up walking out with an S7 which was a foolish purchase because I only used it for a couple of weeks before I started missing my Note 5. Fortunately I still had it so I put my SIM back in it and all was well. When news of the Note 8 broke I was thrilled and I couldn't wait for pre-orders to start so when they did, I ordered one and it arrived one week ago today. My favorite thing over the Note 5 is the beautiful edge to edge display and how bright and legible it is in direct sunlight. At 1,200 nits, I believe it is the brightest screen ever on any smartphone even eclipsing my Blackberry Classic that I thought would never be beat. I am amazed that reviewers never mention screen brightness, but for me it is a very important top 3 feature because I spend quite a bit of time outdoors and it is very annoying searching for shade or trying to cup my hand over the screen just to barely read it. I can assure you that you will not be disappointed at all with anything regarding the Note 8 screen. I have taken approximately 100 pictures and the cameras are excellent. My daughter and I just went out for Chinese food and we were taking pictures of the food and several of my Heineken bottle. She was using her IPhone 7 plus and her pictures were no match for the Note 8 when our phones were held side by side. Her photos looked washed out and dull compared to mine and she even admitted her 7 plus paled in comparison. I like to take macro shots of flowers, insects and lots of other things and all I can say is woww. One shot was of a ladybug and the closeup detail was amazing. The S Pen is more refined and I use it frequently. The single speaker is very loud and clear as is the call quality. Build quality is excellent, but I still despise glass on the back of a phone. People can go on and on about how beautiful the back is, but the same people immediately slap a case on it so its never seen anyway. Why not use some sort of a rubber or polycarbonate back and make it lighter, cheaper, grippier and definitely more durable. After all, this is a mobile device and some people actually use it outdoors and don't like cases. Probably my biggest gripe is the additional weight compared to the Note 5. At 195 grams the additional weight is definitely noticeable and like most men, I carry it in my pocket and there's never a doubt where my phone is. Samsung was smart enough to keep the headphone jack and I assume the SD card is here to stay. I have played with Bixby briefly, but don't know enough about it to comment on how useful it is. I had two ultra thin cases ready and waiting and the one I like best is the matte blue Bear Motion case. It's very thin and light and adds a ton of grip to this rediculously slippery device. It is very fluid and lightning fast and at this point I can see myself using only this phone for at least one year. K", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Former iPhone user loves the Note 8", 
                "review_text": "I am a long time iPhone user. I first tried the Motorola Droid before switching to the iPhone and the difference was night and day. That was back when Android phones were very slow, crash prone and unrefined. By comparison, I loved the fast and silky smooth responsiveness of iOS, the ability to share apps, the tight integration with our Macs and the idiot-proof operation. That was all before Apple tried to get cute. I’d say iPhone “enhancements” started going south somewhere around iOS 8. Suddenly, instead of admiring how iOS always just worked, I found myself seriously questioning if Apple did enough pre-release testing and quality control checks prior to releasing new versions of iOS. It felt like we, the actual users, were the beta testers. The hardware also started getting less reliable as well, beginning with the iPhone 5. I had to have my iPhone 5’s defective battery replaced under Apple’s own little iPhone 5 batterygate scandal that many people seem to have forgotten about. Our entire family owns iPhones and we’ve all experienced some strange issues at one point or another. These were issues like defective cameras (hardware, not software, requiring hardware replacement of the camera), cases coming apart, numerous faulty battery issues and other quirks. I had a 6-plus that would shut down and display the empty battery icon with remaining battery levels in the 20-30% range. As soon as I plugged it into AC power, the phone would power on and the battery charge status would instantly shoot up to 20%. I was tiring of Apple’s deteriorating quality and angry at the fact that they weren’t really innovating enough to justify yearly upgrades. The final straw was when they revealed that they now wanted to charge me a minimum of $1,000 for their newest flagship model. That greedy move pretty much drove me away from Apple. I no longer find their products worth the premium prices they charge. Now, Samsung was not perfect either. My son owned an S4 and Note 5 and both had charging port issues wihin a year. That made me very leery of Samsung. However, the switch to a USB-C charging port as well as the fact that I knew Samsung would do everything in their power to ensure this Note was perfect after the Note 7 debacle convinced me to give this phone a try. So far, I love it. The size and weight are perfect, even in a case. The phone is still easily pocketable despite its apparent substantial size. Voice quality on calls rivals my home phone. The screen is absolutely gorgeous. I compared it to an iPhone X in store and I actually prefer the richer and deeper color saturation of the Note’s screen. The iPhone X screen was a little brighter but also more washed out looking. I keep my Note at 50% brightness all the time and it still looks stunning. My iPhone 7 looked too dim at 50% brightness. The dimmest I could go on the iPhone and still have decent screen quality both indoors and outdoors (not in direct sunlight) was about 75%. I don’t like auto-dim feature on either phone because it never sets the screen to a brightness that I prefer when indoors. The Note screen is also razor sharp thanks to a higher pixel density. I am not a fan of facial recognition on any device and don’t use it on the Note, nor would I use it on an iPhone. I also do not use the iris scanner. I figured having my fingerprints recorded on both the iPhone and Note was all the biometric privacy I’m willing to give up. Why put my face scan and iris scan out in the cloud as well? After hearing everything Snowden claimed, color me paranoid. I do think the Note 8’s fingerprint scanner is in a very goofy location and requires awkwardly reaching around the camera while trying not to press on the camera lens to use. However, the fingerprint scanner placement and the annoying Bixby are the only cons I can really find worth complaining about with the Note 8. The speed of the Note is fantastic and I breeze through apps and tasks just as quickly and easily as I did on my iPhone, sometimes even faster. I have yet to experience any freezing or slowdown. I did deactivate the always on screen but only because I have an Android Wear companion watch, so there is no need to have an always on screen showing redundant data. As far as companion watches, I will admit that Apple does smart watches best. If that is a considerably important feature, I give the nod to Apple. My Android Wear watch isn't bad. It’s just not nearly as refined as the Apple Watch. On the flipside, Android Auto is much better than Apple Car Play in my opinion, especially the ability to use either Google Navigation or Waze in your car’s navigation screen, both of which blow the doors off Apple Maps, especially the latter. I get great battery life from my Note and easily get two days of use out of a charge, even with it paired to my vehicle and smartwatch all day. The S pen is a nice tool if you do a lot of hand note taking but I find it easier to just type. The Note charges very quickly and I can charge it late at night and still have it complete before going to bed. That prevents leaving it plugged in all night and risking overuse of the battery. Yes, all these phones have built in overcharge protection but being connected to AC power still wears down the battery over time. I’ve had this told to me multiple times by Apple Store “geniuses” as they tried to claim how all my iPhone battery issues were likely my fault due to allowing the phone to charge overnight. The excuses changed after I shared that I already knew this and therefore never charge anything overnight. The camera on the Note 8 is the best I’ve ever had on a smartphone. My wife and I always envied the photos taken by her sister with her Note 5. We would all be at the same events and taking the same photos but her photos were sharper and more vivid than our iPhone pics. That was another feature that influenced my decision to switch. Another reason was the better reliability of Google’s calendar over Apple’s iCloud calendar. I switched to Goolge on my iPhone last year after iCloud’s calendar failed to sync several very important reminders across all my devices and failed to alert me as instructed. I’d create or update important events on my iPad or Mac and ithey wouldn't sync across all my devices or to my phone. It feels a little weird as an almost exclusive Apple user to own an Android phone. I myself own two MacBooks, three iPads, an Apple TV and I owned an iPhone 7 and Apple Watch before giving both away after purchasing this Note 8. However, I have fallen in love with the performance and looks of my Note 8. It feels so new and refreshing compared to the last few iterations of the iPhone (6, 6S, 7, 8) that were essentially identical phones with very slight and almost unnoticeable differences before the release of the iPhone X. However, $1,000 is a stiff price of admission to pay to finally get the first truly uniquely different iPhone in three years. I saved nearly $500 by purchasing the Note 8 rather than the 256GB IPhone X I ever so briefly considered purchasing. With stellar performance, a sleek body, outstanding screen quality, fantastic camera and the ability to handle all my smartphone needs just as well or better than The iPhone, Samsung is giving me every reason to make this switch permanent. If not for the awkward fingerprint scanner placement and unwanted annoyances like Bixby (which can be disabled by the way), it would absolutely be a perfect 5.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "best camera and excellent build quality and performance right out ...", 
                "review_text": "Rock solid phone, best camera and excellent build quality and performance right out of the box. Battery is a weakest link in this phone - with heavy usage (emails, reading web, documents) barely lives whole day.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Unlocked Samsung Galaxy Note 8 (US Version) Not for everyone, but just right for me.", 
                "review_text": "Update: After a couple of months with the device I am more thrilled to have switched than I was before. It's not a perfect device but it definitely deserves 5 stars for the amount of functionality you get. Here are a few things I've learned over my short time with the phone: -Battery life takes some time to \"even out\". The OS \"learns\" how you use the device over time (generally a couple of weeks) and puts installed apps that you don't use to sleep until you actually need them. In the Settings menu there is a battery saver option that you can have set to off, medium, or max. Starting out with the saver set to off it says I would get 24 hours of battery life. Now, it says 34 hours with the saver off, and 122 hours at max settings. I did an extreme test where I turned every radio on the device on turn the display to max resolution and brightness and turned the audio up to about 50%, I turned the Always on Display on. Then I proceeded to play music, and long YouTube videos, do some web surfing, and played some games. The phone lasted for 17H and 25min with 7H and 27m screen on time and it still had 13% battery power left. Enough said. -The Samsung keyboard sucks,, mainly because of the predictive text and auto correction. Just use Swiftkey, which is awesome. -The Samsung email app is nice. No real complaints there. I chose it over all other email clients for now. -The security features on this device are spectacular!. Even after formatting the phone from the bootloader it would not let me set it up as a new device without my old credentials. The Iris scanner, fingerprint ID, and Face Recognition are solid and work wonderfully. Some people want to complain about the location of the fingerprint sensor but I have long fingers and I have zero problems with it. Secure Folders is a welcomed addition to the security lineup and is useful for putting certain apps or folders under lock and key. Samsung Pay is also a great feature because it doesn't rely on NFC and doesn't use your original card numbers. I always have NFC off and I'm using an Otterbox Defender case and Samsung Pay works every time. -Bluetooth is the main battery killer believe it or not. Both my Samsung Gear S3 Frontier smartwatch and the Galaxy Note 8 suffer from this problem. Having bluetooth on drains the battery quickly compared to all other features and settings minus maybe display brightness. Starting out, this will kill battery life but over a month or so it will level out depending on your usage. Most of the time with the phone connected to my watch I will get home from work with about 78-84% battery life. Starting out it was closer to 65-73%. With it off I can leave with 85-93% easy. I'm hoping they fix some of this when Samsung finally releases Android 8.0 Oreo for the device. -You get use to the single speaker. The Note 8 only has one speaker from which you can hear music or loud speaker during a phone call. It is easily muffled and admittingly not as loud as the iPhone 8 Plus speakers. I do wish there were two speakers on the Note 8 but it is plenty loud enough with the one. -Screen protectors are hard to find if you have an Otterbox Defender case. You get lift and a drop in screen sensitivity A LOT. But there are options out there that work just fine. Just be sure to absolutely CENTER the protector on the device. The first one I got left an air pocket right down the middle of the device screen that you could only see under certain lighting conditions. The second one just sucked to be honest. The screen sensitivity just dropped to almost nothing even when there was not an air pocket and the protector had full contact with the screen minus the left and right edge. The third one is a keeper, although I do notice a slight drop in screen sensitivity it works well enough to keep the phone responsive. My point is here, that the curved screen on the Note 8 does pose a problem at least for those who use a thick rugged case, but with a few hours (or days) of mind numbing searching, a little blood, and some sweat, you can find something that works. My original review is below: I shelved my iPhone 8 Plus for this and don't regret it at all. I've been using the iPhone since the iPhone 3G and have loved the finished polish of ios and Apple devices in general. Why did I get the Galaxy Note 8? Two main reasons: 1) More bang for my buck-I spent less on the Galaxy Note 8 but got so much more in the way of features and specs. Whereas the 8 Plus was lacking so many common features found in many of the top end phones today, I feel the Note 8 has gotten me back up to date with the latest tech available for smart devices. I essentially got everything the iPhone X and 8 Plus offer in one package and for less. The build quality is excellent and I'm not restricted to just Samsung products to get the most out of my device. I have this phone in a Otterbox Defender Series case and wireless charging works fine every time. Face ID, Iris Scanning, Fingerprint ID, and Pin Codes all work without a problem (at least for me). It comes with Android 7.1.1 modified by Samsung. It's fast and fluid and because it's Android, heavily modifiable (unlike Apple anything). Yes, the phone only comes with 64GB, but yes it is possible to put up to 256GB of memory in the device and be golden. If you don't want to put 256, put 128, or 64 or however much your wallet can afford, which leads me to the second point, 2) Options! So many options! I've dealt with android before so I know most of this has to do with the operating system, but there is so much you can do with this device in the way of customizing the performance,, maintaining battery life, personalizing the interface, and increasing productivity to your hearts content. Samsung has several preinstalled apps on the device that are in fact quite useful, but if you don't want them, uninstall them and that's it. No penalty, no harm, no foul. Samsung also has a Themes app that makes it easy to download both free and paid themes for the device. The complexity of the device (and of Android in general) is not for everyone. There is a lot you can tweak and alter to get all that you would want out of the device. Of course there are plenty of presets in various categories to help the casual user streamline the customization process too, so there is no need to be shy. Overall I really enjoy this smartphone and am happy to use it as my daily driver. Battery life is acceptable ( I work a 10 hour shift in the mornings and when I come home in the evenings I'm normally somewhere between 77-83 percent battery power. This is after spending the day checking emails, maybe making a call or two, and watching Youtube videos during my breaks. Also the phone is paired with a Samsung Gear S3 smart watch (also awesome, but not perfect for my tastes). I'm using this device on Straight Talk's AT&T network and I get 84-87 Mbps download speeds while in a metal hangar at work. Whenever Samsung actually releases the next version in their Galaxy series I will be looking with great intention to upgrade if possible.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "WOWZER - WHAT A PHONE.", 
                "review_text": "OMG - What a phone. The picture is fantastic. I am going from a S7 edge and this phone is great. Plus bixby saves alot of typing. Hit side button tell bixby what you want and you get it. Yes its pricey but you get on promotion a 128 card and cordless charger or 4 k camera. I paid around 800 for edge. I got mine thru ATT. It is thin and waterproof and has duel camera on back for crystal clear pictures and too many formats to mention. This is not an everyday phone for non enthusiast. But if you want all the buttons and whistles with a very clear screen - this is for you. the pen is smooth as pie and you can write quick notes on your screen And for someone like me who is tired of typing everything - works for me. Field any question my way i will do best to answer. to rate the phone on price is unfair.Plus the battery consumption is nil compared to my samsung galaxy edge 7.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I have to recharge every 24 hours whereas my Note 3 would last a good 48 hours when I first bought it The screen ...", 
                "review_text": "I just upgraded from the Note 3 and I am very underwhelmed by the Note 8. CONS My Note 8's battery doesnt last as long as my Note 3s did even after one or two years of use. I have to recharge every 24 hours whereas my Note 3 would last a good 48 hours when I first bought it The screen ratio on the Samsung 8 is terrible. This phone is taller but narrower than the Note 3 and videos do not take up the entire screen. Instead there is just wasted black space on each side. You can pinch to zoom in and take up the whole screen but then you are cutting parts out. Taking into account the black space on the ends and the narrower phone, I'm pretty sure I'm essentially watching videos on a smaller screen now. PROS The stylus is AMAZING. This is by far the biggest upgrade for me. It doesn't even seem possible how smooth it is writing on the Note 8. It seriously feels like writing on paper with a high quality ink pen. The screen is beautiful... but with a weak battery I can't keep it on the highest settings to enjoy all the clarity it brings. Photos and videos are awesome. OVERALL I had no choice but to get a new phone. My Note 3 was falling apart. I had no choice but to stick with the Note series because I use the stylus a lot at work and there just arent any other decent choice phones with a stylus. If you don't need a stylus I would recommend checking out other phones first. If you use a stylus a lot and need a new phone, I would recommend this phone on sale.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "... learned all the features yet but this is the best phone I have ever owned", 
                "review_text": "I have not learned all the features yet but this is the best phone I have ever owned. The camera is the best especially when paring with my Samsung TV's. The music side is outstanding and don't for get the Note and the pen.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Best phone I've ever owned", 
                "review_text": "Best phone I've ever owned. Got if from Amazon because Samsung didn't ship my samsung.com order on time. Pros: - Beautiful to behold - Software is smooth as butter, no lags, no stutters, no hiccups, just smooth - Software is feature packed and I'm talking useful features, not gimmicks - Nothing comes close to the S pen - Screen is beautiful in all conditions - Phone does not feel heavy at all contrary to what I heard stated by some YouTube reviewers - Speaker is adequately loud. Significantly louder than my former phone, the Note 7 (and yes I kept my Note 7) - Bixby is actually surprisingly awesome for controlling functions on the phone. It's not that great for internet related things. Good thing is you can use both Bixby and Google assistant simultaneously (Also contrary to a lot of videos I'm watched, I've not yet once accidentally pushed the Bixby button while trying to push the volume buttons) - Both front and back Cameras are great and fast. - Call quality is great Cons: - Stereo speakers would be better, I guess - Fingerprint sensor location would have been better in front, but I'm surprisingly already used to it's location and after a day I've stopped inadvertently touching the camera lens - Battery life is just okay. It will likely last all day for most people - S Note has been replaced with a much less useful Samsung Note. - Samsung keyboard is unusable. The very worst! Download SwiftKey. It's free. Update 2/6/2018: Just wanted to say after all these months I'm still very impressed with this phone. I can actually say I love it. It just works well in pretty much every way that matters and is still buttery smooth, no lag, stutter or hiccups. The battery life is great still. Samsung hit a home run with this one. Never have I ever been as impressed with a phone. I still can hardly put the phone down. If you're looking for a great phone, get this one!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Very nice phone.", 
                "review_text": "Coming from an iPhone 6+, I was looking for something new and exciting in my next phone. My two options were the Pixel 2 or the Note 8. Previously used a Note 2 so it had been some time since I last used Android. I was dreading the iOS/Android conversion process but figured whatever. After setting up my phone with the apps/music/etc, it's quite fast and very snappy. Took some time getting used to the size since it's a tad skinnier/taller than an iPhone plus model but I'm sure it' won't be an issue after a couple weeks or so. Pretty much everything on the phone is very nice from the S-Pen to the display. The display is very crisp and bright and I like the fact you can change the default resolution of it. On the highest setting, apps, web pages, text, etc, all seem to pop off the screen. Very nice and something definitely worth the switch. I always get unlocked phones so I can bypass all the bloatware garbage the carriers install on these phones. With a stock Android/Samsung setup, everything works well and is very speedy. One thing I found cumbersome/irritating were all the different options/settings on this thing. Considerably more than just about any other phone I've used. Definitely takes some time getting used to. Battery life seems good. I use my phone quite heavily throughout the day and battery life hasn't been an issue yet. The S-Pen is definitely a nifty little tool for everything from doodling or whatever. I haven't really used it much but definitely a nice accessory. So far it's been a pretty solid experience with this phone so I'm hoping the battery thing from Note 7 won't be happening with this phone.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Best Samsung Phone Ever!", 
                "review_text": "In order for me to do a complete review for this device I'd need to write a Trilogy! I will try to make this as brief as possible. First off, the display on this phone is breathtaking. Coming from a Galaxy S6 I never knew that a AMOLED display could outperform another AMOLED display. I also love that it's waterproof! I hesitated to use it in the rain since I've never had a waterproof phone before but now I don't even think about it. Next the camera was better than I imagined it would be. Zooming is incredible and I'm able to take high-speed photos without any distortion. 4K video is performs pretty much the same as my S6. It is nice that I can also plug my phone into a HDMI splitter and connect it to my TV. I haven't tried the DeX station yet but my S6 didn't support MHL so that's a nice addition. Call quality is pretty good. I love that this phone is Unlocked so it is not adhered to any one can. I have it on AT&T and believe it or not I do miss some of the functions from my S6. I would like to find out how to get their WiFi calling, Advanced Messaging, and VoLTE capability. Next, I did not think I would use the S Pen nearly as much as I do but there is so much you can do with it. Thank God I have legible handwriting or that fearure would be useless. However, my favorite thing to do is going into the PENUP app and doing some coloring. Suffice it to say the S Pen is amazing and you'll use it more than you think. Next thing that is amazing to use is the new Gear VR. It comes with a micro USB adapter so it's backwards compatible with my S6, if I really cared to use it. The last thing I'll talk about is how powerful this phone is. I thought having an Octa-Core processor and 3GB RAM in the S6 was amazing. With the Snapdragon 835 and 6GB this phone has no LAG! I'm not exaggerating either. So, if you want my opinion and you were really considering to get this phone GET IT!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=1/ref=cm_cr_othr_d_paging_btm_1?pageNumber=1", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Feels natural", 
                "review_text": "Fantastic phone. Calls are clear. The screen is super responsive and the image quality is incredible. The phone is slightly slimmer than my Droid Turbo 2 was, but taller. The camera works well in low light. I've been using this phone for 4 days and I am very pleased with the purchase. By the way, I'm using it on Verizon and it's working great. Just put my old SIM card in this new phone and followed the prompts. Also, this phone does not feel heavy to me. I have small hands, and I find that this phone feels much better than my Droid did.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Very nice phone but extra steps for upgrading firmware - If you're not a Verizon Customer.", 
                "review_text": "I'm not reviewing the phone Note 8 - there's enough of that. I'm reviewing this Unlocked version and providing some info. 1. The one I received was intended for Verizon and as such, came with all the Vz bloatware and a 'This is not a Verizon Sim card' message when I restart the phone. 2. Turn off and disable the Verizon apps and gimmick features - battery life improves. Sorry, but I'm not telling you which ones - not an expert. It was trial and error for me. 3. I used it with MVNO Ting.com with a GSM Sim - no issues there. 4. When I tried to update the firmware through the Settings menu I kept getting a error message that stated the phone could not be verified. This leads to step 5 5. The way to upgrade the firmware was to plug the USB into a PC, select Software Upgrade from the connection selections (last one at bottom). A new drive appears in Windows. Copy all the files to your PC to a new folder. Install the Samsung drivers and the Update Program. Run the Update program and wait for the download (+4GB) . Make sure you have 15 GB free on the C:\\ drive or you get a warning and have to start all over again. Then go through the menus. It will take 30 minutes.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "So far so good. Had some trouble with the shipping", 
                "review_text": "So far so good. Had some trouble with the shipping. First one did not arrive. But Amazon replaced the order. I really appreciate their quick and no nonsense response. Note, there is a 72 hour wait for missing items. Either way no real problems with the phone. 5 out of 5 star performance. The only hangup is swapping from secure and normal mode. The system have crashed three times early on and seems stable now. This may prove to be a real deal breaker if it continues. Hoping it won't because this is simply the best phone Samsung had made in my opinion. And for either secure or enterprise purposes it is exceptional and the best available. The current S-pen outshines all the previous pens. Not many new features compared to note7's pen but it feels smoother and more responsive imo. 5 stars for a 5-star product. And if you use Samsung's before, I can tell you the bloat is well worth the phone -- both because of the hardware and, better yet, the Samsung apps quality is actually good now.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Good, powerful phone with some annoying design decisions (if I wanted design over functionality, I'd buy an iPhone)", 
                "review_text": "It's a good, powerful phone with a useful stylus. Disappointments come into play with such an expensive phone though. A few of my thoughts migrating from a Note 4 (which I though was pretty fantastic). - I don't get the curved screen. Seems like a stupid gimmick to me that has little practical purpose and just makes the phone easier to break and more expensive to fix. A lot of people buying a Note are looking for the largest display they can get and still be practical to have on their person all the time. Why bend the edges of that premium display so that 5% of display real estate is now distorted? Also, how do people use these phones without a case without inadvertently activating something on the screen? Stupid. - I miss the dedicated buttons. Give me back the display real-estate used by the curved edges and then I'll give it up again to get my dedicated buttons back. I never realized how much I used the back button until I got the Note 8. Now I have to slide up the button bar (activating something I didn't want to activate about 5% of the time) and then tap the virtual back button. What a pain. And since many apps put their in-app back-button in the upper-left corner of the screen, it's even more of a pain on a large phone like the Note 8. - Battery is OK I guess. Seems to last quite a bit longer on stand-by than my Note 4 but actual use-time only seems to be a little bit better than my Note 4. That worries my a little because the Note 8's battery can't be swapped out like the Note 4. I hope it stays strong for at least a couple of years. - Bixby: I don't use it. And it's pretty annoying that Samsung saw fit to put in a dedicated button for it. At least let me program it to use as a dedicated back-button, Samsung, since you took that away. - Glass back sucks. Really. It really seems that Samsung's objective is to make the phone as fragile and hard-to-hold as possible.This is unethical. - Home screens don't rotate continuously. I suspect that this was another sacrifice of usability in order to push Bixby. Stupid. - The screen is great but I guess it should be on a $1,000 phone. - Camera seems good so far, but again, it should be.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Don't Buy If You Listen to Media via Bluetooth Car Audio", 
                "review_text": "My Samsung Galaxy Note 8 will not connect/pair with car audio as a Bluetooth media player. My car is now void of my favorite media. At least the call/hands-free audio connects via Bluetooth with no issues. My Note 3 connected/paired with my Lexus audio with no issues; the Bluetooth hands-free phone option and media worked flawlessly for years. Before purchasing my expensive Note 8 I listened to media on my Note 3 daily; now I must connect a cable to the headphone jack if I want to listen to media through the car audio! My research of the problem revealed others with the same issue; Samsung's Support resolution is \"upgrade the software/firmware in the car\"! After spending a grand on a phone, the thought of spending more money on car software/firmware updates raised my blood pressure. (It will likely not resolve the issue; it did not for others.) I'm shocked that such a basic feature does not work, especially with the flagship product of Samsung. Moreover, the feature worked with my Note 3 so I simply do not understand why Samsung somehow released a newer version of the same premium phone that is not [backwards] compatiable. I'm both frustrated and unhappy each time I drive now. I'm very tempted to return the phone but I'm hoping Samsung will release an software update that resolved the issue. If this Bluetooth media audio connection issue is not fixed in an update soon I will be even more disappointed and have to admit I made an expensive mistake by investing in this premium Samsung smartphone. I'm a big fan of Samsung phones; the Note 8 is my third Samsung Galaxy Note phone. And I have encouraged others to buy Samsung handsets. If the issue is not resolved it will likely be the last Samsung phone I purchase.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "As one would expect it to be.", 
                "review_text": "it is just the hype of a new phone, everything should be bettar than the last version. it has no real innovation, but I could say only the dark display, it is softer with the eyes, the contrast well managed. other brands have had some minor innovations that Samsung adopted in its flagship phone, like twin cameras. Everything else is as one would expect: better screen, better perfomance, better speed, better pics, some minor upgrade in software functions that beautify the user experience. The Bixby thing is just so useful!!!!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Save Money, Go Prepaid with this Phone!", 
                "review_text": "Great Blak Friday Deal for $799. Easily activated on Verizon prepaid by myself in 2 minutes. Plus with the payment plan through Amazon, I pay$160 a month, which made it a no brainer. So now I have a high end phone and unlimited data plan through Verizon Prepaid for nearly half of what It would cost for a contract option. The phone is fantastic", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "My last phone was an S7 Edge and while it was a good phone, it left a lot to be desired", 
                "review_text": "I've had several Samsung Galaxy phones over the years including the Note and Note 3. My last phone was an S7 Edge and while it was a good phone, it left a lot to be desired. Most of my friends have IPhones and I do have an IPad Pro first generation. I was strongly considering the IPhone X until I just happen to see the Samsung Unpacked event on YouTube. Honestly, I have not been this impressed with a phone in years! I was sold when they did the demonstration for Bixby. I've only had it a few days but I am very satisfied so far. I like the security features, the build and quality of the phone, and its versatility. That is one of the things that sets Samsung and Android apart from Apple...You have more freedom to customize your phone to the way you need it to be. Excellent job Samsung!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Major Problems with Unlocked Phone", 
                "review_text": "I received the Note 8 on 11/24/2017 and activated it on the Verizon network on 11/27/2017. It is a great phone except that I discovered that important features are blocked by Verizon including visual voicemail and HD Voice. Nowhere on Amazon's webpage or Samsung's webpage or Verizon's webpage do they warn you that critical features will be blocked by Verizon or other wireless carriers. Visual voicemail is a critical feature, it allows you to see a list of your voicemail and play them at your convenience, no need to dial into Verizon basic voicemail and listen to the massively annoying and slow process of hearing your voicemail read back by a robot. Verizon prevents you from installing their visual voicemail app (the free and the paid versions) on any unlocked phone. HD Voice is also disabled and there may be other features disabled that I have not discovered yet. HD Voice allows voice calls over the 4G network for clear audio and it allows you to surf the internet while on a voice call. I have spent 3 full days researching this issue and there appears to be no solution. We simply cannot get visual voicemail or HDVoice in these unlocked phones. These are free services included in your monthly bill that we cannot use, yet we must pay the bill in full. The only recourse appears to be to return the phone to Amazon or Samsung for a full refund and buy a locked version from Verizon or another carrier. Our only hope is that many customers will demand refunds and complain to Verizon and any other carrier that blocks features. I do not know of any carrier that allows visual voice mail or 3rd party apps such as Google Voice to work with these unlocked phones. So if you want convenient visual voicemail and features such as HDVoice, it is a mistake to buy an unlocked phone at this time. The more complaints Amazon, Samsung and Verizon hear about this problem, the faster it will be resolved.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "FEATURES GALORE !", 
                "review_text": "Great phone! It has so many features and you can customize so many things! It will take me some time to find all the things it can do! Only thing is the weight...having small hands, it gets heavy after awhile. Exactly as advertised, fast shipping so all in all I am very pleased.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=2/ref=cm_cr_othr_d_paging_btm_2?pageNumber=2", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Love this phone.", 
                "review_text": "Was an avid iPhone user for a while (they have better accessibility that I'm a -huge- fan of), but decided to switch back to Android after seeing the new Note8 commercials. As an artist, I love the S Pen and all of the art apps that you just can't find for iOS devices. I was originally wary of the size (I usually prefer smaller phones), but the one hand mode makes using this phone a breeze. Bixby (Samsung's assistant) comes with an xp system and leaderboard that makes me actually want to utilize this feature (something I didn't do much with Siri). I also love that getting this phone through Amazon was cheaper than going through my mobile carrier or from Samsung directly. All in all, great buy!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Just possibly the finest smart phone ever made!", 
                "review_text": "This phone is F A S T. Zoom. I know, iPhoners cover their ears and sing na na na nah. My son is one who prefers IPhones and we compared the two new phones based on independent reviews and comparative photos. Even he agreed. The Samsung Note 8 just takes better photos. But as school he's cool with an iPhone. On the dark side Samsung's lack of thorough instructions left me scratching my head. So I headed down to T Mobile and some young woman installed the simm card and SD card so fast I don't know how she did it. So I think Samsung should spend some time providing more instructions. They just don't. I'm graduating from a Note 4 and expect better photos than the 4 and a faster operating system. It is easy to use and programs easily as well. It has more RAM so it won't log jam easily. Considering the price tab I opted for a Otter glass shield and a slick carry case to protect it when it slips and falls.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I didnt feel like switching out of the hold Apple had over me", 
                "review_text": "I worked for Apple as a Genius. I have had every model Iphone since the launch in 2007. When Apple had the Iphone 5 I look at the Galaxy phones by Samsung and was pissed that they had features that Apple didnt equip on their phones. I didnt feel like switching out of the hold Apple had over me. You know all the crap I had in their ecosystem. Now that Apple launched the Iphone X and wanted 1,000 for a phone which now they are going to finally add features that Samsung had for years I said nope I'm out. I ripped the DRM off of my content and moved my data for the switch. Once I got my Note * I wanted to kick myself for not switching earlier like I intended to do. Yeah yeah Apple makes a good product too, but I'm tired of their BS. Being an insider they play games that consumers dont even realize. The I in the Apple products is for Individuality. Apple has lost that.Im sure fanboys are cursing me who cares, keep biting. Apple lost their creativity in the pursuit of the almighty dollar. Launching models lacking features, taking away features telling people you don't need them, then adding features other brands already have and acting like they were the first to the party. All I know is for me I'm happy with my Note *. Will I buy another Iphone maybe maybe not. Right now Im happy with the Note 8 adn its performance and its features. Do whats good for you.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Still discovering the tons of features on this beautiful phone. Still amazed with the battery life of ...", 
                "review_text": "Still discovering the tons of features on this beautiful phone. Still amazed with the battery life of this phone (upgraded from the Note 4-poor battery life).", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Nice upgrade from S8+ Runs oreo Great.", 
                "review_text": "Great phone. Was going to hold off until the Note 9. But my S8+ stopped fast charging. Figured not a big enough upgrade from 8+ to Note 8. Boy was I wrong. The Note 8 is much faster and more fluid. Looks much nicer and the design pops. The extra 1gb of ram does the trick. Oreo on the note is better and seems nicer than on the S8+. Camera is more responsive and the added extra lens makes a nice difference. If you were on the fence, just get it. Happy to find a nice seller at a great price. Eggplant Pete shipped fast and safe. Even added a extra wireless charger. His description was right on and the photos were helpful in my buying from Eggplant Pete.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Best Note Yet, Greatest Phone Ever...", 
                "review_text": "What more could you ask for in a phone? Super powerful and fast, Amazing screen and coolest features. Connects to my to my whole life effortlessly and best of all...the battery lasts forever! literally all-day of non stop use or a day and a half of normal use. Also have the DeX dock that makes the thing into a mobile desktop computer. This phone and the other Samsung devices I own make me feel like I live in the future.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Love Samsung note but beware of factory unlocked if tech challenged", 
                "review_text": "I love the stylus on the Samsung note phones. Upgraded from the 5 to the 8. I like the factory unlocked version, but you have to know what you're doing to ensure you get all data from old phone to new. I had to switch the sim card between phones about 6 times to get everything moved over. Recommend backing up your old phone prior to switching and attaching your apps to fb or google account. That way all you have to do is log into fb or google and your apps will auto update on the new phone. If you are tech challenged the factory unlocked phone may not be for u.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "OMG That camera!", 
                "review_text": "This was a gift for my 15 year old daughter. She wanted an upgrade from her J3. Now look, I totally get scoffing at the price of this thing but hear me out: This takes the place of your tablet, phone, and camera....and when I tell you the camera on this thing is AMAZING I am not kidding, a picture so clear you can zoom in and count the fibers in someone's shirt! The phone is absolutely amazing and she is happier than words can say and I have no regrets. If you are considering getting the Note 8 my advice is do it.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Everything I wanted", 
                "review_text": "I've owned this phone for a month so far and it's everything I could have wanted from a smartphone. I spend a lot of time outdoors for work in all conditions and I needed a powerful waterproof phone, and the note 8 delivers. Pros: Stylus Fast and responsive Screen Waterproof Cons: Speaker Battery life I'll update if any problems arise but I'm glad I bought it as of now.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Truly Exeptionally Beautiful Phone", 
                "review_text": "Perfect latest smart phone. All Glass interior is really breathtaking; don't think any of the pictures really does it justice. The picture clarity is incredible, whether watching a video or simply browsing the net, it is a smooth clear, bright masterpiece. A pleasure to have, use and very versatile.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=3/ref=cm_cr_othr_d_paging_btm_3?pageNumber=3", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Great Phone On Sale", 
                "review_text": "The. Note8 is an excellent phone. I purchased it after my HTC 10 got a crack on its screen. I find myself using the Note8 a lot more than my HTC 10. I only wish it had better sound. That is the only factor where the HTC 10 is superior. I got the phone for $800.00 on black Friday (unlocked of course)", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "loved this phone but it didn't work with my ATT ...", 
                "review_text": "loved this phone but it didn't work with my ATT plan for some reason so I had to sadly return it but it is still awesome and I miss it a lot.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Love it!", 
                "review_text": "Amazing phone! I purchased from Warehouse Deals Inc. used and it has been a great buy! The device came opened but in perfect condition. Love it!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "Plug in port is loose.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Phone by it self is excellent. Everything is very fast and doesn't get slower ...", 
                "review_text": "Phone by it self is excellent. Everything is very fast and doesn't get slower at all. The only reason that I didn't give 5 star is because there exist a possibility that you might not have a mobile network service through verizon with this phone. Even verizon guys couldn't help me figuring out what was wrong. If that occurs to your note8, change sim card; verizon has two different types of sim card and one doesn't work with the newer phones LOL", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Simply perfect...", 
                "review_text": "This phone is just great, the 6gb of RAM makes it incredibly fast, the reason for the 4 stars is the uncertainty of not knowing if I'm affected by the battery bug. But battery life even at full performance mode is awesome", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "It has performed better than expected and I definitely get a lot of ...", 
                "review_text": "I purchased this phone a few months ago. It has performed better than expected and I definitely get a lot of use out of the S-Pen. Also, the blurred background effect is a must now for me. I use it (the camera effect) on a regular basis.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Omg Stacy \"what is it becky\"", 
                "review_text": "Wife absolutely loves her new phone. Upgraded from a note 3 (definitely needed an upgrade lol) we were both unsure about the curved screen but it is actually looks and feels very nice", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "This is the best phone I have ever owned", 
                "review_text": "This is the best phone I have ever owned. I wish the fingerprint reader was in a better location, however when I am still able to use it without any major issues.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "This phone is outstanding android has done a really good job providing software for example the flashlight has a ...", 
                "review_text": "This phone is outstanding android has done a really good job providing software for example the flashlight has a bunch of different brightness settings and it's Built-in to android You don't have to download an app. However there are a million apps to download if you choose to. The battery lasts the entire day and I use it to play music for a 8-10 hour shift.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=4/ref=cm_cr_othr_d_paging_btm_4?pageNumber=4", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Stopped working", 
                "review_text": "Worked for 1 week, then I couldn't turn it on. Just returned.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "It's a speedy phone, with many useful features.", 
                "review_text": "First off, the Note 8 is amazing. The screen is large, yet the phone frame isn't that big. Although, it would take some time getting use to if you previously have a small phone. You will get use to the fingerprint sensor location as you use it more often even though it is placed in an awkward location. The fingerprint sensor is fast, but it isn't the fastest I've seen. The software however, is one of the fastest Android I've used. Some people likes the clean Android version by Google; but for me, I love the way Samsung tweaked the Android OS and added many customization to enhance the user experience. The camera is super clear and can be quickly launched by double tapping the power button so that you won't miss capturing those special moments. The S-pen is super accurate, and it actually feels like I am writing on a piece of paper. The battery life is fairly decent as I can get about 4 hrs of screen on time. Overall, if you want a speedy, large screen, good camera, S-pen stylus, and a premium looking design, I would recommend this phone if price isn't an issue.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Spen extremely useful. I adore the speech to text feature in WhatsApp and other apps.", 
                "review_text": "I am new to the Note Family, and the Spen takes a bit of time to get used to. Having said that, the Spen is an extremely useful tool. The Voice-to-Text or voice input feature saves a decent amount of time; who wants to type anyway! Samsung has done it again!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Fantastic all around phone", 
                "review_text": "Fantastic all around phone! I was coming from S8+ so this was a minor upgrade but still love the bigger more flat screen and Samsung software has gotten much better compared to previous generations.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "You get exactly what you pay for.", 
                "review_text": "I ordered this thinking it was going to be a new factory unlocked phone from Samsung. I color on my oder was orchard Grey. When the phone arrived it was the midnight black edition and I could tell that it was not a new phone. The box was all beat up and there were things missing from inside the box that would normally come with a new phone. Also it looked like the head phones had been used and then repackaged. To confirm what I was thinking I went ahead and ordered a factory unlocked phone from Samsung and sold the one I had just received to another vendor. Turns out the phone was an AT&T phone and not an unlocked phone from the factory as stated in the product description. While I did not have any trouble with the actual phone I will think long and hard before I buy another device from a company that is not the manufacture.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "I like all new future on 8 it's work great", 
                "review_text": "I am o phone lover due I phokne x lock on other carrier I switch to Samsung note 8, I like all new future on 8 it's work great. It will take me time to understand all future due I never use Samsung before, so far easy to me. I will suggest by note 8 you will enjoy all future what not in I phone. Thumbs up with 5 star.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Great Phone.", 
                "review_text": "Really good product. Bought this for my wife and now I'm thinking of getting one for myself.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Kept the Note 4", 
                "review_text": "Amazing phone, but I didn't notice any improvement worth the money over my current note 4. In fact, I already learned this lesson when I upgraded from the note 2 to the 4...I already had mobile pay and most other features on the 2. While it does seem there are some improvements in the camera photo quality and performance with each upgrade (which is a big deal to me!!), Im already so happy with my note 4 that I'm not ready to spend a grand on a new version which is pretty much the same phone. I did not like the taller screen, it reformats youtube videos to a smaller size and leaves an inch of nonused screen on each side (something I feared since the shape changed to so longer). My note 4 is a perfectly filled screen for internet, youtube and my own camera videos. Even with amaxons amazing black friday discount, i decided to return it. I can buy replacement batteries for this old phone from walmartt for less than twenty bucks. I'm good with the note 4 for now, thanks though samsung. :)", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Yaasss!", 
                "review_text": "I bought this for my bf so Gus birthday, he absolutely loves it. Fast shipping and great condition. Awesome phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Amazing!", 
                "review_text": "This phone is just amazing! Comes quickly and definitely is the best Samsung smartphone!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=5/ref=cm_cr_othr_d_paging_btm_5?pageNumber=5", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "what a smartphone should be", 
                "review_text": "other than the samsung crapware that you cant completely turn off and this dumb bixby they got it right. its fast and i have no real complaints", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Awesome phone. Stylishly powerful yet easy to use. The best Android experience I've ever had.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Very fast and elegant phone even though it's used looks brand new.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "then this phone is great for drawing on the go or in your bed", 
                "review_text": "It's the only phone with a pressure-sensitive stylus so really your only cheaper options are older Notes, which don't have security updates. If you're an artist, then this phone is great for drawing on the go or in your bed.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Samsung Galaxy Note8", 
                "review_text": "Awesome phone with a lot of creative features. It's easy to use, sounds great and takes amazing photos. You can also write texts, crop and animated photos with the stylus.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "was bought as a gift for granddaughter in college. She loves it!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Works with Verizon", 
                "review_text": "High quality phone, will give them the benefit of the doubt when it comes to wifi calling out of the country but it works well so far within US. If it does not work there are several articles on XDA describing how to jump start these and other background VoLTE services. Voice quality can be questionable, not a reflection on the distributor but the antenna on the phone is sometimes spotty (I don't have reception where I previously did on S6 edge+). Other then that the phones processor is a golden Q35, no complaints.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Another great product from Samsung...Awesome phone", 
                "review_text": "Phone is fast and very responsive thanks to an awesome processor. Reception is great and you know all the features if you are looking at buying one...HIGHLY recommend this phone.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "This phone is awesome but I ran into an issue", 
                "review_text": "Everything about this phone is badass, from the display to the speed of function to the camera. The issue I've run into is with voicemail. There's already a password set up on the phone for accessing voicemail and I have no way of figuring it out. Edit: I was able to reset my password through my carrier and all is well.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "If you can afford it. Who not. It takes time to get used to it.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=6/ref=cm_cr_othr_d_paging_btm_6?pageNumber=6", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "The phone is Great. I had sprint but sprint refused to connect ...", 
                "review_text": "The phone is Great. I had sprint but sprint refused to connect to this phone so I just switched to t-mobile.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "VERY GOOD QUALITY. BETTER THAN IPHONE", 
                "review_text": "FAST. VERY GOOD QUALITY. BETTER THAN IPHONE.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Wrong color but PERFECT phone!", 
                "review_text": "Ordered orchard grey but got midnight black instead. I'm not going to bother in returning it because I'm so loving the phone. Still paying with all its features, but so far, I luv this thing!", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Impressed so far", 
                "review_text": "Sweet new phone. I had a note 5, my main problem with it was terrible battery life, after only a few months would barely hold a charge for half a day. I was leaving it plugged up over night, which may have been part of the problem, especially with batteries that fast charge. Was hesitant to get the Note 8, but really couldn't find a better alternative. So far, I have been impressed. I have plenty of charge to get through the day, sometimes charge a little before bed, but not overnight, then charge up quickly before work in am. Screen is awesome, form factor better than note 5, fits in hand better. Face recognition works great - sometimes too well - but is dependent on lighting conditions. Fingerprint sensor is in an awkward spot, but with face recognition, i don't have to use it much. If battery life continues to hold up, would give 5 stars.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Love it. Now all i need to do is not to lose it.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "great product", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I love love love my Samsung Galaxy Note 8", 
                "review_text": "I love love love my Samsung Galaxy Note 8. It is all the phone I would ever want or need for many years. It does everything!!! I multi-task, and do several important things on my phone. Its AMAZING!!!!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Love this phone. Truly a top-of-the-line device", 
                "review_text": "I've owned the Note 8 for about 3 weeks now, and other than the initial price of the phone, I have zero complaints. This phone has everything you could want and/or need from a smartphone, and then some. Beautiful screen and overall design, a stellar camera, great speed and performance/hardware, expandable memory, waterproof, the S-pen, and on and on it goes. There's a great number of features that I don't even use, but I'm sure are great. Some reviewers on here complain about the battery not lasting a week on one charge. I don't really understand this sentiment. I not only haven't had an issue with the battery draining quickly, but even if this is an issue for some users, I have to assume they're using battery intensive features a great deal. Also, I personally don't find that charging my phone is an inconvenience, especially with how fast it charges, and considering Samsung's massive debacle with the Note 7's battery, you can understand why they wouldn't gamble on creating a super-battery. Anyway, this is a really great phone. The negative reviews are nonsense. And like I said, the only downside (for me) was the price tag. I've included a few unedited photos that I've taken with the phone since getting it to highlight the incredible image quality.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Perfect in and out.", 
                "review_text": "Just upgraded my phone from the 8S plus. The camera is a big step forward and my apps seem to open faster probably because of the extra Ram. I've been an iPhone user since the first one came up and the note 8 is the phone I was waiting for to switch to Android.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Best smartphone I've owned hands down", 
                "review_text": "Best smartphone I've owned hands down. Great battery life. great screen. You can tweak the crap out of this phone.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=7/ref=cm_cr_othr_d_paging_btm_7?pageNumber=7", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Four Stars", 
                "review_text": "A good up to day phone for note taking on the go with the onenote app.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great phone. Beautiful screen and camera is absolutely perfect.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great company, excellent phone and overall was a great purchase.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The price was the most important thing.", 
                "review_text": "Everything is good but except for the finger print reader. Otherwise no complaints. Got the phone with black Friday sale plus had a gift card. Couldn't pass it up.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Excellent Phone", 
                "review_text": "Excellent Android. Just as I expected.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "i received the phone on fri apr 27. i ...", 
                "review_text": "i received the phone on fri apr 27. i worked all day Saturday with Samsung and Verizon we could not get the phone to work properly. i send it back apr 30. i wanted to let you know i do not think this phone was new or unlocked. the phone did Not have any protective covering on it when i removed it from the box.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Great phone for a great price", 
                "review_text": "Works as expected. Great phone for a great price.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Arrived just fine! My wife and I love the phone!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The best phone I've ever had", 
                "review_text": "Love this phone, after the pain in the neck that was actually getting a real phone which Amazon was immensely helpful with I gotta say it's the best phone I've ever had.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=8/ref=cm_cr_othr_d_paging_btm_8?pageNumber=8", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Love", 
                "review_text": "Love love smooth sleek fast", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "What can I say, it's everything you want and then some.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "I am in LOVE with this phone!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great phone. I made a good decision", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Amazing", 
                "review_text": "Wonderful product. You can't go wrong with that. If you're wondering if this item will work in Europe, yes it will !", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "perfect, love it .", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "love it", 
                "review_text": "A+++ product. love it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Excellent", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Samsung Galaxy Note 8 Unlocked", 
                "review_text": "I bought this because it was unlocked and a good price. Had no trouble activating it on my Verizon account", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Exceeded my expectations!", 
                "review_text": "I couldn't be happier with my purchase. It was hard for me to choose between the Galaxy S8+ and Note8. I didn't see much difference in specs to warrant the difference in price. I decided to give the Note8 a try, and I'm really glad I did. The Note8 is marginally bigger, has dual cameras, slightly weaker battery, 50% more RAM, and the S Pen (which is far more useful than I had imagined). I've had so much fun changing the way that I take down notes on my phone and editing things. I'm still learning new features with it. You'd have to try it to really see what I mean. Trust me, though; it's worth it. I'm not really an artsy or techy type person, and I still find it really useful. In the hands of someone creative, the Note 8 would be even better!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=9/ref=cm_cr_othr_d_paging_btm_9?pageNumber=9", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "Awesome phone unlocked and ready to use also on prime so got it in 2 days ;)", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "LOVE. LOVE. LOVE THIS PHONE!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Fast Shipping and Great Device!", 
                "review_text": "I love how this item came faster than the expected date! Also packaging was excellent! Phone packaging was presentable on the outside as well on the inside. Everything expected was included as well. Extremely satisfied with my new phone!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "it's nice. got a great deal $799 thanks to amazon. nov 2018", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "rich features", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Absolutely love my phone!!!!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Best phone I've ever owned. EVER", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Worth the cash..", 
                "review_text": "Went from A note 4 to a 8 major innovation only thing I didnt like was no Ir beam for my TV remote..", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "absolutly love my S8 Note", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The Samsung Galaxy Note 8 WILL...Blow...Your...Mind!", 
                "review_text": "I've had a lot of phones over the years -- currently have about 5 or more smart phones (Note 4, Motorola X Pure/Style XT1575, Axon 7, Zmax Pro, LG7, and a few others) -- and this phone blows away everything else I've ever had, owned, or seen -- including the iPhone 6, 7, X, and the Pixel and Pixel 2 XL! I've still got tons to learn about all the new features, and although I clearly did not NEED a phone at all, this phone did give me the one thing I have been missing since my first smartphone in 2012 -- the sheer joy and exhilaration I get from having and using this phone! It's an experience I've never had with another phone (the Note 4 came very close, but I had to cease using it, since it was carrier locked to Sprint, the most overpriced carrier and worst customer service in the world, even to long time customers since 1997 [to December 2015]). Die Sprint (for the God-awful price plans, customer service, and the zero love and respect to your most loyal customers)! So I treated myself to a ~$1,000 phone I did NOT need, and it has felt like the best ~$1,000 I've ever spent! I highly recommend it to anyone and everyone who wants an out-of-this-world phone that feels like advanced alien technology! So if you have an extra $950+ bucks to blow, and/or have a phone you don't like or enjoy, and want a phone that will blow your mind, that you will enjoy no end, then do yourself a favor and get the Samsung Galaxy Note 8! I can't imagine anything changing this experience, barring them blowing up like the Note 7 fiasco. To date, this is hands down the best, most amazing phone on the planet. Don't believe me, go check MKBHD's videos, and the rest of the gurus online. :) - One happy af customer!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=10/ref=cm_cr_othr_d_paging_btm_10?pageNumber=10", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "Love phone don't like how slippery it is...", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Amazing", 
                "review_text": "Really delivers on what is promised. Worth every single penny.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Greatest Phone Ever. Amazing features . Thank you.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Best phone out right now", 
                "review_text": "Beautiful screen,impressive camera, just an overall amazing phone, best $880 I've ever spent", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great job Samsung. Build quality is excellent, phone is blazing fast. I just love it !!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Updated review, new phone works on Verizon", 
                "review_text": "Update 12/8/2017: The phone was defective. After going back and forth with Verizon and Amazon, Amazon sent me a replacement and the new phone works perfectly on Verizon. Original review: This phone DOES NOT WORK on VERIZON. Do not buy if you are going to use on Verizon! Misleading description. Pretty unhappy about the hassle this has caused me.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Finger scanner broke - 7 months. Waiting for something else to break.", 
                "review_text": "Had the phone about 7 months and the finger print sensor stopped working. How nice. I use LastPass to log into just about everything and now I can't log into anything except taking the time to type everything out which takes forever. Not good. I bought this phone unlocked on Amazon through Amazon and paid a premium price for it, I should get premium service along with that. At least send me a new phone and when I get that one all squared away I'll send the broken one back. I spend thousands of dollars on Amazon, least they could do to provide service. Oh well, just another electronic device that doesn't live up to it's name, or anything else. :)", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Good phone, amazing customer care on the sellers behalf", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Probably the best phone that I have ever own. Just the finger print sensor is difficult to find.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "I so glad I spent the money. I am so happy with my new phone!!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=11/ref=cm_cr_othr_d_paging_btm_11?pageNumber=11", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "Best phone I have ever had, so responsive, takes excellent pictures and super resilient(dropped from 10 ft no damage)", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I truly love y phone it was in great condition and very ...", 
                "review_text": "I truly love y phone it was in great condition and very sleek and nice for a price that’s in my range. Also it was sent before the delivery date😍.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Very annoying.", 
                "review_text": "Only issue i have is that since i've updated my phone the pictures are not saving properly or sometimes does not even store the pictures. Very annoying.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great Phone for its price..along with its great features. Thanks Amazon.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "In love with my new phone", 
                "review_text": "In love with my new phone! I had the Note 3 since it first came out. I recently upgraded to the Note 8 and is amazing.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Best phone I've ever owned. Excellent picture quality, and haven't run across any bugs.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Great", 
                "review_text": "Smooth and lag free. The battery lasts more than a day and charges in one and a half hours.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "I love this phone. It does everything I want it to do and then some.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Too big but work fast.", 
                "review_text": "It is too big and will make your hand is tired when use it about 15 minutes. If you have a big hand, it is OK but I don't suggest it for people have small hand like me. It is fast and beautiful but if you put it on the protection case, it become ugly and very big size. But if you don't buy the protection case, the phone will be broken if it drop on the floor (some people review their Samsung was broken the screen and the manufacture don't want to replace the new one to them so I put it on a protection case to protect the phone is broken when it is drop. Next time, if I bought a phone, I will buy small size not big size like that because I can not put it on my purse like iphone, and because it is big so my hand is so tired when use it. I hope in the future Samsung manufacture make the phone smaller and use the Corning Glass V for screen to avoid the phone broken easily.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "I had a 12mp camera and the quality was good, then I got a Samsung S4 ZOom with ...", 
                "review_text": "Well samsung, I must say thank you. My Note 8 is definitely the replacement I needed. The first thing that caught my attention was the dual cameras (12mpx2).. I had a 12mp camera and the quality was good, then I got a Samsung S4 ZOom with 16 mp and 10 x zoom. i was afraid there won't be a cam phone to replace my s4 zoom, now that I have had my s4 zoom for about 5 years. I waited for Black friday, but on Thanksgiving day I could not wait any longer I bought it in a Heartbeat. I am so in love with my phone. It is so sleek and fragile, but i do my best to protect it. the dual cameras almost are like my 16mp phone, only better. speed of the photos are just amazing. i love the s pen feature, i can colour and take notes, etc. This is just the best phone ever made so far by any phone manufacturer. its fast and bright . I use the zizo case, but it feels like a big weight hugging my neck, so i clip it to my pocket and you can turn it inside or you can expose the screen, I have a skinomi screen protector on it and it protects very well.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=12/ref=cm_cr_othr_d_paging_btm_12?pageNumber=12", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Coming for a Note 4 this phone is like night and day", 
                "review_text": "Upgraded from a Note 4 to this as Note 7 was kinda....you know.... Note 8 is a solid phone, tons of features, improved S-pen (again coming from the Note 4) and the best part no garbage bottle-ware from carriers on the unlock. I connected my S3 watch to this and battery draining was not an issue with light-moderate use of watch with phone. Almond infinite screen. And a free gift with purchase through Samsung Shop app. Only thing I am picky on is the location of the finger print scanner and camera on the back side of the phone.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Galaxy Note 8 (Factory Unlocked)-->Worth the Money", 
                "review_text": "I bought this phone on Thanksgiving from Amazon on sale for $170 off MSRP. I was on the fence about spending so much money for a phone, but I am glad I made the leap after 5 days of use so far. I am using this phone on Cricket Wireless (AT&T). My previous phone was a Motorola Z Play GSM edition. I loved that phone's battery life, the JBL speaker mod, and the Hasselblad Camera Mod. it truly is the best mid-range phone on the market today (better than Z2 Play)... with one downfall... The camera on the Z Play was mediocre at best. With a 15 month old baby at home to take pics of for family... Forget getting quick, clear snaps. The camera lacked quick focus or quick picture taking and also didnt have OIS or EIS. In other words, the camera is very very disappointing... for anyone considering buying that phone. I wanted to upgrade, so I researched mid range phones like the Z2 Play, the OnePlus 5T, Huawei Mate 9 and other phones for replacing my Z Play. For $5-600.00, I could buy an S8 unlocked that is waterproof and has a better camera than most of the midrange phones on the market. Previously, I owned the Note 2 and Note 4 (Sprint), so I decided to go all in and buy the new Note 8... But this time, factory unlocked so I can use any carrier in the US. Here is my experience with the phone so far: Pros: • Blazing fast Snapdragon 835 (6GB of Ram is perfect with this processor) • Touchwiz has no lag... Unlike the other Notes I've owned • The camera and camera features on this phone are great. Camera is laser fast with taking clear photos/videos, which was what I needed with a toddler running around the house • Display is brilliant and has a Blue Filter to reduce glare and eyestrain • Flashlight brightness can be adjusted • Micro SD card slot is always a plus • Great signal strength, even with Military Grade Samsung Kickstand Case installed. • Waterproof down to 5 ft for up to 30 minutes. Cons: •Battery life is subpar compared to Moto Z Play, even with the Note 8's \"Mid\" Battery Saver option enabled. I'll have to further \"de-bloat\" this phone. •Downfiring speaker at bottom of this phone is terrible when compared to Moto Z Play with JBL Speakermod • Finger Print Sensor is in a bad location • Non-Removable Battery (always a minus, but all phones have non-removable batteries now) • If you have small hands or have pants with small pockets, get a regular Galaxy S8 instead. This phone is massive in size. • It's pricey... But if you own a business or have kids, its worth the extra money to have the best features. Overall, I can deal with the battery life issue and a bad sounding speaker in order to have a flagship phone that can take good Pictures/Videos. I am happy with my purchase and hope to see more of whats changed since I had my Note 4.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Good mobile", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Fantastic phone. Only reason I'm giving it 4 stars ...", 
                "review_text": "Fantastic phone. Only reason I'm giving it 4 stars is because unlocked version does not support wifi calling on at&t", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "It's an awesome phone and the camera / quality is out of this world.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Perfect !!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Mind blowing Smartphone", 
                "review_text": "Absolutely amazing Smartphone with many many amazing Features. Just love it. Thank you Samsung..", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "Great phone. Nice aesthetic.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "This phone is awesome, glad we bought it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "It's work excellent so far,plan an buy another soon! !", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=13/ref=cm_cr_othr_d_paging_btm_13?pageNumber=13", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Four Stars", 
                "review_text": "This is a great phone, but as a former Note2 owner I feel it's grown a bit too long.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "II can't imagine a better phone", 
                "review_text": "I got this on sale to replace my long in the tooth note 3. I haven't figured out all the tricks yet, but phone is fast and smooth as silk. Great call quality, does everything I want it for. Even the speakers sound good, and yes, I know other phones can get louder, but I usually use a blue tooth speaker if I want to play music loud. I love that it's unlocked, I don't have to look a folder full of carrier bloatware. I know the carriers are discounting this phone big time, for the holidays. If you want a phone without the duplicate uninstallable apps, carrier logos, and the ability to get upgrades when the manufacturer puts them out, and unlocked phone is the only way to go.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Amazing phone and graet features.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Best cell phone 👌👌👌👌🤘", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The phone I received is in nearly perfect condition and as many reviews online agree", 
                "review_text": "This review is specifically for the company Walker and Walker. The phone I received is in nearly perfect condition and as many reviews online agree, it is very well made. However, W&W did not send me a \"Factory Unlocked\" model as described. Instead it is locked to Xfinity Mobile and as such cannot be used on my network. According to Xfinity there is no way for me to be able to unlock it given the situation though all I need is a Network Unlock Code. The service representatives of W&W have been quite helpful thankfully though I am disappointed that this has happened.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Haven't had any issue(s) so far! :)", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Great phone! Though it is a bit pricey", 
                "review_text": "Great phone! Though it is a bit pricey, it is just smacks of quality. I believe I'll use this phone for several years to come, unless Samsung manages to make a foldable phone as well as the Note8. As an aside, Bixby hasn't been developed to the point of being reliable, but I'm sure Samsung will improve on it quickly. Don't expect to be all about Bixby, at least not immediately.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "I love it just like I knew I would", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "The best Samsung smartphone I have ever used", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "I like the features", 
                "review_rating": "4.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=14/ref=cm_cr_othr_d_paging_btm_14?pageNumber=14", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Love the phone love the color", 
                "review_text": "Love it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "So for is good.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Nice phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Disappointing Camera", 
                "review_text": "The screen size and S pen is a huge plus. The Note8 camera was a huge disappointment compared to the Google Pixel XL. Note8 camera is sluggish and is unable to take crisp shots in restaurant style lighting. I was consistently getting motion blur in Auto mode; extremely frustrating to say the least. The Pixel XL gave spectacular crisp well exposed photos in same lighting with absolutely no motion blur. Lastly the Note8 pictures in the low light seem slightly color desaturated compared to the Pixel XL.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Not Really Compatible", 
                "review_text": "I bought two of these because a member of my family needs a stylus and overall reviews. Received them three days ago. Now we are looking for aomething else. If we find something else that will work back they go. First although Samsung claims they are compatible with carriers I found they have a couple incompatibilities. May find more as I experiment over the next few days. First, the Always Forward Calls function does not work. I spent time with ATT to be sure it was the phones and not ATT. They proved it was the phone. She said that is common with Samsung Unlocked phones. I contacted Samsung. First Rep told me their internal resources showed this was a known problem. But, there would be an update to fix that. The second Rep said the problem with Call Forwarding had never been reported. I was the first. But, probably this was just the phone. Two Reps, Two different stories. In any event the function doesn't work. What else I'll find as I learn more about the device who knows? The Fingerprint Reader only Unlocks the phone. It will not lock it. The Fingerprint Reader on my other phones both lock and unlock. Alerts and Notifications are different than my previous Samsung phones. Looked for a concise explanation. No joy. Customer Service could not point me to anything than their online tutor that they said required me and the Rep to be online together. Over time I'm sure I'd get up the learning curve. Frankly, they have lost my trust. Private Specifications that affect device performance and usefulness not disclosed to the customer is bad ju-ju. On sthe good side: the phone shape is really good. Making the rectangle longer on one dimensiion makes it very usagle with one hand. The person who wanted the stylus so far is fully satisfied. The display is very good. Too soon for battery life evaluation. But, on first two charges we got over 14hours with mixed, but mostly internet use. Not great, but acceptable. Voice quality in phone calls(yes we still talk on the device) is very good. Haven't gotten to the other critical functions yet. So, attitude may go up or down.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Perfect.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Good", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "CAUTION: No Wi-Fi Calling on Verizon. Pretty Nice Phone Otherwise", 
                "review_text": "This factory unlocked Note 8 will not allow you to enable the entire \"Advanced Calling' subset of functions if you are a Verizon user. This means no Wifi calling, a complete deal-breaker for me. Hours wasted with Samsung Tech Support *who ultimately hung up on me during a 'transfer'* and multiple Verizon CSRs, got bounced from one to the other saying, \"Not us, you've got to go through them.\" Thankfully Amazon customer support actually understood my grievance with this phone that is advertised to work with any carrier in the US. It technically partially works; LTE, CDMA, 802.11AC all fine, just no firmware support for advanced calling features (though oddly, VoLTE did function). The phablet itself is well made, and the display looks good when looking directly at it. The display otherwise has a terrible blue-shift when looking at even 10º off angle in any axis. I was very surprised to discover this after reading so many positive, professional review sites exclaiming the virtues of the Super AMOLED display. It's also a little stuttery, as if the GPU can't draw over 60FPS when scrolling in Chrome. Those downsides mentioned, the display looks incredible under the right circumstances being perpendicular to your view plane, and not skewed off axis laterally at all. The camera is also stupid nice. I didn't have time to enjoy the S-Pen due to hours wasted today in trying to get basic, 4YO calling functionality working on this $1k device. That mentioned, I think that I will try buying it directly through Verizon since I'm sick of iOS. Cheers, and I hope that Amazon CS updates the advertising on this page to reflect this glaring omission of an otherwise good product. Experience: -1 stars (negative stars...) Phone itself seems to have 4-star potential after customizing the UX.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Back to reality", 
                "review_text": "I sent it back. 900 smackers for a phone. Really, I got over it. My Note4 is still kicking it and I can take the battery out. Booya!", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Excellent hardware and software. I love the two different about with certain apps", 
                "review_text": "Best phone I've ever owned. The battery life sucks though... I barely use the pen. Wish the screen was a bit wider... I am coming G from a Phab Pro2 and love the size of the screen... But I'm getting used to this so far", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=15/ref=cm_cr_othr_d_paging_btm_15?pageNumber=15", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Battery is shocking", 
                "review_text": "Great phone. Let down by its terrible battery. Never lasted 12 hours.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Good but overpriced phone.", 
                "review_text": "It's about what I expected, but it still feels overpriced. I have big hands, and the stylus is tiny, so I won't be using it much. On the bright side, the screen is lovely... but the curved edges feel like a distracting gimmick.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Awesome. Best Bang for Buck.", 
                "review_text": "Exceptional piece of hardware, paired with a dynamic integration of Android OS and Samsung's Touchwiz. I've owned every Galaxy Note phone, with the exception of the first and fifth iterations. This phone is a technological marvel and is still cheaper than the iPhone X. Featuring 6 GB of ram, there is nothing that I can throw at the phone to slow it down and you can dock it for full screen computing options. Bluetooth controlled gaming cast to my television, Virtual Reality, dual-sim capable or up to 256 gb on-board storage, a WACOM stylus that goes for around $100, and the camera rivals my Nikon D700 DSLR, all in the palm of your hand. As a Note7 owner/user for over a year, Samsung did their 'screw-up' justice with this piece of hardware. I thought the Note7 couldn't be topped, but the Note8 surpasses it in every way. There are folks who don't like the Bixby key, but the key, and Bixby, are really useful once you set them up. You can also disable the key if it bothers you too much. The button and Bixby also pair well with Google's Assistant, picking up slack where Google's Assistant faces limitations. All in all, you get what you pay for and this is a beautiful phone with endless possibilities of uses.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "This is very annoying. If you download any picture/video from your google ...", 
                "review_text": "I bought Samsung Note 8 2 weeks ago and found Samsung Note 8 camera shows all pictures instead of just what's in camera folder, and Samsung has not taken any action to fix it. I just found out from Samsung tech support forum. This is very annoying. If you download any picture/video from your google photo or any web page, your camera will shoe them. the camera app should only show the pictures it took, not other files from any other folders.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Great phone!!", 
                "review_text": "Was debating whether to switch to iPhone or not. So glad I didn't. Good sized workable screen, stunning photos, and instinctive features/impressive responsiveness from OS. Haven't tried it, but also able to Facetime.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Grate product!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "working great", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One from a table to the floor which has carpet ...", 
                "review_text": "One from a table to the floor which has carpet and it cracked my screen. I had not dropped it before.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Absolutely love this phone", 
                "review_text": "Absolutely love this phone, I have been always a note fan and I have been waiting for Note 8 glad I got it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Falling in love", 
                "review_text": "I upgraded from my Note 4 (which I still really liked) to a beautiful new Note 8. Here are my observations so far: • Even when buying new batteries for my Note 4, the battery life just was getting suckier and suckier. The Note 8 easily lasts all day with regular use. Let’s hope it stays that way because you can’t remove the Note 8’s batteries. • Love that they still included an SD card slot in this phone. • S-pen is better than ever, pressure sensitive, and can use it in a lot more places…. But how often do I use it? Seldom to never. • The C-type USB makes the Note 8 charge super fast. • The drawback is that it does not charge really fast when plugged into regular USB-2 ports, I get a warning on my phone telling me to plug in to a different spot. • The screen size is big and beautiful, essentially going edge to edge. This phone does not add a lot of width over and above the older Note series, but is much taller. • Sometimes the touch screen is not as responsive as I would like • Bixby is a slow learner. Either you are going to need to invest some time with this to get it to work right or you will be annoyed that it wastes a whole button just for its operation. • Love the apps edge menus. Very customizable and actually useful. • The face recognition works great for me, but not so great for my hubby who wears glasses sometimes. • The back shows finger prints terribly. If you have a case, this won’t be an issue. • The launcher that comes on the phone is definitely an upgrade from what the Note 4 had, much more functionality and customizing options. • Overall great phone. Got any questions? Ask me in the comments section and I will try to help you out.", 
                "review_rating": "4.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=16/ref=cm_cr_othr_d_paging_btm_16?pageNumber=16", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Pricey but worth it if you must have the latest tech", 
                "review_text": "Excellent phone, possibly the best currently on the market. Not much more to say. I've got no complaints so far.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Outstanding product...", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Love it. This is a great phone.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "amazing", 
                "review_text": "I'm getting use to it right now, amazing phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "I love my Samsung galaxy note 8", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "What i need too do this stuff", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great phone........love it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Network problem", 
                "review_text": "Very good mobile but network poor aomw how dont catch network tower", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "It didn't stick to the curved part of the screen ...", 
                "review_text": "It didn't stick to the curved part of the screen, leaving flaps on the side that pulled the protector off when I put it in my pocket.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "No unlock or paid off...😠", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=17/ref=cm_cr_othr_d_paging_btm_17?pageNumber=17", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "I don't know why it came in an open box ...", 
                "review_text": "I don't know why it came in an open box, Isnt it supposed to be new? I cant spend close to 1k on a phone and it comes in an already opened box, I'm not taking it! Sorry", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Don't waste your money", 
                "review_text": "DO NOT BUY FROM THIS COMPANY. I've had two note 8's from these guys. And both have the same problem. Erratically won't send or receive text messages. I've called Amazon, Samsung, T-mobile, and AT&T tech support and nothing fixes it. These phones are broken. I tried calling their tech support and the line goes to one Omar Latson and just rings until it beeps. These guys aren't legit. Don't waste your money.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "The Truth About the Galaxy Note 8", 
                "review_text": ". Don't believe everything you read on here about the Note 8. Not only does this phone have a beautiful design, it also has a powerful processor and loads of convenient features for everyday use. My only gripe about this phone (aside from its price tag) is the location of the fingerprint sensor which I personally don't really need to use it since you can also use a pin, password, pattern, face recognition or the iris scanner. You have options! As for the battery; you DO NOT have to charge it twice a day like another reviewer mentioned in one of the reviews. I charge my Note 8 in the morning if it needs it. It takes less than 1 1/2 hours to fully charge thanks to the quick charge technology. Once the phone is fully charged, I open power saving mode from the notifications panel and I select MID power saving mode to prolong the battery life and, just in case you're wondering NO it does not affect the phones performance at all. This phone is equipped with 6 GB of RAM so you have the ability to run multiple apps at once with or without the power saving mode feature turned on. This phone is a beast at multitasking and obviously like any other phone it will use up battery life when using all of its resources for a long period of time. For those of you who are really curious about this phone, check out YouTube videos by SuperSaf TV, Android Authority, Sakitech and many others who have posted detailed reviews about this phone. The dual camera with dual OIS (Optical Image Stabilization) takes amazing photos in low light and has so many cool filters and, also comes with its own photo editor pro. You can crop someone out of a photo and place them in another (that's if you're into that kind of stuff). It's the best camera on the Android and possibly even Apple market. At first I was a little annoyed with the Bixby key (Not Bixby) just the key. You can now disable the key which opens Bixby home. Bixby home is just a portal that shows you what's trending on your YouTube, Facebook, and Twitter feed and, also shows you the current weather forecast' which you can conveniently choose to pin or hide from your Bixby portal. It's not as bad as people say it is. Bixby however' is pretty cool. Bixby is not just an average virtual assistant. Bixby does a ton of things like takes screenshots, creates new contacts, opens any specific Pandora station, opens Google maps and navigates to any address you ask for, gets you an Uber and many other things. One of my favorite Bixby features is the ability to create Bixby commands. For example' you can command Bixby to turn on the blue light filter, do not disturb mode and, always on display just by saying \"goodnight\"! In the morning I have her programmed to turned those features off just by me saying good morning. I could go on and on about this phone but, I recommend for anyone interested in this phone to watch YouTube reviews (like I did) before purchasing. Happy Shopping!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Camra is good", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "i have the verizon version and absolutely love it better the my previous s8 plus and s6 ...", 
                "review_text": "i have the verizon version and absolutely love it better the my previous s8 plus and s6 edge plus. the s-pen is super easy to use and very helpful and innovative when browsing and doing a multitude of things. it doesn't feel large in my hand at all and still fits into my pant pockets. i don't think i will ever downgrade to a lesser samsung model. it's note all the way! PLEASE NOTE: MY PICS ARE OF MY PHONE AFTER THE BLUE SKIN WAS APPLIED!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "No Verizon voicemail app", 
                "review_text": "Good phone at a good price. However I did not find out until it was too late to return it that Verizon won't allow its voice mail app to be put onto unlocked phones.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Fantastic phone, lives up to the hype for me", 
                "review_text": "Beautiful display on this phone, both in broad daylight and darker conditions. Seems to adjust brightness appropriately. The off-screen clock view does not appear to use much noticeable power. The fact that the phone \"wakes\" up into the off-screen clock where the fingerprint sensor is active (and can unlock the phone) means it feels quicker to unlock than my old Galaxy Note 5. Iris detector also works surprisingly well. I registered my irises with glasses off but it gets it with glasses on usually after a second or 2 max of adjusting the phone's distance. Only complaint is a minor detail about the keyboard - long-pressing on a key helps you quickly insert punctuational characters, and it works similarly to my old Note 5 with one exception, the long-press time is notably longer on the Note 8 such that it's extremely annoying to use. Wish there was a tunable somewhere to adjust that. The Note 5 had it perfect.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Great phone, however the curved display is incredibly fragile", 
                "review_text": "Great phone, however the curved display is incredibly fragile. Cracks developed around the part button after 2 weeks of use. Samsung will not replace the unit.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Best phone I've had - or even seen!", 
                "review_text": "Had the phone a week, now. Moved up from a Note 4, which I loved. Still, the Note 8 has a larger, more gorgeous screen; much more capable S-pen; great speed, even multitasking; great dual camera with more features than I'll ever appreciate. Bixby learns fast, and is both fun and functional. Along with all the other connectivity options, it adds MST. That gives it the unusual (unique?) capability to use Samsung Pay not just where the vendor is set up for it, but anywhere there's a card swiper. Very cool! I hear complaints about the location of the fingerprint sensor,but I have no trouble locating it (it's easy to feel at the left edge of the \"window\" where it lives with the dual cameras).I don't use it for unlocking, but it also serves to drop down the notifications, making that a one-handed operation. It's a large phone, but less wide than many smaller phones. I have very small hands (no wisecracks, thank you very much), and have no problem holding it or using it. Just a great device. And it's expensive, but so is every other good phone, so for a couple of extra dollars a month, I have everything I want. Oh, and it's very good as a phone, too!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Not even new like it was supposed to be", 
                "review_text": "Screen was cracked when I got it. Not even new like it was supposed to be. Terrible", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=18/ref=cm_cr_othr_d_paging_btm_18?pageNumber=18", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Apple switched over to Samsung", 
                "review_text": "I recently made a huge step and going back to Samsung phones after many years with Apple. I am currently on day 2 and I AM IN LOVE....I will continue to use my apple laptop at home but I will forever be back with this NOTE 8. I love all the technology I feel like I have been missing with Apple and absolutely love being able to customize everything so this phone is ME. The size is amazing and even though the battery is smaller It seems to drain slowly. I haven't had any issues with this phone and personally am satisfied that I finally switched back. (I bought my phone through att not amazon). I think a big perk was I could transfer my Iphone over at home and not in the store as well.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "It is clear use and they said it is new", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Samsung Note 8- I LOVE IT!!", 
                "review_text": "I absolutely love this phone. There is so much it can do. I just upgraded from a Note 3 which I also loved. The Note 8 is quick, responsive and has many facets. I love the Edge feature where you can pull across the sidebar and look at notes, contacts, weather, your calendar etc and then close it when you're done. I can't wait to discover all it does. It was a difficult decision to spend this much money for a phone but it is awesome.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "Had to return after two days of trying to get to work with Verizon.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "good looking screen", 
                "review_text": "Pros: good looking screen, snappy performance, no connectivity issues, and elegant design, cheap to expand local storage with add-in microSD, water and dust proof are nice improvements over the Note 5 I had before. Camera speed and image quality are very good for a cell phone. Wireless charger I got with that phone still works with this one. So far, no explosions or fire, so that's good. Overall, the best Android phone for those who want a big screen and think the pen is handy, like me. Cons: So big and smooth it's hard to hold without risk of it slipping out of your hand without a silicone or rubber case even with large hands, but with the curved edge-to-edge screen even a Note8 designed case makes hitting the edge controls and last column of keyboard characters a challenge with human adult sized fingers. Prices for halo phones are getting into the \"maybe upgrading every 2 years isn't necessary\" range. Stupid fingerprint reader placement, right next to the phone lens which you want to never touch with your fingers to avoid smudges. The eject pinhole and the microphone pinhole are exactly the same size, and the official instruction website just shows a wireframe black rectangle and says stick the pin into the corresponding hole, so it's unclear which one you need to jam the needle tip into to pop the SIM card drawer open to install a microSD card - probably bad things would happen if you pushed it in the wrong hole too far. (the right hole is the one at the top of the phone).", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Meanwhile Samsung customer service proves to be useless and consider this as a damaged screen rather than ...", 
                "review_text": "Bought 2 months ago. Paid 1002.62 incl tax and already having an amoled burn in issue with my Note 8. So a faded image of google maps is always on my screen. Meanwhile Samsung customer service proves to be useless and consider this as a damaged screen rather than accepting the fact that it is a defect. What a shame for a 1k priced device. This will be my last Samsung ever.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Three Stars", 
                "review_text": "Micro usb connector dosent work at all need a replacement", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Phone was carrier unlocked(Sprint) not factory unlocked.", 
                "review_text": "Phone was not factory unlocked. It kept trying to auto-configure Sprint network every couple of hours which made it very slow. It would not recognize T-Mobile data network with sim card in it. It would only work using wi fi. It had Sprint ID that could not be uninstalled. I returned it and requested a refund. It was a prime item, but took like 6 days to be delivered. The refund is also taking longer than usual. Update The refund was issued today.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "The screen is so fragile that it cracked after a 5 INCH FALL!!", 
                "review_text": "Extremely fragile. After only 6 days of use it fell from my hand to the table (about 5 inches) and the screen cracked, part of the screen went green and stopped working. What about the \"gorilla glass\"?? What kind of \"gorilla glass\" can't resist to a 5 inch fall? Samsung has charged me 430 dollars (in Brazil) to Fix the damn thing. DON'T BUY IT!!", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "but Google Assistant is really helpful with excellent voice recognition", 
                "review_text": "I recently upgraded to the Note 8 from a Galaxy S6 Edge Plus and the Note 8 is a major improvement. Battery life appears to be at least 3 times that of the S6. The 8 is bigger, but not unwieldy. There are lots of operating system improvements. Bixby doesn't seem to work very well, but Google Assistant is really helpful with excellent voice recognition. I haven't used the S-Pen much, but it is nice to have something to take notes with without searching for a pen and paper. The camera seems to have excellent resolution as well. With all the available discounts on Verizon, the phone is approximately half price and for me a great upgrade!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=19/ref=cm_cr_othr_d_paging_btm_19?pageNumber=19", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "very good!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "SCAM: NOT UNLOCKED!!!!", 
                "review_text": "This is a VERIZON LOCKED PHONE. DO NOT TOUCH IT.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Best Phone Ever!!", 
                "review_text": "I've had almost all of the Samsung phones and this is by far THE. BEST. PHONE. EVER. Period. So many features, so slim and powerful, amazing camera, great sound and options to change the sound, SD card capable (as with rest of Samsungs), great battery life, alternative security features. The S Pen is really cool and works like a charm. Samsung has really perfected the technology. Really happy about this phone!! Samsung got it 100% right this time. P.S. bought mine from TMobile directly on the Jump plan. Traded up from the Galaxy S7", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Great phone with disappointing stylus", 
                "review_text": "I loved my old Samsung Note 4 until the screen broke and would have cost more to fix than the phone was worth. The Note 8 is definitely a huge improvement on many fronts -- a more vivid screen, a zippier processor, more than ample memory, above-average battery life, wireless charging, and superb security features. The Note 8 can be unlocked by fingerprint sensor, iris detection, face detection, voice recognition, passcode or pattern, authorized GPS location(s), and detection of registered Bluetooth devices nearby; these security measures are used concurrently, so there is rarely any hesitation in unlocking the phone. So why only three stars? First, I hate the curved \"infinity\" screen -- it's not well-protected by any case I have found and it scratches far too easily. Second, the S-Pen stylus is far too sensitive, making it extremely difficult to write legibly or make accurate drawings, for example; unfortunately, the stylus sensitivity is NOT adjustable, which is a huge miss, in my opinion. Hell, the stylus is the reason most users buy the Note 8 instead of the Galaxy S8, so to not offer a customizable experience is absolutely baffling! Lastly, Bluetooth performance is pretty weak for a flagship phone like this. I regularly have connection problems on a multitude of devices, can't stray more than a dozen feet away, and suffer annoying drop-outs on wireless earbuds -- all problems that my wife doesn't have with her much older iPhone. Come on, Samsung, get your sh*t together! For 900 bucks I expect a lot more than a phone that won't burn up in my pocket.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Not Brand new phone.", 
                "review_text": "Not brand new. At this price I expect it to be Brand new. When I went to activate it, I was told that it was associated with some delinquent account. Note 8 as such is a great phone.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Most awesome phone out", 
                "review_text": "I had the galaxy note 3 for 4 years then I went cheap and bought the galaxy j 7 prime a few months ago and it's an ok phone but it was so slow. So I went to t mobile and bought the galaxy note 8. Omg you get what you pay for. The note 8 is lightning fast. The camera is outstanding and having the note 3 , I see the improvements and it's definitely worth the money. I use the phone more than my laptop because it's faster, the pic is clear and better. So I think of my phone as a mini computer. I'd highly recommend getting this phone and spend less on a laptop. I use my phone for music, watching tv, movies, and poker, this phone is better than iPhone 10. I'd suggest getting the vs headset with the phone it's unreal. The note 8 and s 8 are the same price . Get the note 8 it's better than the s8 . Best phone that's out anywhere ty samsung!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Its amazing but a week after getting it and had water ...", 
                "review_text": "Its amazing but a week after getting it and had water spill on it and all of a sudden mic doesnt work.. i have to use earphones now", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "If you have Verizon and the added software is not a bother you might find the phone working fine. Returned it because my carrier is AT&T and ...", 
                "review_text": "Is a Verizon issued Note 8 with carrier specific software. Seems to work for a Verizon phone. But does not have the feel of New Factory Unlock performance. The added software start to download updates and keeps asking for setups for carrier specific features. If you have Verizon and the added software is not a bother you might find the phone working fine. Returned it because my carrier is AT&T and does not support Verizon services.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Simply amazing, and a pen.", 
                "review_text": "In every way an upgrade from my previous S6, which was great. Super fast, can feel android and hardware upgrades/ updates. I don't have puny hands or muscles so its size and Weight don't affect me but I can see where it would be a problem for my toddlers, who won't be playing with this expensive device anyways. Not a huge video consumer and keep a tight rein on my apps, so I guess that's why I haven't noticed much of a change in battery consumption. Got phone from Sprint but had to let Amazon world know it just may be worth the price. That accessories I purchased from Amazon for perfectly and make the Note experience more awesome. My first stylus experience has been enjoyable as well, love the phone off note freaking function.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Longtime iPhone user converted.", 
                "review_text": "I have been using iPhones since my first smartphone and this phone has gotten me to convert to Android. Although phones continue to get more expensive, Samsung manages to have great sales on their phones. I personally got my phone on a Black Friday special for just $600. I could not be more happy with this phone. Let me address the common issues with this phone for starters. This is one of the largest phones on the market and if you have small hands or even just slightly under average size hands this phone most likely will not be for you. If you have average size hands, like me, you can get away with putting a pop socket on the back to handle the phone. Battery life on the phone was slightly sacrificed by putting the S-Pen in, but the battery is fairly large and there is also battery saver mode. It is also made out of all glass and can be very slippery without a case. Some of my personal favorite things about the phone, even after using it for the last 2 months, the S-Pen. Many reviews say that you will get over it after using it a few times but as a finance major, I am fascinated by the stock market and cryptocurrency. I HATE having streaks all over my screen so the S-Pen just seems like the best action to take to prevent them. Also, coming from an iPhone, I was not a fan of the screen size but it quickly grew on me and I have found it to be one of the nicest features on the Note 8. I am also a fan of the always-on display, I can have my phone sitting on my desk and not have to touch it to see if I have received any notification and it only drains the battery about 1-2% per day. Overall one of the best phones I have ever used and I can happily say that I have been converted.", 
                "review_rating": "4.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=20/ref=cm_cr_othr_d_paging_btm_20?pageNumber=20", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Another home run for Samsung", 
                "review_text": "This is my 3rd Note phone. I just upgraded from a Note 4. I was planning on getting a Note 7 last year, but started to see the \"fire\" stories just before I went to purchase, and waited another year. I was a little disappointed the body was slimmed down compared to my Note four (I liked the wider real estate for videos), but have quickly gotten over it. I'm still learning the new features, and especially like a few such as being able to swipe up for apps vs hitting app key, always on display and the many places to hide groups of your favorite apps. On a day one appraisal, it seems to be quite quick and fluid. Wireless charging works like a charm, even through a case, and wireless charging pads do not cost an arm and a leg...authorized dealers sell them for as little as $20, and you can find them on that auction site for as little as $7. Camera takes awesome photos and HD video, although I have not tried the dual lens feature yet. Getting rid of the physical home button was long over due. I did not purchase my phone here, I purchased it at that big box electronics store, and unlocked was actually $20 cheaper than the AT&T (my carrier) model. Something you need to know if getting an unlocked one...the sim from your old phone may or may not fit (mine did not), but if you have the older, larger sim, just take it to your carrier and they will \"punch\" the chip out of it free, so it will fit the Note 8, and save you the $$ of buying a new sim. Now for the cons: 1) PRICE. Tax included this phone will set you back $1,000. This is the future of new premium phones, and that future is EXPENSIVE. 2) Non-removable battery. This phone is not noticeably thinner than my Note 4...so they can't blame \"saving space\" as a reason not to return to removable batteries as people have been begging for ever since they took them away with the Note 5. They are just following Apples lead by building in an expiration date (when your battery dies). I HATE this new trend, but pretty much all premium phones now have non-removable batteries, so what are you gonna do? 3) 128GB? What 128GB model? Stories have been put out that the Note 8 would be available in 64GB and 128GB models...AT&T does not have them, the big box store where I bought mine did not have them...do they even exist? Update 12/01/17: This is my first \"unlocked\" phone. I have used AT&T models before this. After buying, there was a SYSTEM update available immediately, but I don't have to mess with the monthly AT&T \"security\" updates... I call BS on security updates, it seemed that after every monthly update from AT&T, I got more, and more and more spam...the updates seemed to be nothing more than open invites to my phones bandwidth. Best $20 I ever saved.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Phone equivalent of a beautiful princess tiara.....that's worn by Batman.", 
                "review_text": "ceptional phone! New features galore and all an improvement to every Galaxy Note I've owned (which has been all of them). If you're concerned about having to learn a new phone and a new way to do everything you're already used to doing on your old phone, No Worries. Besides a bit more of Samsung integration (mostly helpful if you don't count Bixby yet). Like better & easier backup/restore options, more freedom with settings and customization if you want to utilize them, an easy top notch optimization tool and ways to integrate old apps in a way that will utilize everything this phone can offer. Everything that was new and complicated in learning a new phone is intuitive, cleaner looking and better organized. The manner everything is presented leads to an enjoyable experience of discovery in to what this phone is capable of. Rather than the frustrating research into countless forums and how-to materials to find out what's new, how it works and how to make it do what you need To put it simply, this phone is intuitive in presentation without sacrificing depth of implementation. Only problems I've had are: - Glass Back, Within the first 2 weeks of having the phone my cat knocked it off My 2' high coffee table onto a ceramic bowl/planter. It immediately cracked the glass and spider webbed across the back of the phone. - Second, Bixby... it doesn't feel like an all-in-one go to assistant utility. It feels kinda scattered a bit like a few little, though creative and cool, Bixby \"apps\" that can do specific things by themselves but work together with an otherwise pretty basic Bixby assistant. Fortunately it's easy to turn off and Samsung makes sure to present options to use another assistant if you'd like. - Lastly, The screen, It's big it's beautiful it's amazing but there are a few apps I found that don't wanna work with it because the developers haven't updated them to fit within the screen size. ( Like trying to watch widescreen movies on an old standard TV back in the day) And not necessarily a complaint but just an observation..... the speaker is arguably par of not sub par... in clarity and volume. It's not auditory garbage but just a bit above basic and unusable. Otherwise... easily my favorite device I own right now. I wanna buy it a dress and marry it. But unfortunately I'm broke...The Note 8 is an expensive temptress.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Don’t drop the phone, not even few feet onto soft floor.", 
                "review_text": "Me and my wife owned Galaxy Notes for last few years. We have recently purchased Note 8 for both of us. Today, she dropped it fro from her dresser to the carpeted floor. Although there are no dings or chips, but the screen cracked! No other notes we owned ever cracked for such puny drop. Hec I dropped my note 4 dozens of times, even on pavements and bathroom floors, but never did much damage. Apparently, I am not alone, if you search the internet, many users are experiencing screen cracking issues. I am also reading about if you drain the battery to 0, your phone may not boot up again. I think these will be our last Samsung phones since Samsung doesn’t stand by their product.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "My take on the note 8", 
                "review_text": "First the cons... Bixby, I really really dislike it. It almost ruins the otherwise fantastic user experiense. It is intrusive and half baked is an understatement. You can semi turn off the bixby button, but Bixby has a way of showing up too often. The button is so close to the volume buttons, it often causes screw ups. I gave Bixby a chance, but it failed. Switched to google assistant, much better. Bixy is the one star loss on this review. Screen protectors seem very incompatible with the curved screen. Cant find one that works well. Cost Slippery, must have a case on it to avoid activating everything when inadvertantly touching the sides. Much easier to use with a case. Pros Dual camera. Great camera. The reason I ponied up for the overpriced note 8. Optical zoom nice, bokeh effect very nice. Best in class screen, love the large veiwing area. Software, other the afore mentioned, Samsung got everything right. Elegant and smart interface. Sim card slot, better waterproof rating than iphone x. USBc ports, no more struggling to see which side is the up or down on the port. Has an audio jack unlike iphones. Its a fun phone and has a smart stylus.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Samsung Note 8, Should you buy? \"April 2018\"", 
                "review_text": "Samsung Note 8 is an excellent bit and it surely has some of the finest specs of this generations High End phones, but it is expensive. Question is, If you should buy it in the April 2018 or not? To begin with the Samsung Note 8 has a snapdragon 835, 64gb of storage that’s expandable, 6gb of RAM which is 2GB more than the S8+, The phone and stylus are both independently IP68 water resistant. It has a 3.5mm headphone jack, Thank you Samsung for always keeping it there, a USB type C, dedicated button for bixby, it comes in grey gold blue black and I have the Black as you can see. A beautiful super amoled screen with 521 ppi of pixel density & 83.2% screen to body ratio. So its definitely a bigger brighter visual experience, pretty cinematic I must say. So what are some of the really cool things we can do with the Spen which is indeed what makes this device a Samsung Note. If you come with the aesthetics of an artist or going to become the next paablo picasow or Leonardo Daaal daaa vinsee i then the Spen is definitely a precision device. As you can see in the video review it can really get down to deep tight spots whilst drawing. But someone with my drawing skills won’t get much of it to be honest. Also SPen is capable to take notes during a call. In case you need to jot down a name or phone number quickly. This can be done on screen or separately in a note memo as well. You can also translate at the tip of Spen, it’s pretty quick and useful. One fun thing we could do with SPen is the live message, so draw down your short message and yes it can be sent via all your favorite sharing apps as long as they support GIF’s. It does send the message along with the animation which makes it super cool. Spen has added a bit more to multitasking buy introducing app pairing, so now you can pair two apps you wish to use side by side and can launch it with a single tap conveniently. So apart from the SPen, Samsung has introduced their very first Dual camera in Note 8. It’s a 12mp telephoto and 12mp wideangle lens which will give you that depth of field and the ability to control how much of the background should you wish to blur and make that focused object stand out. Both the cameras have optical stabilization, and better low light results. But the nicest bit for me was the 240 fps slow motion. Although it doesn’t capture the video at 1080p but 720p is fairly decent Now We know the specs, the new features of SPen & the all new Dual lens cameras of the Note 8 but should you buy it or not? Fact is the note 8 has pretty much the same DNA as the S8+, same processor, a screen which has almost the same brightness, its just 0.1 inch bigger than the Samsung S8+. Same Malig71 mp20 graphics. The camera yes its Dual lens, but does it make a difference to me, not really. I am not very particular about the depth of backgrounds in my pictures. Besides that it’s as good as the pictures I get from my S8+. Have to mention when you buy a better bigger phone, you expect the battery to be better as well, this however isn’t the case with the note 8, a 3300mah battery compare to the 3500mah battery of the S8+ resulting in less talk time eventually. If you are the loyal Spen user then it’s a must have for you but the ugly truth is that the Samsung note 8 costs a whopping 930$. Which is 241$ more than the S8+ & 90$ more than the s9+. With the launch of S9+ the prices of S8+ will eventually dive down. So there we have some facts aligned to make us decide if we should be buying the galaxy note 8 in April 2018 or should we give it another thought. Samsung Galaxy S8+ Unlocked 64GB - US Version (Midnight Black) - US Warranty Samsung SM-N950UZKAXAA Galaxy Note8 (US Version) Factory Unlocked Phone - 6.3\" Screen - 64GB - Midnight Black (U.S. Warranty) Samsung Galaxy S9+ Unlocked Smartphone - Midnight Black - US Warranty Samsung Galaxy S9 Unlocked Smartphone - Lilac Purple - US Warranty", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Expensive, but you get what you pay for. Look for deals", 
                "review_text": "The best phone I've ever used by far. Including iPhone, Blackberry, LG, and other Samsung. The build quality is awesome. Cons: Fast charge 2 instead of 3 or 4. If Samsung was going to keep FC2.0 they should have increased battery capacity. With that being said, my battery last throughout my work day w pretty heavy use. I see people complaining that the battery doesn't last 24 hrs. Do they ever sleep? 16-18 is enough. After 2 weeks, I am very happy. *Samsung Pay gives you $200 instantly w T-Mobile purchase", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Note 8 one of the most powerful phones for 2017", 
                "review_text": "I use this phone since it's in the market and it still my main phone - it run speed and smooth - best camera - S pen is very useful - best screen in the market - a lot of choices to unlock the screen the only two down sides is - place of the finger print - size of battery SAMSUNG hope these two things change in note 9", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "NOTE 8 IS AWESOME👍👍👍😁😁😁", 
                "review_text": "Samsung galaxy note 8 is so Awesome. Just everything about the phone, from the huge crystal clear High Definition screen, to the super awesome camera/ video resolution. 64 GB built in memory. I highly recommend getting the Tech 21 Brand case, which is very strong and durable case. Money well spend.........👍👍👍😁😁😁", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Best Phone created so far", 
                "review_text": "I watch way too much YouTube and research everything on the platform to make sure I am making a good sound decision. Before I bought the Note 8 I contemplated the Google Pixel 2 XL and the iPhone X. After a few months of active use, and a few hundred pictures later, I have seen the future. I can talk about the screen, the stylus (Infinite Paint is a must download,) or the camera; which literally amazes me with its superiority over iPhone. None of that matters. The biggest strength of the Note 8 isn't it's RAM, it's the battery. With all that power comes a balanced performance between usage and creation, and it comes in the form of the Note 8's 3300mAh size battery. With normal use, you could easily get 2 days out of it, and a full day watching YouTube. It's 2018, and we still don't have flying cars, but we have the Note 8. New category: PC Phone. The first time I have ever truly felt I didn't need my laptop. Samsung SM-N950UZKAXAA Galaxy Note8 (US Version) Factory Unlocked Phone - 6.3\" Screen - 64GB - Midnight Black (U.S. Warranty)", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Bluetooth does not work", 
                "review_text": "As others have noted, the \"Gen 5\" Bluetooth that comes with this phone will probably not connect to your car's infotainment system. Do a quick Google search of \"Galaxy Note 8 & Bluetooth,\" and you'll quickly confirm this unfortunate fact. I have also confirmed that Samsung Support will blame your car's outdated software - even if you have a brand new car with the latest updates (as I do). Samsung appears to have a deeply flawed phone, which they will not recognize, and which perhaps they are unable to fix. At least it does not spontaneously catch fire like the Note 7 :-) Apart from the fact that you cannot use this phone in your car, it is indeed the most feature-rich and beautiful phone on the market. So make your decision accordingly. UPDATE: After several hours trying every hack the Internet had to offer to get my Bluetooth working, the Note is now providing a somewhat spotty connection to my car. Not sure what combination of tricks finally worked, but it is functional. Raising my rating to 3 stars.", 
                "review_rating": "3.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=21/ref=cm_cr_othr_d_paging_btm_21?pageNumber=21", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Best phone I have ever used", 
                "review_text": "Best phone I have ever used. Probably the only phone out there for now that's worth $1K. I can't list all the great things but I can give you an idea. Battery life: I was a bit skeptical in the beginning because of the smaller battery size but somehow Samsung managed to make it last longer than phones with bigger batteries. One reason for this is the sensible software management that lets you snooze/hibernate apps that you don't use often. Smart move. Build quality: This one cannot possibly be challenged. A bit too tall and a bad position of the fingerprint scanner are the only complaint I have. I love everything else about this phone. Call quality and coverage: Absolutely great on T-Mo's network. In fact I am to use this phone at places where their coverage is usually terrible. Software: Very fast phone. Touch Wiz has greatly improved. Its very fast and fluid on the Not 8 even if you open a million apps or tabs. Camera: I'm not a camera enthusiast but I believe its among the best. S Pen: I know many people don't see the use it but it is indeed a wonder tool. It has made my life much easier. Samsung has delivered this time again.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One of the best devices produced by Samsung so far...", 
                "review_text": "This is the latest generation Galaxy Note device from Samsung released this month and I think its one of the best devices produced by Samsung so far. I am personally a big Note series fan as i have used all the note devices before and this one by far is the best in comparison. like any other Samsung smartphone this device is also loaded with features useful for all types of people like students, business personnel and even for those at home at everyday use. this new device is also equipped with new dual lens 12MP camera which enhanced the photography experience to the next level. this camera has latest features like dark imaging enhancer, dual background imaging which takes up to 23% more image than you need with extended wide angle imaging. all these features are more than beyond attracted to people who are involved in photography as this gadget is the perfect fit for them as this phone is more portable than a professional DSLR camera. moreover Samsung Galaxy Note 8 has a new end to end display which is the most sharp display with super amolded screen 4. This new screen has sharpest resolution Samsung has made with spectrum producing millions shades of colors. I think this is the best infinity display in the market compared to its competitors. This new Note phone as also received a very impressive IP68 rating for dust resistance and water resistance. this is the highest rating given to the phone for water resistance in the market as this phone can withstand under water of depth of 1.5 meters for 30 mins. its an impressive figure for people using this phone outdoors in conditions like rainfall. like always Samsung Note phones comes with a stylus S pen which from years have improved. this time around samsung has released the S pen with new over haul design and more than ever sensitive response. there are endless activities a person can perform with the new stylus making the phone more practical than ever. the stylus allows you to do multitasking at very efficient ways like taking notes in class or recording the data for an assignment outdoors without need of a laptop. it also connects to your social media and allows you to write and draw many types of emoji and facial expressions making communication more realistic than before. there is also a new feature this time around which allows you to write on screen with your phone locked to make quick notes. All these high tech innovative features and specifications like powerful snapdragon 835 processor with 6 GB RAM and options for micro SD card installation comes with a hefty price of $950 which is a lot to ask for. This device may also lack in repairing department as filled with so much technology, it may be impossible to get it repair if something wrong happens to it. Overall in my opinion I think this device is the new leap forward in the smartphone technology and is something to look forward to with very minor downfalls and multiple uses, this device is one to get for everyone.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Best phone money can buy", 
                "review_text": "Simply put, this is the nicest phone I've ever owned. Coming from the turbo 2, this phone is superior in almost every way. The note 8 quite literally can do just about anything and everything you could imagine a smart phone being able to do. Its fast and very responsive, the battery isn't bad, the screen is absolutely beautiful. The camera is the best I've ever seen on a phone. There is just so many good things to say about it. The S pen is a nice little bonus and does what its suppose to do. Speaker and sound quality is good. Bluetooth and WiFi signal is above average. The settings and options in this phone seem bottomless and I could spend weeks learning everything this thing is capable of. I have very few complaints and issues, only minor ones that don't outweigh the good. There's just a few poor design choices. For one, although the all glass body is very nice, sleek looking and feels good in your hand, having a phone this expensive and be this fragile is not a very smart design choice. The curved screen is beautiful but makes it very difficult to protect in a case, which you are definitely going to need one. The buttons on the sides are very awkwardly placed, with the power button almost in the center and directly opposite of the volume and Bixby button. The bixby button should not exist in my opinion or be remapable. Its to close to the volume button and always gets pressed by mistake. Again, these awkwardly placed buttons also make it difficult to fully protect the phone using a case. All in all, this is the best phone out on the market right now with hands down the best screen. in my opinion anyone should be happy to own one.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "LIVING UP TO THE HYPE and MORE", 
                "review_text": "Had it for a couple of days now and no complaints WHATSOEVER! Had Note 3, 4, and 7. This has lived up to the hype, does everything a Galaxy Note ever did for me and better. It has the best feel of any phone I have known. Glad and very satisfied with purchase. Sure, no gadget can be at par with every customer's technology-driven bells and whistle wish-list, due to lag time between design wrap-up and production ramp-up. But, this comes reasonably close to excellent and timely delivery of useful innovations. So what, it doesn't support t-mobile's new Band 71. Neither does Apple's new iPhone X. I like the fact that Samsung is pushing the envelope and staying years ahead of Apple in innovation incorporation in this flagship product line. From comparisons I have read so far, this beats iPhone X, hands down. on just about every count.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Definitely the most advanced phone ever made.", 
                "review_text": "This Note 8 phone is unreal. I thought the Galaxy Note 7 was incredible and was so disappointed when it was recalled. The Note 7 in summer 2016 was as advanced as the iPhoneX is in November 2017. This Note 8 is amazing. 522 ppi makes this AMOLED screen gorgeous. This thing can hold a 1 TB card! 6GB RAM. Waterproof for 30 minutes submerged. The S Pen is better than ever. I forgot how addicted I became to the S Pen after using it for years on the three previous Notes I had. I keep dropping this thing during the first 9 days I have had it and the gorilla glass of course is so hard to damage. The battery lasts longer than the iPhone X. Charging from 0% to 100% in 98 minutes...which is almost exactly the same as every Note I have ever owned (anywhere from 90 to 100 min for them). Fantastic. I am so happy with this phone, especially for a phone $70 cheaper than iPhone X that is made by free adult workers in a democratic country instead of by forced and abused laborers in China. This Note 8 was totally worth the wait. So sleek and beautiful. And the ear buds that come with it are almost as good as the $150 pair I already had. I love this phone!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "My Mistake in trusting.", 
                "review_text": "Huge disappointment. If you want a gadget, this might be your choice. Screen size and camera good. Bloatware outrageous. Battery life, pitiful, stylus-proprietary and poor quality, price- unwarranted, charger- overpriced and low quality, setting were very good on Note 4, poor on note 8, layout of phone awful, must accept features or phone will not work, support- ill-prepaired. Lost applications and endless hours of work with recommended transfer program. Tech savvy, open minded, corporate phone rep, purchased and returned.$1,000 phone should have more quality and be flexible in use. Support from Samsung wretched.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Love it for pen. Hate it for pen software and lack of tools..", 
                "review_text": "You want a phone with Stylus? This is the one to get because literally nothing else compares. That being said the Note line is turning into something of a yawner. It used to be the phone packed to the gills with sensors and tools... Take my Note3 for example... It also included an IR blaster (full programmable universal remote - control hotel TV's, trigger DSLR and other uses) it also had ambient temperature and barometric sensors (little weather station in your pocket.) The Note8 lacks both. Even the pen, while great, the app to use it the most (their own Notes app) is terrible compared to the one from the Note3. Gear VR: they had to come out with two headsets in 2017 because the s8 headset which I have doesn't fit the Note8.. This shows a clear lack of planning on Samsung's part, and troubling as this is beginning to feel like a trend. To be clear I like the phone and don't regret buying it... But I'll be honest, if you don't use the pen you can save some money and get something else.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "From a lifelong Apple fan", 
                "review_text": "I have been an Apple fan since day one. I have had every single iPhone since they came out, except for this year. Finally realizing how Apple is not even on the cutting edge of phones. I switched from an iPhone 7plus to the Galaxy Note 8 and it is an extraordinary phone. Great display, great pictures and everything you could want in a phone. IPhone Xpensive, this thing has a finger print scanner, face scanner and an iris scanner!! So happy I switched", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Samsung has done it again!", 
                "review_text": "In my opinion this is the best phone out right now. It may dont have the best camera but still the camera in this phone is amazing. The display in this phone is incredible, some times it looks like a sticker, is crazy good. Im not a big fan of the edges on the side of The screen because is really hard to find a screen protector that work properly on it, however i have to admit, it does looks cool. The battery life is good but not great, overall performance in this phone is pretty good, I haven't had any problems so far. One major issue with this phone is the price, there is a lot of good phones out there for half of the price of the note 8 so for someone in a tight budget this may not be a good option, however considering the amount of things this phone can do, and what the competition has to offer, i have to say the price is worth it, this phone is like a Swiss Army knife, let me explain... The S pen. 3.5 mm headphone jack. Really good headphones in the box. Micro sd card support. Fingerprint scanner. Iris scanner. Face recognition. heart rate monitor sensor. Fast Wireless charging. I dont thing i need to keep going with this, you get the point 😉", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Better than my iPhone S6+", 
                "review_text": "I have been an iPhone junkie since the iPhone 4 thru 6S+. Am so glad I switched to the Note 8! Batt life is a lot longer than my former s6+, and the customization available thru Android is a heck of a lot better and easier than ios. Yes, this model is a bit pricey, but am still glad I made the switch.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=22/ref=cm_cr_othr_d_paging_btm_22?pageNumber=22", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Works on Total Wireless", 
                "review_text": "I did not buy this from Amazon. But I thought I'd share my experience in case it helps someone else out. I'm using the unlocked version on Total Wireless (YES IT WORKS!). I contacted total wireless chat to activate my phone. Process was seamless, everything worked fine. Until I tested data. I had issues with the data.... UNTIL I changed this setting: Go into Settings, search for mobile networks, go to Access Point Names. Click on the Access Point to edit it. And change it to \"tracfone.vzwentp\". After making this change, data works on Total Wireless. Also, I use google voice for voicemail only (this is what I use for visual voicemail, I have used this for years and it works pretty good!). To get this to work, I had to call *71XXXXXXXXXX from my phone, where XXXXXXXXXX is your google voice number. This sets up call forwarding on your phone so calls will be directed to your google voice number. Hope this helps someone else.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I bought the Samsung Note 8 because i like to draw", 
                "review_text": "I'm going to have to rant about my phone. Nothing dire, but i feel it might be interesting to some. I bought the Samsung Note 8 because i like to draw..obviously. i have now lost my stylus twice, and nearly lost it hundreds of times. I NEVER lost the stylus for the Note 5 because #1 it was a tight fit and #2 the phone would immediately tell me when the pen was \"apart\" from the phone. The WORST part about losing the Note 8 stylus is that there is NO way to get another one except ordering one online...Amazon, etc. You can't get one from Walmart, Bestbuy, OR EVEN Verizon. If you just want a piece of junk, inaccurate stylus, you will find PLENTY..but not the pen that is specialized for the phone or for your art. It's frustrating and now I'm on vacation without my art tool and there's nothing i can do about it. Rant over.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Check the SD Card Reader!", 
                "review_text": "Great phone but faulty SD card reader. Unfortunately, I was enticed to buy the phone directly from Samsung. I regret this decision as their return policy is terrible. The phone is absolutely amazing! However, when the SD card, which Samsung conveniently delayed the shipping by 3 weeks from when the phone arrived, is inserted into the phone (everything was ordered at the same time)... it only worked for about 2 days prior to giving an SD Card error. I assumed it was a faulty SD card so used a different one I had from a previous phone, the Samsung S7... Unfortunately, the same error even with the different SD card. So, I call Samsung technical support... they agreed, after having me run through several tests, that the error was with the Note 8 SD card reader. Here is the crazy part! They refuse to replace (or take back) the phone stating it was over 2 weeks post delivery. How convenient! They delayed the arrival of the SD card by 3 weeks so that when the error occurs at week 3 they no longer need to take responsibility for the fault in the phone. In all fairness, they are offering to fix the phone but I shouldn't have to fix a brand new phone and try to figure out what I am going to use as my phone for the several weeks it will take for them to repair it. They should do the right thing and send me a new one! Anyway, rant over. I would highly suggest that you check the SD function immediately after getting the phone. Mine worked for about 2 days then began giving errors. However, it would be work again once rebooted.... weird. I tried to reinsert the card numerous times and the restart of phone got old really fast. Otherwise, the phone is fantastic! On a related funny note... when I tried to review the phone on Samsung's website... I received a \"Submission Currently Unavailable\" response. Hilarious!", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Samsung packs all the features in one device, but read why i chose to gave only 2 stars!", 
                "review_text": "If you consider purchasing Galaxy S7, S8, or Note 8 then you should read this review first. You may have heard from YouTubers that this is the best android device or the best they have ever used or best display on the market. Some of it is true, but there is more things that the YouTube reviewers don't discuss on their channel. Samsung is really slow when it comes down to pushing newer security updates and even slower pushing newer version of Android. The most important is constantly getting security updates, there are two major bugs that recently shake the smartphone industry, \"KRACK (Wi-Fi Bug)\" & \"BLUEBORNE (Bluetooth Bug)\" every single devices were affected including Apple devices. That said, Google (Nexus and Pixel) and Apple already patched their respective devices, but Samsung is still behind and that leaves vulnerable to hack. May be, you own a business and getting a device to run your business and would carry all the important documents, bank information, or any business related information, your information is at risk. Samsung has come a long way from their Galaxy S4 and Note 3 days, their software is much better now, but it is no where near close to Google's Pure Android that is currently being used on Nexus and Pixel. Samsung Experience/Touchwiz is bloated with unnecessary features and apps that runs in the background and eats up the battery. I have seen much better software experience on Google Pixel, and some other devices from Motorola and Sony. Some people love the Samsung's extra features and use them often, but others don't prefer and want something that is constantly being updated with security measures. There are other issues too related to Samsung Experience (former Touchwiz); I have found various bugs that are not annoying at all, and doesn't hinder day to day use, but they are there. Samsung needs to streamline the experience, and curate it towards what consumers really want and prefer. I do not recommend this device. If you have the device that is working perfectly fine, I suggest you wait it out until next Galaxy or Pixel 3 or get Sony Xperia XZ1. And if your device is broken and need something immediate and wants to spend money, it is entirely up to you.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "I just made the move up from the NOTE 3 ...", 
                "review_text": "I just made the move up from the NOTE 3, Most everyone here has covered the PRO's and CON's of the device so I'm not going to repeat. I will say for those who say, just go with the S8/8+ the Note series generally out preforms the S series phones. I did keep my NOTE 3 my IR blaster does come in handy I restored my Note 3 and was pleasantly surprised it's still a very fast device. I got my via the Buy one get one free from T-Mobile.. My only issue it's not band 71(600 MHz) ready, which isn't a sticking point for me. It will be for some/", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Locks up and reboots itself frequently, even during a call", 
                "review_text": "My Note8 freezes about 2 or 3 times per week on average, sometimes several times a day, requiring a hard reset . It also frequently reboots on it's own, at times shuts down and reboots even during a phone call . I have tried removing apps and running with minimum background activity and the problem still occurs. Very disappointed as the process for replacement is difficult and usually results in sending your phone back for a refurbished unit.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "iPhone User of Over 7 Years Finally Switches Over, Do It! :)", 
                "review_text": "After years of considering switching to Android from iOS, I finally made the move this November. I picked up a Samsung Galaxy Note 8 from Best Buy on November 1 and I will never look back. I have had iPhones since 2010 (iPhone 4 32gb; iPhone 5 32gb; and most recently an iPhone 6s Plus 64gb) and have a Mid-2015 MacBook Pro Retina 13\" that I use as a daily computer for personal, work and school purposes. The Note 8 blows every iPhone out of the water and after having seen what Apple unveiled to us this last Keynote, the iPhone 8/8 Plus (really a 7s, give or take) and the iPhone X, I knew I had enough of it. Everything switches over with ease to the Note 8 with the included adapters (you just plug your old phone into the Note 8 and choose what you want and bam, you have it). The camera is phenomenal on this phone and it has the ability to take photos that look as if they came out of a DSLR with quality blur (even without the live focus functionality turned on), it is so fast, I have the ability to have 2 different apps open at once and the S-Pen is great. This phone has made me so much more productive due to its highly usable functionality and I feel less reliant/dependent on my phone as notifications are much more discrete with the use of an LED and the always on display to show what app has a notification, without being distracting like the iPhone lighting up the entire screen. Seriously, I do not know why I never considered switching before. I was so convinced that Apple was the pinnacle of innovation until as of recent. They have not brought a single new and innovative feature in a long time and I think I will stay Samsung/Android for now. All I can say is if you have thought of switching over to Samsung from iPhone, give it a try. It is TOTALLY worth it. Until next time, Apple. Au revoir.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The note 8 is a great phone. However", 
                "review_text": "The note 8 is a great phone. However, this unlocked version doesn't have Wi-Fi calling over at&ts network. I returned it and bought it from them.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Fragile", 
                "review_text": "Good but very delicate. Camera, battery life, speed, features, resolution all excellent. Fell approximately 1 foot to tile floor. Screen shattered. FYI $250 to replace at best buy, $300 to ship to Samsung if no insurance. Still hurts.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Do not buy if you like to hear callers", 
                "review_text": "Sound is terrible unless you use speaker to talk on phone. Turn on extra volume feature useless. Call useless Samsung customer tech service who blamed carrier, Verizon. Online reviews show numerous other customers saying same problem with phone. I have owned phone for bout 4 weeks. Verizon offered to send me a \"refurbished\" phone to replace $1000 phone I just bought that volume doesn't work just after 14 day return window. I should have known not to buy another Samsung phone after junk S7 edge.", 
                "review_rating": "2.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=23/ref=cm_cr_othr_d_paging_btm_23?pageNumber=23", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Best Android Phone Available", 
                "review_text": "Brilliant phone. The large screen is usable as the bezzles are almost non-existant. Phenomenal Camera. Battery life is fine if you lower the resolution (when you know you will have a long day). Watch MKBHD's review on YouTube to get the full jist.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The best", 
                "review_text": "Absolute amazing phone! By far the best phone I have ever owned. Had the note 3 and loved it and then had the iPhone 6s olus. Never going back to apple and so refreshing to have a note again. Battery lasts me all day and the screen is unreal", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "At 800 it's a lot better. When these drop to like 300 bucks ill ...", 
                "review_text": "Ugh! Wish I would've waited a little longer! Well worth the 1000 original price tag. At 800 it's a lot better. When these drop to like 300 bucks ill be picking one up for insurance purposes.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The most irritating Note yet", 
                "review_text": "The note 3 was the most delightful phone ever. From the perfect keyboard to the hot swap battery to the snappy respone and sharp looking screen there was little to want except i can spell better that it could. The note 8 is all that and it can sync with my smart tv but infinity screen, bixby,crumy spell ck and missulanouse Bess U Lainey us you're such a stupid f****** phone. Eg. And the Sun soaked area such as your car I just brightness to its lowest setting then set it on stand by and with sunglasses in pretend to be driving and take a call or plot an alternate route... Don't get me wrong this is an excellent phone but its near $999.00 or near the daily cost of a used car.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "This phone lags when there are too many apps open ...", 
                "review_text": "This phone lags when there are too many apps open. Samsung popups are always nagging me to create an account and login. This cannot be silence. Also, weird wifi errors would show up that cannot be silence either. Airplane mode always have a confirmation dialog. Volume warnings always show up whenever the phone restarts. Samsung never honored my trade-in and their call support is basically a bunch of people transferring calls from one department to another. I had this phone for almost half-years. Hopefully it will last me a long time because I don't plan on going back to Samsung anymore.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Incredible Phone! SM-N950U on Verizon.", 
                "review_text": "This Phone is Incredible!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The spell checker is absolutely horrible. Constantly activating screen object without me even touching ...", 
                "review_text": "The spell checker is absolutely horrible. Constantly activating screen object without me even touching them. Not intuitive and difficult to use. Constantly nagging about some update or other annoying reason. Bixby willnot leave me alone. This phone tries to control your life. I went from iphone to this Note 8 and am so far quite disappointed. Actually I hate this thing.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Oh Me Oh My", 
                "review_text": "All I wanted was a phone that didn't die the minute I looked at it. This phone has fulfilled all my hopes and dreams in a smartphone. Rock on, Samsung.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Camera is awesome, everything else....not so much", 
                "review_text": "I despise this phone. I have fantasies of stomping the life out of it and may one day purchase a flame thrower for the sole purpose of ending its battery operated existence. However, no-one can deny that the camera is incredible on this thing. It’s the only function on this phone that is saving its ass. I run a business and need to take fast, top notch pictures and this thing beats the hell out of my iPhone. I mean, slaughters it. If only it didn’t constantly crash IG and have to be restarted, refuse to give me access to recent pics unless restarted, have the smallest keyboard with the send button right next to the delete button so I keep sending customers half written messages, and the worst auto correct program I’ve ever encountered, I might have more good things to say. As it is, the camera is all that is saving it from being a shattered, splintered pile under my right boot.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "I love my note 8", 
                "review_text": "I love my note 8! It takes awesome pictures and it's very fast. I love the live messaging feature and the screen is so big!", 
                "review_rating": "4.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=24/ref=cm_cr_othr_d_paging_btm_24?pageNumber=24", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "Awesome", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "No 600mHz band", 
                "review_text": "Not compatible with 600mHz band. Can't be used with the upgraded Tmobile cell towers.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "The best!", 
                "review_text": "After only owning iPhones, I needed to upgrade.i did not like what Apple was offering, so I decided to take a chance and go with the note 8.I am very happy for the switch as this phone is superior to the iPhone 8 or x.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Excellent", 
                "review_text": "I'm not one to give 5 stars out to any phone I've had in the past but this phone gets the highest rating. Excellent camera, hi def video, great storage, more power, faster, more efficient & just tons of features. Go for it.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Great Purchase", 
                "review_text": "I had pre-ordered the Moto z2 force and had it for about 6 months and then screen peeled off plus it was glitch the whole time. Talked to Verizon and started a payment plan on this phone, I absolutely love it!! No comparison. It's fast, gorgeous, and has a great camera.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Awesome phone", 
                "review_text": "Love this phone. Easy to use and the stylus is amazing!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The bad: Battery get depleted faster than my ex Iphone ...", 
                "review_text": "The bad: Battery get depleted faster than my ex Iphone 7 plus. The buttons tend to get activated too easy while in your pocket and can cause havoc. Speaker not as good as the Iphone 7 plus. That infinity screen is not for everybody specially coming from regular screen ( not a good screen protector made just yet, you do lose some image cause of the borders, it really does look like the Galaxy s8 plus) not too responsive at touch at times . The good : Most definitely- the pen it works pretty good ! The dual app is great -two windows open at the same time ! Side bar is good not great . Works really well .", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "iPhone 8 Plus VS Samsung Galaxy Note 8", 
                "review_text": "As a previous iPhone user, my friends raved about the Samsung Galaxy Note 8. So I purchased it and gave it a 2 week run. These are the advantages iPhone & Samsung have over the other. * iPhone 8 Plus Much better voice to text recognition. Easier copy & paste feature. Easier texting & iMessage is better. Better graphics. Whatsapp picture saving, with iPhone there is no need to save the picture on your phone when viewing. This was a major disadvantage with Note 8. If picture viewed and saved to the phone, then deleted, you would not be able to access the picture again on Whatsapp. Better speakerphone. Better visual voicemail. Unlocking phone is easier with fingerprint reader on the front. Can open text messages from the front screen (with the Note 8 I wasn’t able to) Touch screen is better, more accurate and more sensitive to touch. Pinpoint cursor easier. Easier to use & navigate. Less steps for an action. Google Docs stays open after use. Scroll to top of page easy. * Samsung Better camera. Gives not needed advertisements in middle of usage. Better office apps. Better for business applications. Downloads easier. More options and versatility. More customizable. Charges quicker. Battery dies slower. More prone to viruses. Internal stylus. Side bar feature is pretty cool. Please note: * There is a learning curve with either phone and I took that into account when making the above review. ** There could be things above that might be able to have been fixed, like removing advertisements from the Samsung, but I am sharing my experience since I was unable to easily take care of the issues above.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Screen protectors cannot be made to work with curved glass. Impossible to protect this phone.", 
                "review_text": "This screen cannot be protected, I've tried, about 4 times now. It doesn't matter what you put on it, unless you set the phone on a desk and treat it like a princess, the screen protector will allow dirt behind it and eventually fall off. The Otterbox case works well, but nothing can protect the screen, which isn't particularly scratch resistant in the first place. Doesn't even matter what the phone can and cannot do. Unless you work at a nail salon, or perhaps telecommute, It's not possible to keep the edge screen safe from damage. Edge screens are a flashy solution to a problem that doesn't exist, creating a situation that is not tolerable.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Not a phone for good audio.", 
                "review_text": "Nice phone, audio through nice headphones sounds mediocre. For a phone this expensive I was expecting a lot more. My Note 5 audio was way better. I spend about 3 hours a day during the week commuting and like consuming media while traveling . This phone sucks. Seriously thinking of getting rid of after having for two months.", 
                "review_rating": "3.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=25/ref=cm_cr_othr_d_paging_btm_25?pageNumber=25", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Yo! Battery is the BOMB! (figuratively speaking)", 
                "review_text": "Hasn't blown up yet so...", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "came damaged", 
                "review_text": "if i could put no stars i would product came and wont boot... when i finally got it to boot would not get any signal.. like really what kind of flagship is this?!?", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Save your money, Go with the S8, slightly shorter, save $100 usually.", 
                "review_text": "It's LONG and not much better than the S8 - I have both. Will not work at present time - Thanksgiving 11-23-2017 - on TotalWireless and USMobil kicked out that this is a GSM phone, LIKE whoa, I didn't want that. So, Leaving your security in Verizon, I may hang with MetroPCS till I can save 10-20 with Total on 2 more phones. just headaches.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Just say no to Bixby", 
                "review_text": "I have to give this a thumbs down just for one big corporate insult to the consumer that is all about making money over the consumer experience, which corporate calls \"Bixby\": a voice servant far inferior to google voice services (which come free on every android phone) that got a dedicated button, inconveniently placed, so that frequently when you pick up the phone the consumer will inadvertently hit the button and will be asked, for the 100th, 200th or 300th time, 'do you want to set up Bixby?' And there is no way to disable the button. The permissions it requests make clear that this is Samsung's way to farm personal data and make the kind of money Google does from your personal information. Why else go to all the trouble to develop an app that Google perfected long ago and comes free with the phone? I also found that a promotion I was offered to induce me to buy the phone was inordinately difficult to redeem. At the store they told me to go online, once online I was told it could only be done by installing an app on the phone, and the app made it very difficult to redeem the promotion, you have to dig around, and my submission was rejected multiple times, it was really frustrating, I called tech support three times, they said things like \"Please go to the email that rejected your submission, does it say that you were rejected or that you need to resubmit? You get the idea. Consumers need to reject these kinds of behaviors that so disregard human experience and reveal the corporate folks as willing to frustrate millions of users to make an extra buck or two. Very sad, we need to boycott these kinds of ethically challenged corporate traps!", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Its awesome. It has the best camera quality than any other phone could have.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Perfect", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Excellent phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Great phone and love bixby", 
                "review_text": "Love this phone. There are so many things to like. Don't understand the hate towards bixby. Bixby is amazing once u get to know it. It's not perfect. One particular feature that keep me using bixby is the ability to hold the Bixby button and use your voice to type in a text field ( samsung keyboard must be open to work).", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I love and HATE this phone…At $1", 
                "review_text": "Been using this for a few days now. I love and HATE this phone…At $1,000 even diehard Samsung/Android like myself starts to question MANY things… 1-No kind way of saying it: BIXBY BUTTON NEEDS TO GO. Often mistake it as volume rocker. It lags the phone when pressed, and cause a major delay when you actually want to lower the volume. 2-AGAIN BIXBY BUTTON: makes it hard to tell which way the phone is up or down (when used in the dark). Especially, when there the physical home button is no longer present on bottom of the phone. The bixby button is position almost the same distance on the side of the phone, as the power button. 3-BLOATWARE: Samsung, needs to minimize there software. No one wants to use your email, browser and other crapware when there are superior apps are available. Even more annoying, locked phones on carries (Sprint, AT&T, T mobile, Verizon..etc.) will add even more software. So you have 3 or 4 apps that does the same thing. Many you cannot UNINSTALL. 4-FINGER PRINT SENSOR. Why did they even bother putting it where it is? Ended up dirtying the camera lenses. Take this off and pass on the saving to your consumers. Camera and the Screen are probably the 2 major incentive of buying this phone. The thin bezel isn't a game changer since your palm will block most of the edges anyways. With all this software integration, I think Samsung should just come up with their own OS at this point. They should just keep it simple and be a hardware manufacture and just keep Android CLEAN!", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "The unlocked version doesn't have visual voicemail.", 
                "review_rating": "4.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=26/ref=cm_cr_othr_d_paging_btm_26?pageNumber=26", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Difficult to replace battery", 
                "review_text": "Good features, but all the adhesive makes it almost impossible to open the phone to replace the battery when the battery life starts to go. Unfortunate such an expensive piece of technology will become obsolete when the battery stops holding a charge.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Probably my last samsung device", 
                "review_text": "I have been using Samsung phones for years now. I have had the original galaxy s phone, a couple S3s, an S4, a couple S5s, a Note edge, a note 7, and now a note 8. I think this will be my last phone from them. Heres why: First of all, let me start with some good things. It is a big phone which I like and the cameras on it take absolutely wonderful photos. Its specs also make it handle a fair amount without stuttering or lagging which is nice. Its also a great looking phone. One thing to note, the phone uses gorilla glass 5 which scratches super easily so be careful. Here is why i took off 3 stars. First star was for the fingerprint reader. While I was hoping the rumors of an under-display reader were true, I wasnt actually expecting it. However, I also was not expecting samsung to place the reader in the worst spot imaginable. The fingerprint reader is located to the right of the camera. However the camera is so high up on the back of the phone that holding the device in a comfortable way means you cannot reach the reader unless your fingers are abnormally long. I am not just saying this. I do mean abnormally. I am a tall guy with big hands. I can't reach it. The other issue is for right handed people, you'll have to cross the cameras with your finger to reach the reader. This means youll be smudging your camera every time you want to attempt to unlock your phone. For all intents and purposes, this phone does not have a fingerprint scanner. Star number 2 is for the forced features. Samsung has started adding a button on the phone which triggers their voice assistant, Bixby. Unfortunately, you can not change this or even disable it which means every time you press it, it brings up bixby. You can't have it bring up the google assistant, nor can you turn it off completely.Why would you want to turn it off completely? Well the button is the perfect height to be pressed when the phone is in your cupholder or if its placed down sideways on the wireless charging stand. Another \"feature\" that bothers me is if you are using google search and you click on a link it opens it in its own little browser but if you want to do more, you have to open it in a proper browser app. Normally the google app has an option \"Open in Chrome\" Here the option is \"Open in Samsung Internet\". You can't change this. For anyone who wants to use chrome, youre basically being forced in that situation to use samsung's browser. There is also the fact that the bootloader is locked on the qualcomm versions but that doesn't apply to most consumers so it did not really affect my rating. Finally the third star is for samsung's support. God forbid you ever have to call their support to do anything. When I was trying to return my Note 7 for the recall, they initally told me they had no record of me ever sending my phone in and i wouldnt get any money back. I dug up the UPS receipt and tracking number and they suddenly found the information and were going to mail me a check. Monthly calls to samsung just left me with \"processing status\". I only received my money about 7 months after. Now I had to call in and ask a simple question about a promotion they ran for the note 8. It was about how to trade in an older phone. I called samsung and each person told me to call a different number. I was hung up on twice, and the only time I got anywhere was when I was sent to yet another incorrect department but I asked to speak to the supervisor and he was the only one who actually tried to help. My question still went unanswered because the \"proper department\" wasnt taking any calls...... Final verdict: I would not spend $900 on this phone. If I had to buy again, I would buy the Essential Phone or an Oppo One Plus 5", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "... this is a quality handset with a ton of great features. The cams are awesome", 
                "review_text": "There's no denying that this is a quality handset with a ton of great features. The cams are awesome, s pen is more functional...and fun. I did see a negative battery comment which surprised me. Ive been incredibly impressed with the battery life. I get over 24hrs. Ie, right now I'm at 41% at 7am and it has not been on a charger since around noon yesterday. Now for some disappointments. I upgraded from the Note 4 edge. I LOVED the functionality of the edge screen on that model. I used it ALL the time. The edge panel on this models frankly, just sucks. They completely changed it and now it's more of a hassle than a help. The speaker...why can't Samsung put a decent speaker on their phones??? I've got an iPhone for work and it has a much more powerful speaker. You can actually feel puffs of air pushed out when it's near your face. For making calls, the Note 8 is no better than any past models. I pretty much always use my iPhone if I have to make a call. Now, in some programs it seems fine, but it's never been as good as Apple. No puffs of air are felt when using it either. Other than that, I'm loving this phone!", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Screen is very fragile!", 
                "review_text": "I bought this phone on Black Friday. While I like the camera, the screen is too big to use with one hand. I'm 6'5 so I don't have small hands either. The rounded edge makes the phone difficult to hold onto compared to flat sided phones. While trying to put it on my wireless charger the next day, it slipped off and fell all of about a foot (no exaggeration). The fragile rounded edge of the fancy but useless \"edge screen\" hit a speaker stand on the floor and shattered. The verizon store is worthless for after sales customer service, so I had to file an insurance claim through Asurion and pay a 200$ deductible. When I get the replacement device back I am going to return it to the store and continue using my Sony Z3V. Lesson learned. Maybe I'll reconsider if they get rid of the gimmicky edge screen. I'll add a picture later if I can.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "... camera plus a monstrous processors capabilities make it the best phone ever (by now)", 
                "review_text": "Outstanding screen and camera plus a monstrous processors capabilities make it the best phone ever (by now)", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Such a great phone", 
                "review_text": "I hate complainers.they are everywhere.This is such a wonderful phone.what the hell is wrong with u?Go and buy iPhone and use it without a pen.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Won't waste your money", 
                "review_text": "Piece of junk. Won't waste your money. Screen button sticks, pictures are blurry, screen freezes. Wish I would have kept my old phone.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Why the glasd back???", 
                "review_text": "It's a good phone for obvious reasons and I bought through Verizon. No real complaints except on how fragile the phone is. I've went years without breaking a phone and I've been a mechanic working in an aggressive motorpool. Anyway, I've had this phone and the note 5 and both of these phone now have cracked backs and I don't even know how it happens. For the note specifically is a $900 phone that's now essentially worthless because the back has this crack running acrossed it. I will not buy another phone from Samsung unless they STOP making GLASS backs on their ridiculously expensive phones!", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Nothing but Marketing and Tracking EXTREME", 
                "review_text": "Nothing but ads, add ons, tracking. Not easy to set up. I want my 4 back. This is an octopus in disguise. Difficult to personalize. Lost my active app widget used on the 4. If you don't mind a phone that automatically takes everything you do and stores it in various clouds, where all apps demand access to everything on your phone or they won't work, where everytime you open something they want $ every month or blast you with ads, then I suppose it's a decent phone.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "By far the best phone I had since Note 7", 
                "review_text": "By far the best phone I had since Note 7. I kept my Note 7, and never turned it in.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=27/ref=cm_cr_othr_d_paging_btm_27?pageNumber=27", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Artists please take Caution", 
                "review_text": "I would give it one star for the sheer amount of disappointment I have about this phone, but other features on it made me give it two. I strongly caution other artists out there to research the s pen problems. Immediately within the hour of receiving my note 8 from my phone provider it was faulty. This is a heart sinking fact considering this phones pricetag. The s pen, no matter what art app, including the drawing & writing apps provided on the note 8, bugs out and glitches. It gets stuck and will keep writing heavy lines across the screen- even if it's not even TOUCHING the screen. During this the pen won't respond and you can not click anything, sometimes finger input does not work either. I've tried about everything, including factory reseting it again and not downloading any other apps to see if that worked. Spoiler: it didn't. This hefty review is written by someone who got the phone almost solely so I could draw on it. The other features are quite nice and so is the screen don't get me wrong. But for a phone that's the flagship writing child.. it fails. I suggest artists look into the note 5, they are beautiful things. I hope Samsung recognizes this problem and fixes it in the future. I am incredibly disappointed.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Great phone", 
                "review_text": "Great phone. Is on the pricier side, but if you can't afford it, don't buy it.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Wait", 
                "review_text": "Why did I buy this? Same old Android with an S-pen. Now here is my real issue with the device and why I won't allow my children nor my wife to purchase one at this time. I even have my mother on hold from buying one. Why did they only send the US two colors with low bits? Well they gave the nice phones to those over seas with the little hands who can hold this out of per-portion sized phone. For my hands the phone is two narrow it should have been a little wider for watching video and the over all feel. No America just wait until they bring all colors and memory sizes to the US before buying one. Why should we be sold so short and other countries get everything regarding the colors and bite sizes for the phone. Now for that joke promotion they are offering. Well that's bad business all together. Why not just send us a check so that old not owners can put it towards a new note 8. I sure we can all figure that one out. In closing lets all just wait until the note 9 comes out and maybe they will make the screen perportional in size and not look like a long what ever you want to call it.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Too long, skinny and breaks easy.", 
                "review_text": "Dissapointing. Samsung blew it on this one. The phone is too long, too skinny and breaks to easily. I was looking forward to upgrading my Note 4 to Note 8. Once I saw the Note 8, I decided to stick with the 4. Hopefully Samsung makes a better note 9.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "They put a man on the moon but cannot figure out a battery that lasts 24 hours...", 
                "review_text": "The phone itself is great. The display is sharp and clear. Very nice and soft colors. Camera is good (both front and back). The pen is smooth and very sensitive. A whole lot of useful widgets for business people and creatives. The reason I am giving this phone 1 star is simple: The battery is a disgrace of majestic proportions! And I can't believe (I don't believe) that Samsung lacks the technology to produce a battery that lasts an entire day. Because this one doesn't. Also the \"fast charging\" option is old and not very fast. Takes approximately 1:45 to fully charge the phone. It's soon to be 2018, start producing phones with proper batteries, for the love of God... Shame on you, Samsung. And no, I don't buy the whole \"we wanted to make a safer battery\" crap.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "10 stars", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "A mediocre phone at best.", 
                "review_text": "Pros: 1) I've used so many different Samsung Galaxy phones in the past and this one has the least bugs so far but still no where near as smooth as Iphones. The previous Galaxies had so many problems and run slow like a snail after a few months of use. Every generation I hope Samsung would up the quality control and this gen it kinda did but still had some freezes. 2) I like the screen size and brightness. One of the main reasons why I got this phone. Cons: 1) Camera looks good for social media because of the brightness and and oversaturated colors but actually has very little detail when you zoom in compared to Iphone 7+ and other Android flagships such as HTC U11. Definitely nowhere near as good as the hype you see. 2) Poor battery life. OMG, the battery capacity is even less than the S8 and Note 7 which has a much smaller screen. Samsung had to default the screen resolution to 1080p although the phone is advertised as quad HD 1440p, inorder to have barely adequate battery life. Compared to other 1440p androids, the Note 8 still sucks. 3) Unless you manually change the resolution from 1080p to the advertised 1440p, the screen is not even as sharp as the Iphone 7+ and much worst than other Android flagships running at 1440p. 4) It's a Samsung phone. Historically, after a few months of use, Samsung phones start to develop bugs and lag. This uncertainty makes me uneasy.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Forget It", 
                "review_text": "If you want a phone that has a text message methodology that is totally confusing or a phone that does not hold its place on an audible book, this phone is for you. I have to write down the location I stopped reading and record it in my notes, or I can spend lots of time trying to find the correct location. If I could return it for my Note 4 I would do it in a heart beat. Don't waste you money on this phone.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Camera is awful!!!!", 
                "review_text": "Camera is awful!!!! Much bad compare to other notes. Disappointed.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Hate it", 
                "review_text": "Hate this phone. Got it thru Twinkle. Wish I would have kept my note 4. Bixby is annoying, Google isn't working, keyboard works half the time. Don't waste your money. I wish I hadn't.", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B07539DSV3/pageNumber=28/ref=cm_cr_othr_d_paging_btm_28?pageNumber=28", 
        "name": ""
    }
]