[
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "It worked just perfect!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Very good", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Received iPhone with horrible cracked screen and open", 
                "review_text": "Received iPhone with horrible cracked screen and open. Apparently it’s new and the seal is broken for opening the phone.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "Paid $1000 for an iPhone 8 because it claimed fully unlocked but the phone was sim locked!!!!", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Great phone!", 
                "review_text": "Excellent purchase. I have Verizon and everything worked great. Much cheaper than brand new!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "We purchased this used in excellent condition and it was definitely an excellent condition and ...", 
                "review_text": "We purchased this used in excellent condition and it was definitely an excellent condition and is working great. We have never had a problem with buying iPhones from Amazon.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "FAKE IPHONE! BE AWARE", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "I loved my phone until it stopped working after two weeks will never order from this seller again", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "Phone is doing great, i’m satisfi.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Fake iPhones", 
                "review_text": "I received a fake iPhone!", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "1 star": "38%", 
            "4 star": "7%", 
            "3 star": "5%", 
            "5 star": "50%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QJSQLT/pageNumber=1/ref=cm_cr_othr_d_paging_btm_1?pageNumber=1", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Beware of fake ones.", 
                "review_text": "Received a fake iPhone. No joke. Complete dummy phone.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Dont buy it espacially from fullfilment because ı bought 810 ...", 
                "review_text": "Dont buy it espacially from fullfilment because ı bought 810 dollars and pay also register tax to My country but its left speaker doesnt work and when i mentioned this issue to Amazon they dont want to give any refund more than %10", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Works great", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "IPhone unlocked", 
                "review_text": "The IPhone is fully unlocked", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "👍", 
                "review_text": "👍", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The seller publish item like very new", 
                "review_text": "Not buy here. The seller publish item like very new. And is refurbished and with problems in my case the charging battery. 100% fail", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "It was exactly as I expected.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "This is great until I can afford a 10", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Good stuff!! Authentic one and having all official support from Apple!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great phone!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "1 star": "38%", 
            "4 star": "7%", 
            "3 star": "5%", 
            "5 star": "50%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QJSQLT/pageNumber=2/ref=cm_cr_othr_d_paging_btm_2?pageNumber=2", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "Thanks", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Excellent", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "doesn't not work", 
                "review_text": "first of all the phone itself looks weird. I'm not sure if it locked or no but it did not work with Verizon", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "zero", 
                "review_text": "hi sr. my iphone 8 suddenly restart when i play in facebook, instagram, and my camera doesn't work", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "This phone is incredibly overpriced", 
                "review_text": "The only reason I purchased it is because it was a gift for a dear friend who had a 5 year old I phone 5 and although these phones tend to give you four years of good usage and be relatively high quality, the price is absolutely ridiculous and id never buy one myself. Id give it two stars if they didnt last as long as they tend to, but id rather keep buying my 100 dollar unlocked Android smartphones from walmart every four years and save myself a ton cash.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Arrived on time and as expected", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "the phone was not working and it was not unlocking.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "iPhone 8 is superior to iPhone X", 
                "review_text": "I originally purchased an iPhone X but after 10 days the novelty wore off, and I switched it for the iPhone 8. Here’s why. Touch ID on the iPhone 8 is faster and easier to use than Face ID - and enables me to open my phone before it leaves my pocket. I was also worried about the impact of Face ID which beams infrared laser dots into my eyes 30 times a day (10,000 times a year). I prefer the rectangular screen of the 8 to the one on the X with its curved corners and weird inset. Best of all, I can orientate my iPhone 8 simply by feeling the touch ID button - even in the dark or in a pocket. I can also see exactly how much battery percentage I have left, and closing apps is a snap compared to the X. The iPhone 8 is brilliant - it's fast, simple and familiar to use. By comparison, the iPhone X feels gimmicky because its so-called innovations make it harder to use.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "Missing item", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "1 star": "38%", 
            "4 star": "7%", 
            "3 star": "5%", 
            "5 star": "50%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QJSQLT/pageNumber=3/ref=cm_cr_othr_d_paging_btm_3?pageNumber=3", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "DONT BUT", 
                "review_text": "DONT BUY the iphone 8 isnt as water proof as you think i bought one and took it under water following the guidlines for wayer use and my charging isnt working as well and the water can damage the speakers", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Wish I hadn't upgraded from 6s.", 
                "review_text": "I traded up from a 6s ,and I wished I hadn't.It's constantly freezing.I switch to numerals or caps, and I tap and tap ,nothing happens.Not everytime ,but enough to annoy me.There are a lot of minor inconveniences to numerous to mention.I'm on Sprint .", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "It is what I expected", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Constantly updates new features that I cannot turn off or ...", 
                "review_text": "Constantly updates new features that I cannot turn off or remove. Software update descriptions do not accurately describe new features added to the phone. Initial purchase includes all of Apple's features turned on by default. Just really irritated I have a computer I own and pay the complete price of, and I have no say in what is downloaded unto my phone.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "i'm commenting just like them. Iphones are reliable and have a nice ...", 
                "review_text": "I will be sincere. Since there are many Android fans here and nobody removes their worthless reviews, i'm commenting just like them. Iphones are reliable and have a nice camera. PERIOD.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Good", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Died after a month, no support from Apple.", 
                "review_text": "After a month of use, it bricked itself overnight. Wouldn't take a charge, wouldn't respond to any input, wouldn't respond to the side button or the hard reset combo. As if that wasn't bad enough, I tried to make an appointment at the local Apple store to get it looked at, they had a TEN DAY wait. Lesson learned: Don't buy an Apple phone if you want any level of support from the manufacturer.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "So far it's great.", 
                "review_text": "I upgraded from IPhone 7 for the extra memory and thus far I am really enjoying it. it looks beautiful but aside from looks the performance has been great and I am very happy with the new IPhone. The screen is wonderful, so clear and easy to read, everything runs so fast and overall it was totally worth the upgrade from IPhone 7.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Go for it... It's an apple", 
                "review_text": "Apple the brand name itself reassures u that the product will be worthy of every penny u spend... I am not an applE user yet I have seen alot of my frnds who use apple ... 4 , 5 ,6 ,7 ,8... All of then are proud of owning one , not only proud but also happy to be using one. The performance apple pack is every time 5 years ahead of its competitors . I being an Android user , 😅 is without doubt unhappy. I find apple the best over any of its leading competitors . They may boast of more gbs, MPs , but u can just simply say it's not an APPLE. It's always best to have a horse which is healthy than to have many 3 limbed donkeys. Yes u heard it right ... Healthy as a horse that's made for apple. Even a 4s can do better than many of the android phones....😂😂😂........ If u have the bucks go for apple. Nothing else.... Even it's resale value is great that u can upgrade to the newest apple the next yeaR without much trouble if u r a tech savvy... Simply go for it..... Waiting for the day , when I will also buy one..... Ya maybe A 13s ... 😂😂😂😂", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Same Old..same old!", 
                "review_text": "Really Apple?! I checked it out and played with it. There is nothing at all “different” about this iPhone then an iPhone 4...from what...2009? How is this innovation? I don’t understand it. I have owned iPhones, windows phones, and android phones over my life. Android and YEAH WINDOWS phones have MADE HUGE improvements...what the F has Apple done? I’m over Apple and they’re over hyped nonsense phones! Google or windows now! The pixel 2 ...Samsung...and Windows lumia 950 or Hp Elite X3...ALL DESTROY this iphone! Apples software is outdated...ugly...boring...and behind the times now! Apple needs a complete makeover...and an actual new “THING”...believe me...”one last thing”...it is NOT!!!", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "1 star": "38%", 
            "4 star": "7%", 
            "3 star": "5%", 
            "5 star": "50%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QJSQLT/pageNumber=4/ref=cm_cr_othr_d_paging_btm_4?pageNumber=4", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Four Stars", 
                "review_text": "Excellent phone", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "Bad", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "1 star": "38%", 
            "4 star": "7%", 
            "3 star": "5%", 
            "5 star": "50%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075QJSQLT/pageNumber=5/ref=cm_cr_othr_d_paging_btm_5?pageNumber=5", 
        "name": ""
    }
]