[
    {
        "reviews": [
            {
                "review_header": "I simply put my AT&T SIM card from other phone and it works just fine It is Dual SIM slot so you can play ...", 
                "review_text": "I believe this model is for Europe so it comes with 220 voltage cable charger. At least mine did. Therefore, you need 110v charging cable or wireless charger if you are considering this in US. But given this age, I'm sure people have lots of 110v chargers lying around. I simply put my AT&T SIM card from other phone and it works just fine It is Dual SIM slot so you can play it with either two SIM cards or one SIM and a SD card. Battery life is decent. I talk to other people quite a bit, occasional youtube and surfing internet on daily basis and battery lasts good for me. I had S7 edge with 3,600 mAh before and surprisingly, I feel both have similar battery life, so no complaining for me. I assume that software optimization works well as Samsung presents. But if battery life is still your main concern, then simply put battery saving mode, and you will be fine since there isn't much of performance loss from it. S pen is certainly a nice thing to play with. I can draw, write things on the phone. Personally, it helps me a lot for my new work environment. I don't use Bixby much but voice commands seem to work accurately. I don't have a big hand, but location of its button doesn't bother me that much. I don't use finger print unlock thingy at all so no comments on that. Iris scan feature works well too, if you are interested. But I use pattern unlock most of time. This supposedly great dual camera works fine. Quality of pictures are certainly nice and sharp. But because photography is my acutal/serious hobby, I use DSLR a lot. So this dual camera isn't that attractive to me. Don't get me wrong though, it will serve you great for sure. I bought this phone for S pen, not camera. As many of you know it by now, screen display of this phone is phenomenal. It's beautiful and sucks you right in. I don't know much about sound quality because I use bluetooth earbuds and android auto most of the time. Speaker of the phone itself sounds decent enough but for sure there are better phones for this matter. But it's not game changer for me. I can't compare its overall with equivalent products from Apple or any other brand for that matter, because I've used Samsung phones only since beginning of the time. (being Korean does that easily for you) To sum up, for people with experiences of Samsung products, If you want the cool, latest, flagship phone of the time even if S pen is for decoration only and wallet is thick enough, then it's for you. If you want cool, latest, flagship of the time and okay with spending quite sum but not this much and S pen isn't interesting, then S8/S8+ is for you. If you use/will use S pen extensively, and/or seeking upgrade from Note 4, 5 and 7(FE), then it's for you. (Don't forget trade-in deals) If you know that you want this specific phone for sure but don't want pay this much whatsoever and have a patience, then wait til next spring/summer when S9 comes out. (Not an official, but for sure there will be one) If you are okay with wife yelling at you for paying this much on a single phone, then it's for you (totally not personal experience, just saying) These are my personal opinion, yours will be vary.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Fantastic device", 
                "review_text": "I had the Note 3 for exactly 4 years. I also bought but never much used the Nokia Lumia 1020 (better camera but lousy OS). I loved my Note 3 and used it all the time for camera, web searches, MANY audio books, some note-taking and so on. Even used it for a phone! Now that I have the Note 8, the old Note 3 seems suddenly so old and slow and clunky. I studied reviews of ALL the \"flagship\" phones including the iPhone X (overpriced). I kept thinking I PROBABLY really wanted the S-pen (MUCH improved since Note 3) but still spent many, many hours looking at other options. Finally I decided I did want the pen feature and so Samsung's monopoly won the day. Nothing about the 8 disappoints. It is a fantastic phone and super smooth and fast and elegant and excellent, comparable to or surpassing similarly priced phones, in almost every way. The ONLY problem I have is the sealed in, non-removable battery. But nobody sells a removable battery anymore. Sigh. By the way I use the S-pen (like right now) all the time. It's uses and functionlity are awesome. All-in-all, Samsung has gotten pretty much everything right, I'd say. The amount of design and tech in this thing is utterly awesome. No bloat, smooth ease of use, power! I guess I love this thing.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Great phone and seller(NGP STORE USA)", 
                "review_text": "Great phone and seller(NGP STORE USA). This order arrived one business day early but then I am just down the coast. Everything was factory sealed and brand new. This Note8 runs 4G like the one I got from T-mobile. No complaints. P.S. The phone came with a clear case in the box for free! I thought it was just a tray to hold the papers. American version of the phone didn't come with a case clear or otherwise... Will do business with NGP STORE USA again. Highly recommended", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Great phone! Got it from Wireless Place and phone ...", 
                "review_text": "Great phone! Got it from Wireless Place and phone came brand new and factory sealed. Model number is SM-N950F/DS. No \"Samsung Note8\" logo or \"DUOS\" logo on the rear, just a clean and solid \"SAMSUNG\" logo. I am pleased with the seller and so far so good with the phone.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Perfect Condition", 
                "review_text": "So I was a little unsure of the purchase at first as I've seen about 2 people post that they got an empty box but I'm glad I went through with it. The box came perfectly sealed with the following inside: * Samsung Note 8 (Dual Sim) (Condition: New) * European Charger with adapter * USB type C cable with 2 separate connectors (for transferring everything from your old galaxy to the note 8) * New AKG earbuds with extra buds in varying sizes * Sim tray unlock tool * Extra tips for your S pen with removal tool * Complimentary hard plastic case * Manual I used the cable and connectors to transfer all my files, music, photos, and texts to thr Note 8. You can also choose what you'd like to scrap before the transfer. I was set up in minutes! I've had it for a few days now, no issues. I like the fact that you can also choose if you'd want to use fast charging or regular charging. I had the same option on my Note 4. After fully charged this baby lasts hours. Currently, it is 7am as I post this review with 50% and my last charge was the afternoon prior at 2pm. Runs smoothly, no hiccups. Camera quality is amazing. Wi update my review in couple weeks.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "SM-N950F + ATT (US) = Not Happy... LTE Speed = Lacking... Wifi Calling = Not Happening... Advanced Messaging = Think Again...", 
                "review_text": "Just got this phone today SM-N950F and can say without a doubt that I am returning it. I have AT&T in the US and am switching from an Galaxy S8+ to this Note 8. Here are the problems I am having: 1) will not do carrier aggregation therefore maximum download is around 17mbps and upload is around 6mbps while in the exact same location my Galaxy S8+ download is 82mbps and upload is 44mbps. 2) AT&T will not provision LTE advanced features such as Wi-Fi calling or advanced messaging. 3) AT&T will not recognize the IMEI in order to push secondary LTE bands and with that also throttles your bandwidth. I use my phone heavily for work and require high bandwidth speeds for presentations, collaboration and other internet hog programs and therefore this specific model phone will not work for me and thought I should let everyone know what I'm experiencing. You can kind of somewhat band-aid fix some of the above issues by rooting your phone and loading custom firmware and ROMs but if I did that I could no longer user it for my job and therefore the phone is useless to me... I love everything else about the phone including the gold color and am sad to have to send it back and go buy a dang AT&T branded one.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Best phone for 2017 and beyond", 
                "review_text": "Had it for a couple hours and i absolutely love this. It came as described. Brand new sealed and all. The transition into this 18.5/9 ratio is quick after messing with settings, it made the phone even better from using gestures to get around and get the most out of the devics. This thing is fast and snappy, after changing a few settings and adding my fave launcher omg nothing can slow this down(for now). Theres only 2 things that im not entirely sold on. 1) on the back there is a DUOS branding(its not that bad but still takes away from the astetic. 2) this one is not entirely about the phone but more of the accessories it came with, since this is the international model it has a Europe charger but they did provide an adapter but it just makes the charger even more bulky.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Everything is perfect!", 
                "review_text": "I purchased the Note 8 from Wireless Place. The seller was great! The delivery was extra fast – it took only 1 business day, and the product was as described! Brand new and sealed. To sum up, I am perfectly satisfied! The phone itself is a real beast! First of all, the build quality is excellent. It feels solid, premium and outstanding. It has a \"DUOS\" logo on the back, which, in my opinion, looks good. The large display is really awesome! Great colors, great quality, it is indeed the best display on the market right now. What is more, it is not uncomfortable at all, despite its size, I can quickly get used to it. The Note 8 is ultra fast and I highly doubt that anything can slow it down. This, in addition to the big screen, makes it perfect for multitasking. I was a bit concerned about the battery life, but after using the phone for a few days I can confirm that the battery is great as well. It can easily last me a whole day and I use the phone a lot. The fingerprint sensor is not as hard to reach as people report it to be, but I still find the facial recognition better. It is super fast, even in low light, and I love it. The camera is also amazing. It has tons of options you can play with, and moreover, the pro mode lets you set the settings manually, just like you can with a DSLR, which contributes to having even better pictures. I love the \"live focus\", it creates some great bokeh photos. Although the Note 8 doesn't have dual speakers, the audio is great too. It is really loud and satisfies my needs. The phone is packed with lots of features and I love every single one of them! Some examples are the edge screen, the off screen notes, the always on display, etc. The S Pen really comes handy all the time. Having it is definitely worth it and it makes the Note series stand out. I can't say much about Bixby since I haven't used it much yet. The package comes with a charger for the UK only. The phone says it originates from the UAE and what is more, its calendar has build in muslim holidays you cannot remove. But oh well, I quickly changed my calendar app and solved that problem. All in all, I am perfectly satisfied with everything! 5/5 stars for the seller and 5/5 for the Note 8!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "SAMSUNG Galaxy Note8 64GB... Samsung", 
                "review_text": "Didn't come sealed so maybe refurbished? does work perfectly fine and came unlcoked.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Great product, great service. THANK YOU !", 
                "review_text": "I just received my SM-N950FD. The product is awesome and the service quick. I highly recommend NGP Store. THANK you Alex.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "13%", 
            "4 star": "8%", 
            "3 star": "7%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075KQ622T/pageNumber=1/ref=cm_cr_othr_d_paging_btm_1?pageNumber=1", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "One Star", 
                "review_text": "Pissed. Package was delivered with the charger and the earphones...but no phone in the box!!😠😠😠😠", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "The best phone in 2017. Unfortunately, came with UK power adapter. Other than that, perfect.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Warning - not a USA version and no warranty. Do not expect full LTE network speeds.", 
                "review_text": "Warning this is not a United States version and as a result, will suffer limits when connecting to cellular networks in the USA. While it may connect to some 3G and LTE bands, the most important bands might be missing. Furthermore, there is no excuse for offering such an expensive device without a warranty. Please note that USA model numbers all contain the letter \"U\" after the 950 such as SM-N950U. These are all the known Galaxy Note 8 model numbers: _______Galaxy Note 8 Model Numbers _______________________________________ SM-N950UZVATMB, N950UZSATMB, N950UZKATMB (T-Mobile) SM-N950UZSATMK, SM-N950UZKATMK SM-N950UZVATMK (MetroPCS) SM-N950UZVASPR, N950UZSASPR, N950UZKASPR (Sprint) SM-N950UZSAATT, N950UZVAAT, N950UZKAATT (AT&T) SM-N950UZSAATT SM-N950UZVAATT SM-N950UZVAVZW, N950UZSAVZW, N950UZKAVZW (Verizon) SM-N950UZKAVMU (Virgin Mobile) SM-N950UZVAUSC, N950UZSAUSC, N950UZKAUSC (US Cellular) SM-N950UZKAAIO (US Cricket) SM-N950UZKAXAA SM-N950U1 (Amazon US Unlocked) SM-N950UZVAXAA, SM-N950UZKAXAA (BestBuy Unlocked) SM-N950UZVATFN, N950UZSATFN, N950UZKATFN (TracPhone) _______NON USA VERSIONS: SM-N950W (Bell Mobility, Rogers Wireless, Telus Mobility Canada) SM-N9508 (China) SM-N950F (Europe) (SM-N950NZKASKO, N950NZKALUO Korea, N950NZKAKTO) SM-N950FD (Unlocked Asia, Australia) SM-N950FZKDBTU (UK) SM-N950FZDAXSA, N950FZKAXSA (Australia) __________________________________________________________________________", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Received different model.", 
                "review_text": "I received a 9500, not a 950FD. That means it's a different processor and intended for a different region. This may or may not matter to you. But if you prefer that Samsung Pay not be locked to Chinese only, or the processor makes a difference to you, you may want to look elsewhere. Phone is great, the 3-stars are just for the fact that I didn't get what I ordered.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Gorgeous", 
                "review_text": "Absolutely incredible phone. Came factory sealed and and when I turned it on it was in Korean! Beautiful, works perfect with At&t .", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Solid phone, tons of features! The dual SIM makes international travel a breeze", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "It's really great.", 
                "review_text": "It's really great. The perfect product has come. I am 100% satisfied with this product. I was worried until I saw it myself. Just plug in the \"Usim\" card and it works right away.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The best note", 
                "review_text": "I must say that I have been a user of the range note from the number 1 I have had all including the 7 the phone is absolutely spectacular order it in blackI have no complaints I did a market study since all my life I have used cell phones of 1 single sim and the one they were offering is double sim it's exactly the same the same features the model is 950F / DS I only use one sim buy a micro sd of 128 gigs and perfect. I bought it to the store that is called wireless place the shipment was super fast I arrived in a day everything sealed definitively if I had to buy another I would do with them", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "the cost was very good in comparison to others i looked at and considered", 
                "review_text": "The shipping was fast, the cost was very good in comparison to others i looked at and considered, the phone is AMAZING!!! I’m actually in the Caribbean and it works like a dream. I bought it for my daughter’s 16th birthday and will buy another for myself once I have the funds seeing that the exchange rate is almost 3-1... making it $2400 my currency. All in all an incredible purchase she’s beyond happy and is still thanking me and hugging me and I’m happy with it as well! The picture quality on this thing is out of this world", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Very disappointed", 
                "review_text": "I am excited to have this phone but i am so disappointed when i open the package the phone box sealed already been cut so i knew something wrong so i decided to take a pictures And then when i open it its totally diffrent phone .im very very very dissapointed .", 
                "review_rating": "1.0 "
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "13%", 
            "4 star": "8%", 
            "3 star": "7%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075KQ622T/pageNumber=2/ref=cm_cr_othr_d_paging_btm_2?pageNumber=2", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "The perfect smartphone. It came brand-new with everything in box as expected.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Had this phone from sine January and I av zero ...", 
                "review_text": "Had this phone from sine January and I av zero complaints. it has met my expectations and more. the versatility of it is so multidimensional. with this device there is no limits. worth every single penny.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Received the phone today. The model # is N950F/DS ...", 
                "review_text": "Received the phone today. The model # is N950F/DS. Factory Sealed. Brand New,. I don't see any different from the one you can purchase from merchant store. Still playing with this new phone, haven't tested most of the functions yet.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Samsung note 8 yaaay", 
                "review_text": "I love my phone. A bit smaller than my old phone. But I love my phone.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "its image quality is great.", 
                "review_text": "I bought this for my mom who lives in Turkey. So, there shouldn't be any problem for EU region. Additionally, its image quality is great.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Great phone", 
                "review_text": "Phone works perfect on metro pcs", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Great handwriting recognition", 
                "review_text": "I have been using Note for a number of years. This is my third note (Note original, Note 3, and this one). The handwriting recognition is one of its best features. I use it quite often, writing SMS, WhatsApp, and taking notes during meetings. It is also a o lot faster than my Note 3, but that's probably because my Note 3 was very old.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Love all of the new features", 
                "review_text": "This replaces my Note 5. Love all of the new features!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "awesome as", 
                "review_text": "Well, what else i could say? it's a note 8, awesome as is", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Pretty much brand new!", 
                "review_text": "This came with everything I ever hoped for 🤗 came with all of the accessories and even a clear case! I highly recommend buying from this seller!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "13%", 
            "4 star": "8%", 
            "3 star": "7%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075KQ622T/pageNumber=3/ref=cm_cr_othr_d_paging_btm_3?pageNumber=3", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "... number wasn't even registered through Samsung was a scam waste of money don't buy from this", 
                "review_text": "didn't work and the imei number wasn't even registered through Samsung was a scam waste of money don't buy from this seller", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "No phone in the box", 
                "review_text": "I received only a box no phone I'm not paying $800 for an empty box.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "I'm in love with my phone", 
                "review_text": "I'm in love with my phone, Amazon has made me smile all the way. Thank you guys product is just fantastic, came as mentioned.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "This phone is one of the best phones I have ever used", 
                "review_text": "This phone is one of the best phones I have ever used. Am yet to find any negatives about it. My only disappointment is when I gathered, the phone was originally being sold with its docking system but I have it buy that one separately. Apart from that, it's all good.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "The best Smartphone...", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Phone is great but did not receive stylus pen", 
                "review_text": "Phone is great but did not receive stylus pen with it. Not to happy about that.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "This is the best cellphone I ever had", 
                "review_text": "This is the best cellphone I ever had. It's my office where ever I am. Sometime I need to charge it for a little while because all the day I'm scanning, texting, sending emails... I work a lot with it.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "I received", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The package reach almost 1 week in advance it was ...", 
                "review_text": "The package reach almost 1 week in advance it was a plus because i had to travel. I lovee my phonee!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The phone itself is very nice but my problem was with signal strength", 
                "review_text": "The phone itself is very nice but my problem was with signal strength.... Using both t-mobile and att Sims the signal was very poor compared to even the dual Sim blackberry keyone I have. Service would cut in and out like crazy on the note 8 on both Sims where as the keyone would have either 2-3 bars of lte. Unfortunately the phone had to be returned.", 
                "review_rating": "3.0 "
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "13%", 
            "4 star": "8%", 
            "3 star": "7%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075KQ622T/pageNumber=4/ref=cm_cr_othr_d_paging_btm_4?pageNumber=4", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "perfect!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Product quality is perfect", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Perfect phone for what we need!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "love my phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Its dependable .", 
                "review_text": "The Samsung galaxy note 8 Dual SIM International version is a very nice phone . I'm very pleased with this product in every way . Functionality of it fits my everyday uses and the stylish appearance is on point .", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Amazing cellphone, however samsung pay app is in language thai", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Working as it should", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Muy bueno", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Amazing. Seller tanks.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "The best of the best", 
                "review_text": "I'm writing on it.... Es a powerful smartphone!!! The best of the best!! Amazing!!!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "13%", 
            "4 star": "8%", 
            "3 star": "7%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075KQ622T/pageNumber=5/ref=cm_cr_othr_d_paging_btm_5?pageNumber=5", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Five Stars", 
                "review_text": "wuv it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Camera", 
                "review_text": "Marvelous, wonderful!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "In love with my phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Phone works great, and for the price is shouldn't be surprised ...", 
                "review_text": "Phone works great, and for the price is shouldn't be surprised that the phone i received was a Chinese model. Giving it three stars do to the fact that this was no where on the page's description. Although it said it was an internation version, not sure why the box was covered in Chinese.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Love it", 
                "review_text": "I got it 6 months ago and I still love this phone. The S pen is awesome, and has a great camera.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "J'en ai trouvé un autre moins cher pour 128 Gb .... et neuf ... dommage", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "it functions great but it seems to overheat, the phone is very got.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Love the phone is awesome, great delivering time and perfect boxing", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Best best best.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Excelente, be all right!", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "13%", 
            "4 star": "8%", 
            "3 star": "7%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075KQ622T/pageNumber=6/ref=cm_cr_othr_d_paging_btm_6?pageNumber=6", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Class In absolutely love this phone", 
                "review_text": "Top. Class In absolutely love this phone..", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "so far its the best phone I ever owned. absolutely in love with it.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Excellent product and excellent seller. I recommend them without reservations!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Excellent phone. Best camera ever.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great phone!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great device!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "very good", 
                "review_text": "very good", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "I really nice love it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Best phone in the world right now!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "It was the best", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "13%", 
            "4 star": "8%", 
            "3 star": "7%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075KQ622T/pageNumber=7/ref=cm_cr_othr_d_paging_btm_7?pageNumber=7", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Works as expected. Tho since this is a N( ...", 
                "review_text": "Works as expected. Tho since this is a N( North Korea) version. Samsung pay will not work in the US. Tho I do have oem lock available in Dev options.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "Bought note 8 and got a s8+ try to return but not able to. Help", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Buy your next phone from NGP.", 
                "review_text": "Phone is brand new and is in the expected top condition. Thank you, Samsung for letting me type this review on the king of all smartphones. Also, a SPECIAL thanks to NGP for including the international adapter on top of the already decreased price. Awesome job.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Good phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Very nice phone. When I first turned it on it ...", 
                "review_text": "Very nice phone. When I first turned it on it was all in Chinese, I had to randomly clock on things and play with it until my luck hit and the language changed to English.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "the phone is fine, but i don't have what i want", 
                "review_text": "the phone is fine, but I do not have the headphones that should come with it, nor the original charger, nor the adapters, nor the manuals, nor the box. I did not like that at all.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "EXCELLENT SELLER! WORKED PERFECTLY!!!!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Its a legit samsung galaxy", 
                "review_text": "Great phone love it", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Excellent phone is dual SIM, great camera, loads of features.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Four Stars", 
                "review_text": "Very Good phone, to expensive.", 
                "review_rating": "4.0 "
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "13%", 
            "4 star": "8%", 
            "3 star": "7%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075KQ622T/pageNumber=8/ref=cm_cr_othr_d_paging_btm_8?pageNumber=8", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "Performing as advertised!", 
                "review_text": "Received 2 days ago. So far, performing as advertised. Prime real estate on the screen. This is my first android phone so we will see how it goes from here.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Everything perfect!!! the service and the product. I recommend!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I wouldn't recommend this to anyone who wants the new Note8 or ...", 
                "review_text": "The only plus to this package was the fact it arrived a week before intended schedule. The downside to it all is the fact that it is a used phone. It's not new and nowhere does it say in description about it being a used phone. I wouldn't recommend this to anyone whois under the impression of the new Note8 or any new phone in general. I'm not one for refurbished phones and never will be. It is however GSM compatible, for AT&T and T-Mobile, but not CDMA (Sprint, Verizon, etc). WiFi calling is not an available feature, so I do apologize for stating otherwise.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Awesome phone...no problems with battery life so far.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Very nice phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "I like the outlook of the phone", 
                "review_text": "I like the outlook of the phone. But there is something wrong with the LCD. Sometimes it freezes. There is something like a stain on the top right corner of the screen like a leak or something I don't know. It is just anoying.", 
                "review_rating": "3.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Good Job", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "great phone", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Great all around", 
                "review_text": "Loved the phone worked great and has amazing display and camera", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "https: //www. amazon.", 
                "review_text": "https://www.amazon.com/dp/B07255GLZ9/ref=cm_cr_ryp_prd_ttl_sol_1", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "13%", 
            "4 star": "8%", 
            "3 star": "7%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075KQ622T/pageNumber=9/ref=cm_cr_othr_d_paging_btm_9?pageNumber=9", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "It's a great phone, I switched over from IOS", 
                "review_text": "It's a great phone, I switched over from IOS, greatest decision ever made. Apple's recent products very disappointing, Apple died when Steve Jobs passed away.....nothing great been launched since then....", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "I have no idea why these are supposed to be so special 😑", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Don't buy", 
                "review_text": "Stuck on 3g. Won't connect to at&t 4g or LTE networks. Entered all the correct APN settings.", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "One Star", 
                "review_text": "So disappointed:(", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Its a nice phone, but d keyboard didnt function well", 
                "review_text": "Its a nice phone, but d keyboard didnt function well, constantly drop out while typing. Got no time to return d item with a risk of 20% restocking fees.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Factory fresh, fast delivery!", 
                "review_text": "Came 1 day early! Product is exactly as described, very nice! Great place to purchase smartphones!", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "It is what it says it is. Arrived earlier than scheduled. Thanks.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "It's not compatible with some of the major cellular service carriers.", 
                "review_text": "It was advertised as the factory unlocked device. As soon as I opened it there was a notice that it is not compatible with Verizon Wireless or Sprint. I believe that is NOT unlocked.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Better than US Carrier Note 8's", 
                "review_text": "Better than USA models 1. Unlocked 2. Dual Sim slots 3. Unlike locked US carrier phones, you can take this phone to Asia, Europe, South America.......and it works. 4. It actually has more cellular bands than US Phones. 5. Not filled with US Carrier bloatware apps 6. Yes LTE works just fine on AT&T and T-Mobile, Straight Talk....etc 7. Remember it's GSM......forget Verizon, Sprint", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "both ZDNet and Forbes reviewers said it was the best phone for business use compared to the IphoneX", 
                "review_text": "I had held off buying this phone because of some reviews on the battery life. However, both ZDNet and Forbes reviewers said it was the best phone for business use compared to the IphoneX. My phone company gave me a 50% off deal and so I bought. Glad I did! The battery life has been great. I easily get through a 24 hour period with no more than 75% of the battery life used up. On light days I can get 48 hours of use before hitting the 25% left notice. Don't listen to those people saying they only get 4 hours. The only people getting that kind of result are doing a lot of streaming and game playing and there is no phone out there that will go more than 4 or 5 hours doing that. The Spen has become a good business tool for me and I'm now doing business on the phone I used to reserve for my desktop. One person I know bought one and he has now ditched his Ipad for the Note 8 when he is on the road. So far, best phone I've ever had.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "13%", 
            "4 star": "8%", 
            "3 star": "7%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075KQ622T/pageNumber=10/ref=cm_cr_othr_d_paging_btm_10?pageNumber=10", 
        "name": ""
    }, 
    {
        "reviews": [
            {
                "review_header": "International model Note 8 not serviceable in the USA", 
                "review_text": "While choosing dual sim clearly shows international version in the product title, the single sim version doesn't however I can confirm it is an international model. I purchased this sold and shipped by Amazon (not third party) and received a brand new model SM-N950F phone. Given how delicate the phone is, warranty is important to me. While I was informed it would be covered by Samsung's 1 year warranty even with it being an international model because I purchased it from an authorized USA dealer (sold and shipped by Amazon), I ended up returning it. Why? While Samsung support will say the phone will be covered under warranty, in practice you won't be able to get it service as the Samsung repair centers won't touch international model phones. Call the actual Samsung phone service centers and ask. It sort of makes sense since they won't have all the same parts the international models have. If you can live with the risk of no warranty and it not being serviceable in the USA by Samsung repair centers, it's a fine phone.", 
                "review_rating": "4.0 "
            }, 
            {
                "review_header": "Phone is Terrible", 
                "review_text": "I can't find anywhere else to write a review to explain my displeasure with the Note 8, so I though I would write it here. I upgraded from the Note 5, because it was time. I enjoyed the Note 5. I never had any issues. The pictures were great, all videos worked properly, and I never got pop-up \"your phone is infected with 4 viruses\" while reading articles in Google Chrome. I was very pleased with the Note 5, so I couldn't wait to upgrade to the Note 8. I am having issues with the aforementioned. I would totally switch back to the Note 5 if I could. It was reliable. When I was videos, from YouTube to Twitch, the video either wants to minimize into its own window (with Twitch) or it tries to (with YouTube). Simply put, this phone is terrible.", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Great, but Pricy We as consumers mostly like to ...", 
                "review_text": "Great, but Pricy We as consumers mostly like to have the latest and greatest, especially when it comes to electronics. Today I want to share why I choose the Samsung Galaxy Note 8. There are far too many unique features to talk about. Although it looks great, there are more factors that played a role in making the decision to own it. SOFTWARE Freshly re-branded Samsung Experience is a mature Android and its qualities set it apart from other Android phones. Samsung Experience is very customizable. From the home screen you can swipe up or down to open your app cabinet. The screen supports over 4000 pressure sensitivity points, meaning tiny adjustments in pressure will change how your scribbles appear. CAMERA The main camera is excellent, producing clear, detailed and colorful shots that are worthy. There loads of modes to choose from, and there’s even a Pro mode for adjusting settings such as shutter speed to your exact liking. While retaining the overall same look and approximate same size as the Galaxy S8+, it features and upgraded processor, and, For the first time in Samsung’s smartphone history, a dual-camera system in the rear of the device; one functions as a wide-angle lens and the other as the telephoto lens, with both featuring 12MP resolution and optical stabilization. PROCESSING POWER The Note 8 is powered by a Exynos 8895 or Snapdragon 835 processor, depending on geographic region, along with 6GB of RAM. In the US it is sold with 64GB of internal storage along with a microSD card support, which is another favorite feature. The handset features a fingerprint scanner next to the rear camera, and retains facial recognition and iris recognition, which is similar to the S8. S PEN The S Pen offers expanded software features for the creation of handwritten notes. I love and use this feature a lot. I can remove the S Pen and immediately start writing notes on the display, which works due to the screen’s always-on capabilities. “Translate” is another great feature I love. It recognizes punctuations, lets me highlight entire sentences, and supports 71 different languages. The only thing I had to justify was a price. Thanks to those “deals” I did not have to dish out whole $950 at once. It was broken down to small monthly payment with no interest and I became an owner of Note 8. In conclusion, I love my phone, although I’m still learning every day something new about it. The looks, the works, the camera and all the features it comes with.", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "device came in good condition however upon powering it on", 
                "review_text": "device came in good condition however upon powering it on, it started with the safe mode on and provided the technicians data and commands that no customer would like to see on a new phone!! a reboot cured the problem! does not work with the wireless fast charger i bought from samsung!!", 
                "review_rating": "2.0 "
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Love this phone and color unbelievable clearity", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "Not meant for network carriers", 
                "review_text": "I give it a 1 star, not because of the phone but because of the crappy description... this will not work on Verizon or similar networks... it's not the right version...", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Screen broke after a 5 INCH FALL", 
                "review_text": "Extremely fragile. After only 6 days of use it fell from my hand to the table (about 5 inches) and the screen cracked, part of the screen went green and stopped working. What about the \"gorilla glass\"?? What kind of \"gorilla glass\" can't resist to a 5 inch fall? Samsung has charged me 430 dollars (in Brazil) to Fix the damn thing. DON'T BUY IT!!", 
                "review_rating": "1.0 "
            }, 
            {
                "review_header": "Better than Apple", 
                "review_text": "It is a great phone and I switched from Apple to Samsung and I was surprised that it would be better that my iPhone 7+ it has a better camera, a stylus, and so many features that makes it better", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "It's the best", 
                "review_text": "love this item!!! wish i could get one for my Youtube video", 
                "review_rating": "5.0 "
            }, 
            {
                "review_header": "It's a winner!", 
                "review_text": "To soon to tell. So far I love it and learning something new everyday.", 
                "review_rating": "5.0 "
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "13%", 
            "4 star": "8%", 
            "3 star": "7%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/product-reviews/B075KQ622T/pageNumber=11/ref=cm_cr_othr_d_paging_btm_11?pageNumber=11", 
        "name": ""
    }
]